[
  {
    "cno": "ELA032",
    "term": "Spring Term",
    "title_j": "リベラルアーツ英語プログラム(Stream 3)：アカデミック・スキル",
    "title_e": "English for Liberal Arts Program(Stream 3): Academic Skills",
    "regno": 10106,
    "lang": "Language of Instruction: E",
    "summary_e": "This course offers instruction in various skill areas such as study skills, research, presentation, and communicative skills. The course is divided into three terms and must be taken in sequence. The learning goals include building academic and language skills to fully participate in Academic Reading and Writing and Reading and Content Analysis courses, as well as preparing for courses taught in English outside the ELA. The course consists of components such as ATS, S&amp;L, R&amp;E, AP, EWC, AD, L&amp;CD, PR, and ER3. The language of instruction is English, and grading is based on attendance, participation, and assignments.",
    "summary_j": "このコースは、学習スキル、リサーチ、プレゼンテーション、コミュニケーションスキルなど、さまざまなスキル領域の指導を提供します。コースは3学期にわたって教授され、順番に受講する必要があります。学修目標は、ELAのAcademic Reading and WritingおよびReading and Content Analysisコースでの学習や、ELA外で開講される英語での授業の準備に役立つ学術および言語スキルを構築することです。また、ASクラスで教えられるスキルは、ICUでの国際的な大学生活にも参加しやすくすることも目的としています。コースの内容は、ATS、S&amp;L、R&amp;E、AP、EWC、AD、L&amp;CD、PR、ER3の各コンポーネントで構成されています。言語の指導言語は英語であり、出席と参加、課題の提出による成績評価基準が適用されます。"
  },
  {
    "cno": "ELA032",
    "term": "Autumn Term",
    "title_j": "リベラルアーツ英語プログラム(Stream 3)：アカデミック・スキル",
    "title_e": "English for Liberal Arts Program(Stream 3): Academic Skills",
    "regno": 20105,
    "lang": "Language of Instruction: E",
    "summary_e": "This course provides instruction in a variety of skill areas such as study skills, research, presentation, and communicative skills. The course is taught over three terms which must be taken in sequence. The goal of the course is to build academic and language skills necessary for students to fully participate in ELA courses and English-taught courses outside of ELA. The skills taught in the course will also help students participate more fully in international aspects of university life at ICU.",
    "summary_j": "このコースは、学習スキル、リサーチ、プレゼンテーション、コミュニケーションスキルなど、さまざまなスキル領域の指導を提供します。このコースは3学期にわたって教授され、順に受講する必要があります。学修目標は、ICUのELAで教えられるコースや英語で教えられる他のコースに参加するために必要な学術的なスキルと言語スキルを構築することです。また、ASクラスで教えられるスキルは、ICUにおける国際的な大学生活にもより積極的に参加するためにも役立つでしょう。"
  },
  {
    "cno": "ELA032",
    "term": "Winter Term",
    "title_j": "リベラルアーツ英語プログラム(Stream 3)：アカデミック・スキル",
    "title_e": "English for Liberal Arts Program(Stream 3): Academic Skills",
    "regno": 30103,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is designed to teach practical English language skills for effective communication, including study skills, research, presentations, and academic discussion. The course is organized into three terms, which must be taken in sequence. The curriculum for Stream 3 is aimed at students at the CEFR B1-B2 level. The winter term of the course consists of elective components such as Academic Debate, Lectures and Critical Discussion, Pronunciation, and Extensive Reading. The course aims to help students develop academic and language skills necessary for participating fully in university life and academic courses taught in English. Attendance, participation, and assignments will be used for grading.",
    "summary_j": "このコースは、学習スキル、リサーチ、プレゼンテーション、コミュニケーションスキルなど、さまざまなスキル領域を教えるものです。このコースは、順次受講する必要のある3学期で教えられます。Stream 3のカリキュラムは、ELA配属時のCEFR B1-B2レベルの学生を対象に設計されています。冬学期のコースは、次のコンポーネントで構成されています。[選択的コンポーネント] 前期の事前登録を通じて、学生は以下から2つのコンポーネントを選択します。フレッシュマンSEAプログラムに参加した学生は、これらのコンポーネントから免除されます。Academic Debate (AD): 週1回の授業時間, Lectures and Critical Discussion (L&amp;CD): 週1回の授業時間, Pronunciation (PR): 週1回の授業時間, Extensive Reading (ER3): 週1回の授業時間。"
  },
  {
    "cno": "QEED523",
    "term": "Autumn Term",
    "title_j": "遠隔教育と eラーニング",
    "title_e": "Distance education and e-learning",
    "regno": 22105,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to provide a comprehensive understanding of distance education and e-learning from the perspectives of pedagogy, educational equity, and quality improvement. Selected research papers, case studies, policies, and evaluation reports on distance education and e-learning will be thoroughly analyzed. Students will also be tasked with designing a short module on a chosen topic within the field. The course focuses on developing critical skills in applying up-to-date knowledge to instructional interventions and provides opportunities for learners to read contemporary studies about learning in new media, instructional design, and mediated learning. The course also includes activities such as design critique and peer feedback. The grading policy includes completing an anti-plagiarism online certificate, participating in empathy tasks, writing critiques of online courses, presenting mock-ups of original solutions, providing peer feedback, and reflecting on the use of peer feedback in design revisions.",
    "summary_j": "このコースは、ペダゴジー、教育の平等と質向上の観点から、遠隔教育とｅラーニングについてより深く理解することを目的とする。遠隔教育とｅラーニングに関する優れた研究論文、事例研究、政策および評価報告書を読み、分析する。選ばれたトピックで遠隔教育/ｅラーニングの短いモジュールをデザインすることを課題とする。学修目標は、学習者が最新の知識を分析と教育介入のデザインに適用するための批判的なスキルを開発することである。学習者は新しいメディア、新しいリテラシー、多重モード学習、教示デザイン、およびどのように媒介された学習がデザインされるかについての現代の研究を読むことになる。学習者は迅速なプロトタイプを作成し、基本的な批判を経験する。コンテンツには、COIモデル、最小の指示、ゲーム理論、問題解決学習介入、ヒューマンセンタードデザインなどが含まれる。成績評価基準は、オンラインの反抄襲証明書の取得、共感タスクへの参加、オンラインコースの批評、リビジョン、学習問題のモックアップの提示、クラスメートのデザインに対する書面のフィードバック、デザインのリビジョンにおけるフィードバックの使用に関する考察などで構成される。"
  },
  {
    "cno": "WGR101",
    "term": "Spring Term",
    "title_j": "ドイツ語 I",
    "title_e": "German I",
    "regno": 10513,
    "lang": "Language of Instruction: O",
    "summary_e": "This course is an introduction to German for beginners, covering all four skills - speaking, listening, writing, and reading. The focus is on learning basic conversational skills for everyday interactions in German, using a commonly used textbook. The class aims to provide a natural feel for the language and prepare students for the \"Start Deutsch A1\" level.",
    "summary_j": "この講座は、初心者のためのドイツ語入門です。話す、聞く、書く、読むの４つのスキルをカバーしており、ドイツ語での日常会話の基礎を学びます。教科書は一般的に使用されるものを使用しています。この講座では、ドイツ語に対する自然な感覚を身に付け、\"Start Deutsch A1\"レベルに向けて準備を行います。"
  },
  {
    "cno": "WGR101",
    "term": "Spring Term",
    "title_j": "ドイツ語 I",
    "title_e": "German I",
    "regno": 10514,
    "lang": "Language of Instruction: O",
    "summary_e": "This course is an introduction to German for beginners. The goal is to develop basic communicative skills and a natural feel for the language. Using a popular textbook used in language schools worldwide, students will learn all four language skills - speaking, listening, writing, and reading - while also gaining insight into German culture and society. Continuous attendance is crucial for success in the course.",
    "summary_j": "この講座は、ドイツ語を初めて学ぶ人のためのコースです。ドイツ語の基礎的なコミュニケーション能力と自然な感覚を身に付けることを目標にしています。教科書を使用して、４技能（話す、聞く、書く、読む）を習得すると同時に、ドイツの文化や社会についても学びます。試験に備えるため、授業への連続した出席が非常に重要です。"
  },
  {
    "cno": "CHM103",
    "term": "Spring Term",
    "title_j": "基礎化学",
    "title_e": "General Chemistry",
    "regno": 11150,
    "lang": "Language of Instruction: J",
    "summary_e": "This course focuses on the concepts of chemical bonds, molecular structure, and molecular orbitals to understand chemical reactions and kinetics, as well as chemical thermodynamics and electrochemistry. Students will learn about chemical thermodynamics, which is essential for understanding reactions and the properties of matter. They will also explore the relationship between chemical and physical changes, energy, and chemical equilibrium. Additionally, the course covers reaction kinetics, including reaction rates, equations, order, mechanisms, and catalysis. The schedule may change based on the progress of the lectures. Grading will be based on a mid-term exam, final exam, assignments, and active participation. It is recommended to have a background in concepts of chemistry and mathematical knowledge at a high school level or calculus.",
    "summary_j": "この講義では、化学結合、分子の構造、分子軌道の概念を用いて化学反応や化学の速度論、熱力学、電気化学などを理解するための基礎知識を学びます。また、化学熱力学や化学反応速度論の用語、式、法則、定数などを理解し、物質の変化やエネルギーの関係、化学平衡の基本的な概念を身につけることが目標です。講義の内容は、気体、熱力学第一法則、熱力学第二法則、ギブズエネルギー、化学平衡、反応速度論などを順番に扱います。教科書の章に沿って進められ、スケジュールは講義の進行によって変更されることがあります。成績評価は中間試験、期末試験、課題、積極的な参加の割合で行われます。"
  },
  {
    "cno": "WGR102",
    "term": "Autumn Term",
    "title_j": "ドイツ語 II",
    "title_e": "German II",
    "regno": 20512,
    "lang": "Language of Instruction: O",
    "summary_e": "This class is a continuation of German I, aiming to deepen basic grammatical structures and vocabulary knowledge. It specifically focuses on everyday life in German-speaking countries, covering topics such as health, shopping, cultural festivities, transport, travel, and tourism. The class is open to students who have previous knowledge of German, and it emphasizes all four linguistic skills - speaking, listening, writing, and reading - for everyday interaction in German. A commonly used textbook in German language schools is used, which also provides ample information about German culture and society. The learning goals of the class are to prepare for level \"Start Deutsch A1\" and to provide skills for level 3 of Diplom Deutsch in Japan.",
    "summary_j": "このクラスはドイツ語Iの続きであり、基本的な文法構造と語彙知識をより深めることを目的としています。特にドイツ語圏の日常生活に焦点を当て、健康、買い物、文化的な祭り、交通、旅行、観光などのトピックを扱います。このクラスはドイツ語を学習したことがある他の学生も歓迎されており、話す、聞く、書く、読むといった全ての言語スキルに焦点を当てています。一般にドイツ語学校で使用されている教科書を使用し、ドイツの文化と社会に関する豊富な情報も提供します。授業の目標は、「Start Deutsch A1」というレベルの準備をすることと、「ドイツ語技能検定」のレベル3に挑戦するスキルを提供することです。"
  },
  {
    "cno": "WGR103",
    "term": "Winter Term",
    "title_j": "ドイツ語 III",
    "title_e": "German III",
    "regno": 30509,
    "lang": "Language of Instruction: O",
    "summary_e": "English Summary / 英語要約:\n\"German III\" is a course that aims to enhance vocabulary knowledge and learn more complex grammatical structures. Students will learn how to express themselves on various topics such as family life, health, education, and plans for the future. This class continues from \"German II\" but is also open to other students with comparable knowledge of German. The focus will be on all four linguistic skills - speaking, listening, writing, and reading - as well as addressing increasingly complex topics and grammatical constructions from German everyday life. The textbook used in the class also provides ample information about German culture and society.",
    "summary_j": "Japanese Summary / 日本語要約:\n『ドイツ語III』は、語彙力を高め、複雑な文法構造を学ぶことを目的とした授業です。家庭生活、健康、教育、将来の計画など、さまざまなテーマについて自己表現する方法を学びます。このクラスは、前の授業『ドイツ語II』から続けて学ぶことができますが、同程度のドイツ語の知識を持つ他の学生も歓迎されています。話す、聞く、書く、読むといった4つの言語技能に焦点を当てながら、ドイツの日常生活からますます複雑なトピックや文法構造に取り組みます。使用する教科書にはドイツの文化や社会についての豊富な情報も提供されています。"
  },
  {
    "cno": "QPPE517",
    "term": "Winter Term",
    "title_j": "会社と社会",
    "title_e": "Corporations and Society",
    "regno": 32263,
    "lang": "Language of Instruction: E",
    "summary_e": "This course examines the role of corporations in society, focusing on ethics and corporate governance. It aims to help students understand the evolving role of corporations, the importance of corporate governance, and the challenges of managing in an ESG (environmental, social, and governance) world. The course covers topics such as cross-cultural interaction, neuroscience, artificial intelligence, and ESG. Students will gain theoretical knowledge, practical skills, and insights from business leaders. The course is open to students of any major and is taught by a native English-speaking instructor.",
    "summary_j": "このコースは、企業の社会的役割、倫理、および企業ガバナンスに焦点を当てています。企業の進化する役割、企業ガバナンスの重要性、ESG（環境、社会、ガバナンス）の世界での経営の課題を理解することを目的としています。異文化間の相互作用、神経科学、人工知能、ESGなどのトピックをカバーします。学生は理論的な知識、実践的なスキル、ビジネスリーダーの洞察を得ることができます。どの専攻の学生でも履修可能で、ネイティブスピーカーの英語講師によって教えられます。"
  },
  {
    "cno": "GEL001",
    "term": "Spring Term",
    "title_j": "リベラルアーツセミナー",
    "title_e": "Liberal Arts Seminar",
    "regno": 10327,
    "lang": "Language of Instruction: E",
    "summary_e": "The \"Climate Justice\" seminar is designed to introduce students to the concept of climate change as a problem of political power rather than solely a scientific or technological issue. Through critical thinking, reading, discussion, presentation, and writing, students will develop the skills necessary for a liberal arts education. The course is divided into three units: \"The culture and politics of climate change,\" \"Models of climate justice,\" and \"Climate change in literature.\" Students will study a variety of academic and non-academic materials and complete assignments to reinforce their learning. The course is conducted in English, but students are allowed to speak any language during partner and group activities.",
    "summary_j": "リベラルアーツ教育への導入セミナーは、少人数のセミナー形式で行われる。文学、エッセー、プレゼンテーション、議論の精読を通じて、リベラルアーツ教育に必要な方法論的な知識と技能を学生に習得させることを目指している。学問分野と指導言語は教員によって異なる。第1年次または第2年次の履修が強く推奨されている。"
  },
  {
    "cno": "CHM241",
    "term": "Spring Term",
    "title_j": "物理化学 I",
    "title_e": "Physical Chemistry I",
    "regno": 11151,
    "lang": "Language of Instruction: J",
    "summary_e": "This lecture course aims to study the basics of quantum theory, such as the wave equation, wave function, and expectation value. It also aims to deepen the understanding of chemical equilibrium (macroscopic property) in terms of chemical thermodynamics (enthalpy, entropy, free energy, etc.), and to understand the view of spontaneous changes (chemical reaction) in terms of the chemical potentials of substances. The topics covered in the course include gas properties, the First Law, methodology, the direction of spontaneous change, phase equilibrium, and chemical equilibrium. The learning goals include understanding the mathematical description of chemical thermodynamics, understanding chemical equilibrium in terms of enthalpy, entropy, and free energy, and understanding spontaneous changes in terms of chemical potentials. The grading policy consists of a mid-term exam, final-term exam, and assignments. The lecture will be conducted in Japanese.",
    "summary_j": "この講義コースでは、量子論の基礎である波動方程式、波動関数、期待値などを学ぶことを目的としています。また、化学熱力学（エンタルピー、エントロピー、自由エネルギーなど）に関する化学平衡（マクロな物性）の理解を深め、物質の化学ポテンシャルによる自発的変化（化学反応）の見方も理解することを期待しています。講義内容には、気体の性質、第一法則、方法論、自発的変化の方向、相平衡、化学平衡などが含まれており、学修目標は数学的記述法や熱力学の理解、化学平衡の理解、自発的変化の見方の理解です。成績評価の基準は中間試験、期末試験、課題提出の割合で構成されています。講義は日本語で行われます。"
  },
  {
    "cno": "LAW102",
    "term": "Spring Term",
    "title_j": "法学入門",
    "title_e": "Introduction to Legal Science",
    "regno": 11230,
    "lang": "Language of Instruction: E",
    "summary_e": "This module provides an introductory study of law or legal studies. It covers various concepts, principles, frameworks, and research methods in legal studies. The main learning goals include understanding and explaining basic terms and concepts of legal studies, acquiring knowledge of major legal systems, and gaining skills to analyze and explain legal aspects of social issues. The module consists of lectures, online discussions, and student presentations on related topics.",
    "summary_j": "この講義は法学または法学の基礎を学ぶためのものです。法学における様々な概念、原理、フレームワーク、研究方法などをカバーしています。主な学修目標は、法学の基本的な用語や概念を理解し説明すること、主要な法体系の知識を獲得すること、社会的問題の法的側面を分析し説明するスキルを身につけることです。講義は、オンラインでのディスカッションや学生による関連トピックのプレゼンテーションなどで構成されています。"
  },
  {
    "cno": "PSY221",
    "term": "Spring Term",
    "title_j": "心理学実験",
    "title_e": "Experimental Research Method in Psychology",
    "regno": 11315,
    "lang": "Language of Instruction: J",
    "summary_e": "In this course, students will learn the basic principles and methodologies for psychological research through conducting various experiments and practicum. The course covers fundamental experiments selected from different areas of psychology such as cognitive psychology and neuroscience. Additionally, students will have the opportunity to design and conduct their own experiments in a group project, analyze and discuss the results, and write a scientific research report.",
    "summary_j": "このコースでは、心理学の基礎的な実験と実習を通じて、心理学研究を行うために必要な研究デザインと実験方法を学びます。認知心理学や神経科学などのさまざまな心理学の分野から選ばれた基礎的な実験から高度な実験までを取り扱います。"
  },
  {
    "cno": "CHM341",
    "term": "Autumn Term",
    "title_j": "物理化学 II",
    "title_e": "Physical Chemistry II",
    "regno": 21164,
    "lang": "Language of Instruction: J",
    "summary_e": "This course is an intermediate course for understanding the behavior of electrons based on quantum mechanics. Quantum mechanics is a powerful tool for interpreting molecular spectra, molecular geometry, properties of transition metal complexes, and predicting intermediates in chemical reactions. The learning goals are to understand the methodology of quantum mechanics and apply it to atoms and molecules. The course covers the principles and introduction of quantum mechanics, the Schrodinger equation, particle motion, atomic structure and spectra, and molecular structure. The grading policy includes a mid-term exam, final exam, and assignments.",
    "summary_j": "このコースは、量子力学による電子の振る舞いを理解するための中級コースであり、分子スペクトルの解釈、分子構造、遷移金属錯体の性質、化学反応の中間状態の予測など、重要なツールである量子力学を学ぶためのものです。学修目標は、(a) 量子力学の方法論を学ぶこと、 (b) 量子力学を原子や分子に適用することです。授業内容は、量子力学の原理と導入、シュレディンガー方程式、粒子の運動、原子の構造とスペクトル、分子構造などです。"
  },
  {
    "cno": "MCC234",
    "term": "Autumn Term",
    "title_j": "パブリック・コミュニケーション",
    "title_e": "Public Communication",
    "regno": 21286,
    "lang": "Language of Instruction: E",
    "summary_e": "The course aims to develop students' skills in effective communication as a speaker, listener, or interpreter. It emphasizes the application of rhetorical theory to express oneself and ideas effectively for a specific purpose. Critical thinking skills are cultivated through activities such as preparation, execution, and critique of various forms of public communication.",
    "summary_j": "このコースでは、話し手、聞き手、通訳者などの役割になるための効果的なコミュニケーション能力を学ぶことが目標とされています。レトリック理論を応用し、特定の目的のために自己とアイデアを効果的に表現するためのスキルを身につけることが重視されています。さらに、公共のコミュニケーションの形式を準備し、作成し、批評することで、批判的思考プロセスが強調されています。"
  },
  {
    "cno": "JLP012",
    "term": "Spring Term",
    "title_j": "日本語J2",
    "title_e": "J2: Japanese",
    "regno": 10202,
    "lang": "Language of Instruction: J",
    "summary_e": "This course is a CEFR Level A1/A2 course that focuses on spoken and written Japanese. The main focus is on interactive communication activities and aims to develop overall language proficiency. The course has ten class hours per week and the prerequisite is completing the \"J1: JAPANESE\" course or its equivalent. The course will use Google Classroom as the Learning Management System and students are required to bring their own notebook computers. The learning goals of the course include understanding the main points of texts, speaking and writing phrases on familiar topics, and exchanging ideas and information. The content of the course includes listening, speaking, reading, and writing activities on various topics. The grading policy consists of a final exam, mid-term exam, and usual performance score.",
    "summary_j": "このコースは、日本語の話し言葉と書き言葉のCEFR A1/A2レベルを対象としたコースです。主な焦点は対話型のコミュニケーション活動であり、総合的な言語力を発展させることを目指しています。週に10時間の授業があり、受講の前提条件は「日本語J1」の修了または同等のレベルです。このコースでは、Learning Management SystemとしてGoogle Classroomを使用し、授業でノートパソコンを使用する必要があります。学修目標は、テキストの要点を理解し、身近なトピックに関するフレーズを話したり書いたりすること、アイデアや情報を交換することなどです。コースの内容は、さまざまなトピックについての聞く、話す、読む、書く活動です。成績評価基準は、期末試験、中間試験、通常の成績の割合からなります。"
  },
  {
    "cno": "PHY102",
    "term": "Autumn Term",
    "title_j": "初級物理学",
    "title_e": "Introduction to Physics",
    "regno": 21310,
    "lang": "Language of Instruction: E",
    "summary_e": "This course provides an introduction to the fundamental concepts and laws related to energy and motion in the physical sciences. The emphasis is on the principles of mechanics, providing a basis for scientifically approaching various natural phenomena. It is strongly recommended to have a prerequisite in calculus.",
    "summary_j": "このコースでは、物理科学におけるエネルギーと運動に関連する基本的な概念と法則についての導入が行われます。力学の基本原理に重点が置かれ、さまざまな自然現象に科学的にアプローチするための基礎が提供されます。微積分導入が推奨前提条件とされています。"
  },
  {
    "cno": "HST245",
    "term": "Spring Term",
    "title_j": "ヨーロッパ社会史",
    "title_e": "Social History of Europe",
    "regno": 11197,
    "lang": "Language of Instruction: J",
    "summary_e": "This intermediate course on modern European history examines the changes in social structures from the sixteenth century. It aims to explore various research topics in social history and understand the multilayers and changes in European culture and society. The course includes lectures, readings, assignments, discussions, and presentations, where students will read multiple texts related to specific themes and engage in group discussions and research presentations. The learning goals include a deeper understanding of modern European history and the ability to analyze historical documents and research.",
    "summary_j": "16世紀以降のヨーロッパの歴史を社会構造の変化を中心に考察するヨーロッパ社会史を学ぶコース。社会史に関連する様々な研究トピックを探求し、ヨーロッパの文化と社会の重層性と変化を理解することを目指します。講義、読書、課題、ディスカッション、プレゼンテーションなどの活動があり、学生は特定のテーマに関連する複数の文献を読み、グループで議論を行い、研究発表を行います。学修目標は、ヨーロッパ近代のより深い理解と史料や研究の分析能力の向上です。"
  },
  {
    "cno": "LED353",
    "term": "Spring Term",
    "title_j": "海外日本語教育実習",
    "title_e": "Overseas Teaching Practicum in Japanese",
    "regno": 11228,
    "lang": "Language of Instruction: J",
    "summary_e": "This class meets once a week during the Spring term to prepare students for teaching practice in Australia. Topics covered include the educational system, curriculums, Japanese language syllabuses, teaching materials, teacher's life in school, as well as cultural aspects of the country. The program also includes a three-week teaching practicum at schools in the Melbourne area during summer vacation. Academic credit will be given to those who complete both the lecture part and the teaching practice part.",
    "summary_j": "この授業はオーストラリアでの教育実習のために学生を準備するために春学期に１回週に開催されます。内容は教育制度、カリキュラム、日本語シラバス、教材、学校での教師の生活、さらにはその国の文化的側面を含む。夏休み中にメルボルン地域の学校で３週間の教育実習が行われます。講義と実習を修了した者には学期単位が与えられます。"
  },
  {
    "cno": "LAW312",
    "term": "Spring Term",
    "title_j": "法哲学",
    "title_e": "Legal Philosophy",
    "regno": 11235,
    "lang": "Language of Instruction: J",
    "summary_e": "This class provides a critical overview of contemporary philosophy of law, focusing on the debates over justice. The learning goals include understanding the relationship between law and justice, recognizing justice as a unique ideal, understanding the historical developments of theories of justice, seeing disagreement among theories as philosophical rather than moral/political, and developing a critical perspective on social institutions. The class covers topics such as utilitarianism, John Rawls's justice as fairness, Robert Nozick's Libertarianism, left libertarianism, and distributive egalitarianism.",
    "summary_j": "この授業では、現代の法哲学、特に正義に関する議論についての批判的な概観を提供します。学修目標には、法と正義の関係を理解すること、正義を独特の理念と認識すること、正義の理論の歴史的発展を理解すること、理論間の対立を道徳的・政治的なものではなく哲学的なものとして見ること、社会制度に対して批判的な視点を持つことなどが含まれます。授業では功利主義、John Rawlsの公正な正義、Robert Nozickのリバタリアニズム、左派リバタリアニズム、分配的平等主義などのトピックが取り上げられます。"
  },
  {
    "cno": "PHY213",
    "term": "Spring Term",
    "title_j": "流体と弾性体の力学",
    "title_e": "Mechanics of Fluids and Elastic Body",
    "regno": 11302,
    "lang": "Language of Instruction: E",
    "summary_e": "This course provides an introduction to Continuum Mechanics, specifically Fluid Mechanics and Mechanics of Elastic Bodies. Fluid mechanics is present in various aspects of nature and civilization, ranging from cosmology to micro fluid dynamics. The course follows an updated version of a classic textbook written by Prof. Ludwig Prandtl, the modern founder of Fluid Mechanics. The aim is for students to gain a deeper understanding of the theoretical description and experimental knowledge of liquids and gases, including their properties, kinematics, dynamics, and the governing equations. The course also covers the fundamental equations of Fluid Mechanics. Prerequisites for the course include an Introduction to Physics and Calculus I. The grading policy is based on a mid-term exam, final exam, homework assignments, and class attendance and participation.",
    "summary_j": "このコースでは、連続体力学（流体力学と弾性体力学）の概要が紹介されます。流体力学は、宇宙論、銀河進化、天体物理学、太陽風、大気、海洋流れ、プレートテクトニクス、川、風、対流、飛行機、車両、内燃機関、火災、血液循環、細胞内ダイナミクス、マイクロ流体力学など、自然、生活、文明のあらゆるスケールに存在しています。このコースでは、現代的な流体力学の創始者であるゲッティンゲン大学のルートヴィッヒ・プランドル教授によって元々書かれた、世界的に有名な古典的な教科書の、より最新かつ改良されたバージョンに従う予定です。基礎となる前提条件は、物理学の導入と微積分Iです。"
  },
  {
    "cno": "EDU309",
    "term": "Spring Term",
    "title_j": "メディアリテラシー",
    "title_e": "Media Literacy",
    "regno": 11335,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on the critical analysis of media messages and their impact on children and youth through various forms of media, such as TV, music videos, newspapers, advertisements, websites, and social media. The goal is to empower students to explore, understand, analyze, and control the effects of mass and digital media on young people and themselves. The course covers topics such as media literacy, analyzing advertisements and music videos, media influence on children and young adults, analyzing TV shows and news, analyzing social media, and creating advertisements. The grading policy is based on case analysis, advertisement creation, weekly comments and questions, and class participation and attendance. Attendance is required for a passing grade, and plagiarism and late assignments are not tolerated.",
    "summary_j": "このコースは、テレビ、音楽ビデオ、新聞、広告、ウェブサイト、ソーシャルメディアなどのさまざまなメディアのメッセージや子供や若者への影響について批判的に分析し、若者と自分自身へのマスメディアとデジタルメディアの影響を探索、理解、分析、制御する能力を身に付けることを目指しています。学習目標は、メディアの批判的思考力を向上させること、メディアの創造的な製作者としてのスキルを開発すること、教育におけるメディアリテラシーの重要性を認識することです。成績評価は、ケースの解析、広告の創作、週ごとのコメント・質問、授業参加・出席に基づいて100点満点で行われます。"
  },
  {
    "cno": "QPPI511",
    "term": "Spring Term",
    "title_j": "公共経営論",
    "title_e": "Public Management",
    "regno": 12252,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the shift from old public administration to new public management since the 1980s. Students will learn about the theoretical basis of government and market, public and business administration, controversies in government size, and various ways of public service delivery. They will also study practical, institutional design for outsourcing, privatization, and public-private partnerships. Through case studies, students will analyze the applicability of the US or UK model to European countries and Japan in specific policy domains. The course also covers topics such as strategic management, marketing, performance measurement, public-private partnerships, co-production, and evidence-based policymaking. Students will present research designs in their final papers based on their interests and apply the theories and models of public management learned in the course.",
    "summary_j": "このコースでは、1900年頃以降の旧公共管理から1980年代以降の新しい公共経営（NPM）へのガバナンスの変化を多角的に検討します。学生は、政府と市場、行政と経営、政府の規模の論争、公共サービス提供方法などのテーマを含む理論的な基礎を学びます。また、外部化、民営化、公的・民間パートナーシップ（PPP）に関する実践的な制度設計についても学習します。このような知識を基に、具体的な政策領域の事例研究を通じて、米国や英国のモデルがヨーロッパ諸国や日本にどの程度適用可能かを分析します。"
  },
  {
    "cno": "JLP012",
    "term": "Autumn Term",
    "title_j": "日本語J2",
    "title_e": "J2: Japanese",
    "regno": 20202,
    "lang": "Language of Instruction: J",
    "summary_e": "This course is a CEFR Level A1/A2 course for spoken and written Japanese. It focuses on interactive communication activities and requires a prerequisite of \"J1: JAPANESE\" or equivalent. The course consists of ten class hours per week and will use Google Classroom as the Learning Management System. Students are required to bring their own notebook computers, and if unable to do so, they can consult the Help Desk for assistance. The course aims to help students achieve the CEFR A2.1 level in spoken and written Japanese.",
    "summary_j": "このコースは、日本語の話し言葉と書き言葉のCEFR A1/A2レベルのコースであり、他者との関わりに焦点を当てた言語活動を行います。前提条件は「日本語J1」または同等のレベルの修了です。週に10時間の授業があり、学習管理システムとしてGoogle Classroomが使用されます。授業ではノートパソコンの使用が必須であり、スマートフォンではなく自分のパソコンを持参する必要があります。もしパソコンを用意することができない場合は、ヘルプデスクに相談してください。このコースは、日本語の話し言葉と書き言葉のCEFR A2.1レベルの到達を目指しています。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20414,
    "lang": "",
    "summary_e": "This course aims to enhance understanding of oneself and others and develop communication skills through team sports. With a focus on teamwork, leadership/followership, communication, and inclusion, the course provides opportunities to experience various team sports and para sports. The goal is to create an environment where everyone can enjoy sports safely and fairly through dialogue and the improvement of physical, mental, and social well-being.",
    "summary_j": "このコースは、チームスポーツを通じて自己と他者を理解し、コミュニケーション能力を向上させることを目指しています。チームワーク、リーダーシップ・フォロワーシップ、コミュニケーション、そして「インクルージョン」の重要性を理解し、ネット型ゲーム、ベースボール型ゲーム、ゴール型ゲーム、パラスポーツを通して様々なスキルを発展させることが目標です。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20419,
    "lang": "",
    "summary_e": "This course aims to develop communication skills and understanding of oneself and others through team sports. The Exercise II course focuses on teamwork, leadership/followership, communication, and inclusion. The course offers various team sports activities, including net game, bat-and-ball game, invasion game, and para-sports. The learning goals are divided into three units, each focusing on a different type of game. The course emphasizes physical, mental, and social well-being, as well as the improvement of skills. Grading is based on attendance, instructor assessment, completion of self-reflection journal entries, and class participation.",
    "summary_j": "このコースは、チームスポーツを通じてコミュニケーション能力や自己理解、他者理解を発展させることを目的としています。PE Exercise IIの目的は、チームワーク、リーダーシップ・フォロワーシップ、コミュニケーション、インクルージョンの重要性を理解することです。コースでは、ネットゲーム、ベースボールゲーム、ゴールゲーム、パラスポーツを含むさまざまなチームスポーツ活動が提供されます。学修目標は3つのユニットに分かれており、各ユニットでは異なるタイプのゲームに焦点を当てています。授業は、身体的、心理的、社会的なウェルビーイングの向上とスキルの向上を重視しています。成績評価は出席、教員による評価、リフレクションの提出、授業参加度に基づいています。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20423,
    "lang": "",
    "summary_e": "The Exercise II course aims to develop communication skills and understanding of oneself and others through team sports. The importance of teamwork, leadership/followership, communication, and inclusion is emphasized in this course. It offers various team sports and para-sports activities, such as net game, bat-and-ball game, and invasion game, to improve different skills. The goal is to create an environment where everyone can enjoy sports safely and fairly through dialogue.",
    "summary_j": "この授業は、自己や他者を理解し、チームスポーツを通じたコミュニケーション能力を高めることを目的としています。リーダーシップ、フォロワーシップ、コミュニケーション、そしてインクルージョンの重要性を理解するための授業であり、ネットゲーム、バット-アンド-ボールゲーム、侵略ゲーム、パラスポーツを通じて、さまざまなスキルを向上させることができます。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20426,
    "lang": "",
    "summary_e": "This course aims to develop communication skills and understanding of oneself and others through team sports. The course consists of three parts: net game, bat-and-ball game, and invasion game. By emphasizing the Full Value Contract, the course strives to create a safe and fair environment for everyone to enjoy sports.",
    "summary_j": "Japanese Summary:\n「自己・他者を理解することを目的」とするチームスポーツを通じて、コミュニケーション能力を向上させる授業です。ネット型ゲーム、ベースボール型ゲーム、ゴール型ゲームの3つの部分から成り、フルバリューコントラクトを重視して、安全で公平なスポーツ環境を作り出すことを目指しています。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20438,
    "lang": "",
    "summary_e": "English summary: The Exercise II course aims to develop communication skills and understanding of oneself and others through team sports. The course focuses on teamwork, leadership/followership, communication, and inclusion. It offers three types of team sports: net game, bat-and-ball game, and invasion game including para-sports. The course is structured into three units: net game, bat-and-ball game, and invasion game. The learning goals include improving physical, mental, and social well-being, as well as various skills through team sport activities. The grading policy requires a minimum of two-thirds attendance and assessments are based on instructor evaluation, completion of self-reflection, and class participation.",
    "summary_j": "Japanese summary: この授業は、自己と他者を理解し、チームスポーツを通じてコミュニケーション能力を向上させることを目的としています。ネットゲーム、バットアンドボールゲーム、侵略ゲームを含む3つのタイプのチームスポーツを通じて、チームワーク、リーダーシップ、コミュニケーション、インクルージョンの重要性を理解します。授業の目的を達成するために、ネット型ゲーム、ベースボール型ゲーム、ゴール型ゲームの3つのユニットがあります。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20440,
    "lang": "",
    "summary_e": "This course aims to foster self-understanding, understanding of others, and communication skills through team sports. It focuses on the importance of teamwork, leadership, and communication, as well as creating an inclusive sports environment. The course includes three types of team sports, such as net games, bat-and-ball games, and invasion games, including para-sports. The learning goals are achieved through units focused on different types of games.",
    "summary_j": "この授業は、チームスポーツを通じて自己理解、他者の理解、コミュニケーション能力を豊かにすることを目的としています。チームワーク、リーダーシップ、コミュニケーションの重要性に焦点を当て、包括的なスポーツ環境を作り出すことを目指しています。ネット型ゲーム、ベースボール型ゲーム、ゴール型ゲームなど、3つの種類のチームスポーツやパラスポーツが含まれています。学修目標は、異なる種類のゲームに焦点を当てたユニットを通じて達成されます。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20441,
    "lang": "",
    "summary_e": "This course focuses on team sports to enhance self-understanding, understanding of others, and communication skills. It aims to promote teamwork, leadership, followership, and inclusion. The course offers various team sports activities such as net games, bat-and-ball games, and invasion games, including para-sports. The goal is to create a safe and fair sports environment through dialogue and to improve physical, mental, and social well-being, as well as various skills.",
    "summary_j": "このコースでは、チームスポーツを通じて自己理解、他者理解、コミュニケーション能力を向上させることを目的としています。チームワーク、リーダーシップ、フォロワーシップ、インクルージョンを重視しており、ネットゲーム、ベースボールゲーム、ゴールゲームなど様々なチームスポーツ活動が提供されています。対話を通じて安全かつ公平なスポーツ環境を作り出し、身体的、心理的、社会的なウェルビーイングを向上させ、さまざまなスキルも磨くことを目指しています。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20446,
    "lang": "",
    "summary_e": "This course aims to enhance self-understanding and understanding of others, as well as develop communication skills through participating in team sports. The course is divided into four sections: icebreaking with warm-up, practice, game, and reflection. Students will experience three types of team sports (net game, bat-and-ball game, and invasion game) as well as para-sports. The goal is to create an environment where everyone can enjoy sports safely and fairly.",
    "summary_j": "このコースは、チームスポーツをプレイすることを通じて、自己理解と他者理解を豊かにし、コミュニケーション能力を開発することを目指しています。授業は、ウォームアップ、練習、ゲーム、振り返りの４つのセクションで構成されており、ネット型、ベースボール型、ゴール型の３種類のチームスポーツとパラスポーツが体験されます。全ての人が安全かつ公正にスポーツを楽しむ環境を作り出すことを目指しています。\n\n[English Summary]"
  },
  {
    "cno": "ELG205",
    "term": "Autumn Term",
    "title_j": "社会科学系学生のための卒業論文作成法（英語）",
    "title_e": "Senior Thesis Writing for Social Sciences (English)",
    "regno": 20606,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is designed for social science students, particularly those majoring in economics and business. It focuses on improving research writing skills using the IMRaD structure. The course covers various aspects of writing, such as genre-specific features, tone, tense, and hedging. It also encourages collaborative learning through small group discussions and presentations. The learning goals include understanding the IMRaD structure, analyzing dissertations, identifying the parts of a dissertation, stating research questions clearly, and writing effective sections of a research paper.",
    "summary_j": "この科目は、主に経済学や経営学を専攻している社会科学の学生を対象にしています。IMRaD形式を使った研究執筆スキルの向上に焦点を当てています。この科目では、トーンや文体、時制、及び修飾語を使った文章修飾など、さまざまなライティングの側面をカバーしています。また、小グループディスカッションやプレゼンテーションを通じた学習コミュニティのアプローチも促進しています。学修目標には、IMRaD構造の理解、論文の分析、各部分の役割の把握、明確な研究問題の述べ方、効果的な研究論文のセクションの執筆が含まれています。"
  },
  {
    "cno": "CHM242",
    "term": "Autumn Term",
    "title_j": "物理化学実験",
    "title_e": "Physical Chemistry Laboratory",
    "regno": 21161,
    "lang": "Language of Instruction: J",
    "summary_e": "This experiment allows students to learn physical chemistry concepts through laboratory activities. The topics covered include the physical and chemical properties of inorganic/organic compounds, correct handling of chemicals, and data acquisition/analysis. It is recommended for students to take both lectures and lab classes, and it is strongly recommended to complete the Foundation Chemistry Laboratory (CHM103) prior to this lab class. The course is offered as an intensive summer course.",
    "summary_j": "この実験は、物理化学の各概念を実習を通じて学ぶものであり、無機/有機化合物の物理的・化学的性質や化学物質の適切な取り扱い、データ取得・解析方法を学びます。学生は講義と実験の両方を履修することが推奨されており、事前に基礎化学実験(CHM103)を終了することが強く推奨されています。コースは夏期集中コースとして提供されます。"
  },
  {
    "cno": "EDU309",
    "term": "Autumn Term",
    "title_j": "メディアリテラシー",
    "title_e": "Media Literacy",
    "regno": 21193,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on the critical analysis of media messages and the impact of various media on children and youth. It aims to empower students to explore, understand, analyze, and control the effects of mass and digital media on young people and themselves. The course covers traditional media (such as TV, radio, print, and billboards) as well as social media (such as social networking, microblogging, photo sharing, and video sharing platforms) in the context of education. Students will learn analytical approaches to understand and interpret media and will also have the opportunity to create their own media content.",
    "summary_j": "このコースでは、テレビ、音楽ビデオ、新聞、広告、ウェブサイト、ソーシャルメディアなど、さまざまなメディアの子どもや若者へのメッセージや影響について批判的な分析を行います。学生がマスメディアやデジタルメディアの影響を探索し、理解し、分析し、制御できるようにすることを目指しています。このコースでは、伝統的なメディア（テレビ、ラジオ、印刷物、ビルボードなど）やソーシャルメディア（ソーシャルネットワーキング/マイクロブログ/写真共有/ビデオ共有プラットフォームなど）を教育の文脈で理解し、解釈するために使用できるさまざまな分析的アプローチを学びます。"
  },
  {
    "cno": "IRL311",
    "term": "Autumn Term",
    "title_j": "地球環境と持続可能な開発",
    "title_e": "Global Environment and Sustainable Development",
    "regno": 21216,
    "lang": "Language of Instruction: E",
    "summary_e": "This course examines the key conceptual frameworks and selected case studies in global environment and sustainable development. It explores the current global framework of sustainable development, including the impact of events such as the COVID-19 pandemic and the Russian aggression in Ukraine, on the implementation of the Sustainable Development Goals (SDGs). It also traces the evolution of sustainable development in global development discussions. The course delves into key issues in the global environment and investigates how they are addressed within the international framework. Through the course, students gain a multidimensional understanding of sustainable development, key global environmental issues, and strategies for working towards a sustainable society.",
    "summary_j": "この科目では、持続可能な開発のグローバルフレームワークと具体的な事例研究を検討します。COVID-19パンデミックやウクライナへのロシアの侵略、他の世界の紛争がSDGsの実施に与える影響など、現在の持続可能な開発のグローバルフレームワークの動向について学びます。また、持続可能な開発がグローバルな開発の議論でどのように発展してきたかについても学びます。さらに、国際的な枠組みで取り扱われている地球環境の重要な課題について学びます。この科目を通じて、学生は持続可能な開発のさまざまな側面や地球環境の重要な問題を学び、持続可能な社会に向けてどのように取り組むかを学びます。"
  },
  {
    "cno": "SOC305",
    "term": "Autumn Term",
    "title_j": "計量社会学分析 II",
    "title_e": "Quantitative Analysis in Sociology II",
    "regno": 21344,
    "lang": "Language of Instruction: J",
    "summary_e": "This course focuses on teaching students how to apply multivariate analytical techniques to survey data in sociology. It is the second part of a two-part series on Quantitative Analysis in Sociology, covering topics such as multiple regression analysis, ANOVA, and logistic regression analysis. Students will learn how to critically evaluate and incorporate multivariate analysis results into research papers. The course includes group assignments and exercises, and by the end, students should be able to perform multivariate analysis and write individual reports summarizing their findings. This course is required for sociology majors.",
    "summary_j": "この授業では、サーベイデータを用いた多変量解析の分析方法を学びます。また、多変量解析を用いた研究論文の批判能力と研究論文への多変量解析結果の組み込み能力を開発します。授業は計量社会学分析 I の後半部分であり、重回帰分析、分散分析、ロジスティック回帰分析、変数の分類と要約の技術などのトピックを扱います。グループでの課題と演習を通じて学生の知識を確認します。コースの最後には、学生は多変量解析を実施し、その結果を個別のレポートにまとめることができるようになります。社会学専攻の学生はこの授業を受講することが必須です。"
  },
  {
    "cno": "JLP012",
    "term": "Winter Term",
    "title_j": "日本語J2",
    "title_e": "J2: Japanese",
    "regno": 30201,
    "lang": "Language of Instruction: J",
    "summary_e": "This course is aimed at CEFR A2.1 level of spoken and written Japanese. It focuses on interactive communication activities and aims to develop overall language proficiency through listening, speaking, reading, and writing activities on various topics. The course requires a prerequisite of \"J1: JAPANESE\" or equivalent and has a total of ten class hours per week. The grading policy includes a final exam (25%), mid-term exam (15%), and usual performance score (60%). The language of instruction is Japanese.",
    "summary_j": "このコースは、日本語の話しことば、書きことばのCEFR A2.1レベルを到達目標とするもので、他者との関わりにおける言語活動に焦点をおきます。様々なトピックについての「聞く」「話す」「読む」「書く」などの活動を通じて総合的な言語力を培います。コースの前提条件は「日本語J1」または同等のレベルで、週10時限の授業があります。成績評価基準は、期末試験（25％）、中間テスト（15％）、平常点（60％）です。教授言語は日本語です。"
  },
  {
    "cno": "ELA042",
    "term": "Spring Term",
    "title_j": "リベラルアーツ英語プログラム(Stream 4)：アカデミック・スキル",
    "title_e": "English for Liberal Arts Program(Stream 4): Academic Skills",
    "regno": 10109,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is designed to provide additional support for the core Academic Reading and Writing and Reading and Content Analysis courses. It aims to develop students' language abilities through practical opportunities in class, focusing on study skills, research, presentation, and communicative skills. The course is taught over three terms and must be taken in sequence.",
    "summary_j": "このコースは、リベラルアーツ英語プログラム(Stream 4)の中核である「読解と論文作成」と「精読と英文構成法」の学習を補完するための科目です。実践的な訓練の場を提供することで、学生の語学力の更なる発展を目指します。学生は学習方法、リサーチ、口頭発表、コミュニケーション能力など個別の学術的能力に対する自信を養い、適切な教材を使用して学習します。学期間は3学期で、順番に履修する必要があります。"
  },
  {
    "cno": "JLP081",
    "term": "Spring Term",
    "title_j": "日本語特別教育 1",
    "title_e": "Special Japanese 1",
    "regno": 10212,
    "lang": "Language of Instruction: J",
    "summary_e": "English Summary / 英語の要約:\n\"Special Japanese Program\" is a course designed for students who will learn Japanese as a mother tongue, first language, or heritage language. The course aims to develop basic skills such as vocabulary building, reading comprehension, writing passages, and oral expression necessary for university students. The course meets five times a week and requires completion of the prerequisite course \"INTRODUCTION TO JAPANESE FOR FIRST/HERITAGE LANGUAGE SPEAKERS\". Google Classroom will be used as the Learning Management System, and students are required to bring a notebook computer to class. The course includes reading, writing, and practicing oral presentations, as well as giving an oral presentation on a novel read outside of class and writing a 1,000-word essay.",
    "summary_j": "Japanese Summary / 日本語の要約:\n「日本語特別教育プログラム」は、日本語を母語、第一言語、または継承語として学ぶ学生を対象にしたコースです。このコースでは、大学生に必要な語彙力、読解力、文章作成力、口頭表現力などの基礎的なスキルを身につけます。週5回の授業があり、前提条件として「第一言語/継承語話者のための日本語入門」の修了が必要です。コースではGoogle Classroomを使用し、授業ではノートパソコンが使用されます。"
  },
  {
    "cno": "WAB101",
    "term": "Spring Term",
    "title_j": "アラビア語 I",
    "title_e": "Arabic I",
    "regno": 10501,
    "lang": "Language of Instruction: O",
    "summary_e": "English Summary: This course serves as an introduction to contemporary standard Arabic, focusing on cultivating beginner-level skills in speaking, reading, and writing. Students will also receive training in Arabic letters, pronunciation, and basic grammar. Additionally, the course includes the study of Arabic culture.",
    "summary_j": "Japanese Summary: このコースは、現代標準アラビア語の初心者向けの話す、読む、書くスキルの育成を中心とした入門コースです。アラビア語の文字、発音、基本的文法のトレーニングも行います。さらに、アラブの文化の学習も含まれています。"
  },
  {
    "cno": "WFR202",
    "term": "Spring Term",
    "title_j": "上級フランス語I",
    "title_e": "Advanced French  I",
    "regno": 10512,
    "lang": "Language of Instruction: O",
    "summary_e": "This advanced French course aims to improve overall French language skills while expanding cultural knowledge of the French-speaking world. It focuses on preparing students for the DELF exam, training their French-Japanese translation skills, and providing understanding of French society.",
    "summary_j": "この上級フランス語コースは、フランス語の聴解力、口頭表現能力、読解力を向上させるだけでなく、フランス語圏の文化知識も拡大するために設計されています。特に、DELF試験の準備をし、フランス語と日本語の翻訳スキルを訓練し、フランス社会を理解する機会を提供します。"
  },
  {
    "cno": "GEX001",
    "term": "Spring Term",
    "title_j": "Ｘ：キリスト教概論",
    "title_e": "X: Introduction to Christianity",
    "regno": 10301,
    "lang": "Language of Instruction: J",
    "summary_e": "The Introduction to Christianity course is aimed at understanding the theological significance and philosophical meaning of the Christian faith in relation to modern culture. This course covers various topics such as the history of Christianity, the content of Christian theology, and the impact of Christianity on society. Through this course, students are encouraged to broaden their perspectives and deepen their understanding of values and the world. The course consists of lectures and discussions, and student participation is highly valued. Evaluation is based on class participation, a midterm exam, and a final report.",
    "summary_j": "キリスト教概論の授業は、キリスト教信仰の神学的意義や哲学的意味を現代の文化との関連で理解することを目的としています。この授業では、キリスト教の歴史や信仰内容、社会への影響など、さまざまなトピックをカバーしています。この授業を通じて、学生は自分の視野を広げ、価値観や世界についての理解を深めることが推奨されています。授業は講義やディスカッションで行われ、学生の参加が非常に重視されています。評価は授業参加度、中間試験、期末レポートに基づいて行われます。"
  },
  {
    "cno": "GES013",
    "term": "Spring Term",
    "title_j": "Ｓ１：政治学（Ｃ）",
    "title_e": "S1: Political Science (C)",
    "regno": 10311,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to provide a structure and analytical framework for understanding politics and political actors. It covers topics such as traditional and non-traditional security relations, political and economic relations, cultural relations, regionalism, and memory production. Students will explore Sino-Japanese relations from various perspectives and develop their research and critical thinking skills through assignments and presentations. The language of instruction for this course is English.",
    "summary_j": "この科目は、政治と政治的アクターを理解するための枠組みと分析的なフレームワークを提供することを目的としています。伝統的および非伝統的なセキュリティ関係、政治的および経済的関係、文化的関係、地域主義、記憶の生成などのトピックをカバーしています。学生は、さまざまな視点から日中関係を探求し、課題やプレゼンテーションを通じて研究能力と批判的思考能力を開発します。この科目の教授言語は英語です。"
  },
  {
    "cno": "GES039",
    "term": "Spring Term",
    "title_j": "Ｓ２：統計情報リテラシー",
    "title_e": "S2: Statistical Information Literacy",
    "regno": 10312,
    "lang": "Language of Instruction: J",
    "summary_e": "This course aims to teach the basic skills of data analysis for studying the social sciences. It includes lectures on statistics fundamentals, sampling methods, and data processing methods. Computers are used during the course. This course is recommended for those who want to learn the basics of statistics and data analysis.",
    "summary_j": "この科目では、社会科学の学習に必要なデータ分析の基本的なスキルを学びます。統計の基礎、サンプリング方法、データ処理方法に関する講義が行われます。授業では、コンピューターを使用します。統計学の基礎とデータ分析の技術について学びたい人におすすめの科目です。"
  },
  {
    "cno": "GES052",
    "term": "Spring Term",
    "title_j": "Ｓ２：文化翻訳の世界",
    "title_e": "S2: The World of Cultural Translation",
    "regno": 10314,
    "lang": "Language of Instruction: E",
    "summary_e": "English summary: This course explores the cultural translation of famous stories through film, examining how shifts in narrative, images, dialogue, and translation highlight different ideas. It focuses on the contextual aspects of cultural translation and traces the cultural circulation of a familiar narrative in film adaptations. The course aims to promote learner responsibility and develop analytical thinking, problem solving, and oral and written expression in English.",
    "summary_j": "Japanese summary: このコースは、異なる時代と文化的背景で有名なストーリーの文化的な翻訳を映画を用いて調査します。物語や画像、対話、翻訳の変化が異なるアイデアを浮き彫りにする方法を検討します。"
  },
  {
    "cno": "GES064",
    "term": "Spring Term",
    "title_j": "Ｓ２：国連：クリティカル・イントロダクション",
    "title_e": "S2: The United Nations: A Critical Introduction",
    "regno": 10316,
    "lang": "Language of Instruction: E",
    "summary_e": "This course provides a critical introduction to the United Nations Organization, reviewing its basic structures and functions while highlighting its weaknesses and often underappreciated strengths. The course aims to familiarize students with the challenges faced by the UN in the 21st Century, including administrative, legal, and political challenges. It also examines the paradoxes within the UN, such as its goal of limiting the excesses of independent states while being controlled by powerful capitals, its engagement in military operations without an army, and its preaching of human rights and democracy while not necessarily practicing them. Through frank and undiplomatic discussions, the course explores the successes and failures of the UN and questions why it is often profoundly inadequate.",
    "summary_j": "このコースは、国連機関についての批判的な導入を提供し、基本的な構造や機能を見直すと同時に、国連の短所や評価されないでいる長所に焦点を当てています。このコースでは、管理上の課題だけでなく、法的および政治的な課題も含め、21世紀の国連が直面している課題について学生に馴染んでもらいたいという目的があります。また、国連内の矛盾点にも触れており、独立した国の過剰な行動を制限する目標と、強力な首都によって制御される一方で、軍隊を持たずに軍事作戦に従事し、人権や民主主義を説く一方でそれを実践しない点などがあります。率直で外交的でない議論を通じて、このコースは国連の成功と失敗を探求し、なぜ国連がしばしば極めて不十分であるかを問いかけます。"
  },
  {
    "cno": "WKR101",
    "term": "Spring Term",
    "title_j": "韓国語 I",
    "title_e": "Korean I",
    "regno": 10517,
    "lang": "Language of Instruction: O",
    "summary_e": "This is an introductory course for Korean language where students will learn pronunciation, elementary grammar, and mainly focus on speaking and listening abilities. The course also covers Korean culture.",
    "summary_j": "韓国語の入門科目で、発音や初級文法を学び、主に話すと聞く能力を身につけます。また、韓国文化についても教えられます。"
  },
  {
    "cno": "WKR101",
    "term": "Spring Term",
    "title_j": "韓国語 I",
    "title_e": "Korean I",
    "regno": 10518,
    "lang": "Language of Instruction: O",
    "summary_e": "The details of the midterm and final exams will be provided by the instructor during class.",
    "summary_j": "成績評価基準は以下の通りです：\n- 中間試験と期末試験: 50％\n- クラスへの出席と参加: 20％\n- 課題: 30％"
  },
  {
    "cno": "WKR101",
    "term": "Spring Term",
    "title_j": "韓国語 I",
    "title_e": "Korean I",
    "regno": 10519,
    "lang": "Language of Instruction: O",
    "summary_e": "This is an introductory course for learning the Korean language. Students will learn the pronunciation, elementary grammar, and primarily focus on speaking and listening abilities. The course also includes teachings on Korean culture.",
    "summary_j": "韓国語の入門科目であり、発音や初級の文法を学び、主に話す力と聞く力を身につけることが重要です。また、韓国文化についても教えられます。"
  },
  {
    "cno": "GES077",
    "term": "Spring Term",
    "title_j": "Ｓ２：日常生活とジェンダー",
    "title_e": "S2: Gender in Everyday Life",
    "regno": 10317,
    "lang": "Language of Instruction: J",
    "summary_e": "This course focuses on the socially constructed nature of gender and how it impacts our daily lives. It explores topics such as gender roles, norms, inequality, and sexuality, and aims to examine gender issues from various academic perspectives. Lectures will be given by the main instructor once a week, while guest speakers, including other teachers and researchers affiliated with gender and sexuality studies, will also give lectures. The grading policy includes attendance and participation, group presentations, quizzes, and a final report.",
    "summary_j": "このコースは、社会的に構築されたジェンダーの仕組みやそれが日常生活にどのように影響を与えるかに焦点を当てています。ジェンダーの役割、規範、不平等、セクシュアリティなどの問題について議論し、さまざまな学問の視点からジェンダーの問題を研究することを目指しています。講義は基本的に週に一度あり、森木先生以外の教員や研究者もゲストスピーカーとして講義します。成績には出席と参加、グループプレゼンテーション、クイズ、期末レポートが含まれます。"
  },
  {
    "cno": "GES001",
    "term": "Spring Term",
    "title_j": "Ｓ１：経済と経済学",
    "title_e": "S1: Economy and Economics",
    "regno": 10329,
    "lang": "Language of Instruction: E",
    "summary_e": "This course provides lectures on how economics theories have developed their frameworks to explain individual economic behavior, national and international economy, and their policy implications. It covers both microeconomics and macroeconomics, as well as related fields such as finance and international economics. The course aims to develop students' critical thinking, problem-solving, communication, and collaboration skills through the study of economics. The instruction language varies by term and there are no prerequisites for this course.",
    "summary_j": "このコースでは、経済の理論が個々の経済行動や国内外の経済の仕組み、政策の含意を説明するためにどのように枠組みを構築してきたかについての講義が行われます。マイクロ経済学とマクロ経済学だけでなく、ファイナンスや国際経済学などの関連分野もカバーしています。このコースは経済学の学習を通じて、学生の批判的思考、問題解決、コミュニケーション、協調性の能力を養うことを目指しています。教授言語は学期によって異なり、このコースには必要な前提条件はありません。"
  },
  {
    "cno": "HPE005",
    "term": "Spring Term",
    "title_j": "PE　エクササイズⅠ",
    "title_e": "Physical Education Exercise I",
    "regno": 10416,
    "lang": "",
    "summary_e": "English Summary: This course aims to promote a healthy body and mind for a better student life through physical activity. Students will learn to develop their physical and mental capacities through physical activity and education, leading to a better student life. This class offers a physical education lesson to help students familiarize themselves with university life and promote relationships with individuals from diverse cultural backgrounds. Through physical activities, students will deepen their understanding of themselves, others, and group dynamics, and enjoy the class.",
    "summary_j": "Japanese Summary: このコースは、身体活動を通じて、健康な身体と心を養い、より良い学校生活を送ることを目指しています。学生は身体活動と教育を通じて、身体的な能力と精神的な能力を開発する方法を学び、より良い学生生活につながるでしょう。このクラスでは、新しい大学での生活に慣れるための体育の授業を体験し、多様な背景を持つ人々との共同の人間関係を促進します。身体活動を通じて、グループ活動、スポーツ、問題解決の練習などで自己や他者についての理解を深めることができます。"
  },
  {
    "cno": "LED215",
    "term": "Spring Term",
    "title_j": "教授用音声学と音韻論",
    "title_e": "Pronunciation for Language Teaching",
    "regno": 11219,
    "lang": "Language of Instruction: E",
    "summary_e": "English Summary: This course focuses on the theory and practical skills of pronunciation teaching. Students will learn about articulatory phonetics and its application in the language classroom.",
    "summary_j": "Japanese Summary: このコースは、発音の理論とそれを教えるために必要な実践的なスキルについて学びます。学生は発音学とその言語教室での応用に関する知識を身につけます。"
  },
  {
    "cno": "QADT601",
    "term": "Spring Term",
    "title_j": "研究者のための技法 I - アカデミック・プレゼンテーション",
    "title_e": "Techniques for Researchers I - Academic Presentations",
    "regno": 12502,
    "lang": "Language of Instruction: E",
    "summary_e": "",
    "summary_j": "本課程では、博士課程の学生は、研究テーマに関連した学会やセミナーに参加し、プレゼンテーションを行うか、または発表する必要があります。それぞれのイベントに関するレポートを作成し、指導教員に提出する必要もあります。学生は学会やセミナーに参加することで専門知識を得ることができるとともに、実践的なプレゼンテーションの方法を学ぶことができます。"
  },
  {
    "cno": "GEH013",
    "term": "Autumn Term",
    "title_j": "Ｈ１：音楽の世界",
    "title_e": "H1: The World of Music",
    "regno": 20304,
    "lang": "Language of Instruction: J",
    "summary_e": "The course is taught in Japanese, and the grading policy includes submitting learning portfolios, active participation, performance, and assessments/assignments.",
    "summary_j": "このコースは日本語で教授され、成績評価基準には学修ポートフォリオの提出、積極的な参加、パフォーマンス、評価/課題が含まれています."
  },
  {
    "cno": "HPE001",
    "term": "Autumn Term",
    "title_j": "健康科学",
    "title_e": "Health Science",
    "regno": 20403,
    "lang": "Language of Instruction: J",
    "summary_e": "This course aims to explore the knowledge necessary for a healthy life. Topics covered include safety, diseases, nutrition, sleep, and mental health. The course is compulsory for graduation and is conducted in a face-to-face format, although it may be subject to change depending on social conditions.",
    "summary_j": "このコースでは、一生涯健康であるために必要な知識を探求します。安全、疾病、栄養、睡眠、メンタルヘルスなどについて学びます。この科目は卒業に必須です。授業形式は対面ですが、社会の状況に応じて変更される場合があります。"
  },
  {
    "cno": "HPE005",
    "term": "Spring Term",
    "title_j": "PE　エクササイズⅠ",
    "title_e": "Physical Education Exercise I",
    "regno": 10433,
    "lang": "",
    "summary_e": "This course aims to promote physical activity and build a healthy body and mind for a better school life. The class focuses on helping students adapt to university life and fostering relationships with individuals from diverse cultural backgrounds. Through physical activities, students will have opportunities to interact with their peers, experience problem-solving, and deepen their understanding of themselves, others, and group dynamics. The class is conducted in a face-to-face format and is a required subject for graduation.",
    "summary_j": "この授業は、身体活動を促進し、健康な心と体を構築し、より良い学生生活を目指すことを目的としています。このクラスでは、大学生活に適応し、異なる文化的なバックグラウンドを持つ人々との関係を育むための活動を重視しています。身体活動を通じて、学生は仲間との交流や問題解決の体験を通じて、自己や他者、集団の理解を深める機会を得ることができます。授業は対面形式で行われ、卒業には必修科目となっています。"
  },
  {
    "cno": "HPE006",
    "term": "Spring Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 10446,
    "lang": "",
    "summary_e": "This course aims to enhance self-understanding and develop communication skills through participating in team sports. Students will experience various team sports activities, including verbal and non-verbal communication, teamwork, leadership and followership, self-identity, and goal setting. The course emphasizes inclusion and the application of these skills in daily life. It is a compulsory graduation course.",
    "summary_j": "この授業では、チームスポーツに参加することを通じて、自己理解を深め、コミュニケーション能力を発展させることを目指しています。学生は、言語や非言語のコミュニケーション、チームワーク、リーダーシップやフォロアーシップ、自己認識、目標設定など、様々なチームスポーツ活動を体験します。この授業ではインクルーシブを重視し、これらの能力を日常生活で活用することを目指しています。これは卒業必修科目です。"
  },
  {
    "cno": "HPE006",
    "term": "Spring Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 10447,
    "lang": "",
    "summary_e": "This course focuses on understanding oneself and others through team sports and aims to improve communication skills. Students will experience various team sports and learn about teamwork, leadership, followership, inclusion, self-identity, and goal setting. The course aims to develop basic skills that can be applicable to daily life.",
    "summary_j": "この授業は、チームスポーツを通して自己と他者を理解し、コミュニケーション能力を向上させることを目的としています。学生はさまざまなチームスポーツを体験し、チームワーク、リーダーシップ、フォロアーシップ、インクルージョン、自己認識、目標設定について学びます。この授業は、日常生活に活かせる基本的なスキルの習得を目指しています。"
  },
  {
    "cno": "HPE006",
    "term": "Spring Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 10448,
    "lang": "",
    "summary_e": "Summary (English): This course aims to develop communication skills and enhance understanding of oneself and others through team sports. Students will experience various team sports activities, including verbal and non-verbal communication, teamwork, leadership, followership, inclusion, self-identity, and goal setting. The course is compulsory and conducted in a face-to-face format, but may shift to online depending on social conditions. The learning goals include deepening understanding of inclusion, building a positive attitude towards team sports, and developing communication and teamwork skills.",
    "summary_j": "Summary (Japanese): この授業は、チームスポーツを通じてコミュニケーション能力を向上させ、自己と他者をより理解することを目指しています。学生は、言語や非言語のコミュニケーション、チームワーク、リーダーシップ、フォロアーシップ、インクルーシブ、自己認識、目標設定などを含むさまざまなチームスポーツ活動を体験します。授業は対面形式で行われ、社会状況によりオンラインに変更される場合があります。学修目標には、インクルーシブを理解し、チームスポーツに対するポジティブな態度を養うこと、コミュニケーション能力とチームワークを発展させることが含まれています。"
  },
  {
    "cno": "HPE007",
    "term": "Spring Term",
    "title_j": "PE　エクササイズⅢ",
    "title_e": "Physical Education Exercise III",
    "regno": 10450,
    "lang": "",
    "summary_e": "This course aims to improve the quality of life by promoting the understanding of recreation and teaching life-saving skills. The Exercise III course covers various topics such as lifesaving, fitness training, and lifelong sports. It emphasizes the importance of safety in sports and recreation activities and combines lectures with experiential learning. Students who complete the course will have the knowledge and skills to lead safe and lifelong sports. The course also focuses on creating a fair and fun environment in sports by adapting rules.",
    "summary_j": "このコースは、「レクリエーション」の心を育て、ライフセービングスキルの方法を指導することで、生活の質(QOL)の向上を目指しています。授業では、ライフセービング、フィットネストレーニング、生涯スポーツなどの多様なトピックをカバーしています。グループ活動を通じて、身体的、精神的、社会的な健康だけでなく、さまざまなスキルの向上を目指します。"
  },
  {
    "cno": "CHM232",
    "term": "Autumn Term",
    "title_j": "有機化学実験",
    "title_e": "Organic Chemistry Laboratory",
    "regno": 21160,
    "lang": "Language of Instruction: J",
    "summary_e": "",
    "summary_j": "この実験科目では、学生は有機化合物の物理的性質や化学的性質を実験を通じて学びます。また、化学物質の正しい取り扱いや有機化合物の合成および構造の決定方法についても学びます。有機化学Iの履修が望ましいです。実験テーマは4つで、有機化学Ⅰおよび有機化学Ⅱの講義内容に対応しています。"
  },
  {
    "cno": "EDU323",
    "term": "Autumn Term",
    "title_j": "平和教育の理論と実践",
    "title_e": "Peace Education: Theory &amp; Practice",
    "regno": 21195,
    "lang": "Language of Instruction: E",
    "summary_e": "",
    "summary_j": "このコースは平和教育の理論と実践についての理解を提供するものであり、学生は平和教育の哲学的、心理学的、文化的、教育的、カリキュラム的な要素や評価問題について学ぶ。学校や地域における効果的な紛争解決教育の理論と実践にも焦点を当てる。このコースでは学際的な枠組みである国際教育、多文化教育、開発教育、平和研究、国際サービスラーニング、社会心理学、ジェンダー研究、国際関係学に平和教育を含めることができる。"
  },
  {
    "cno": "HST241",
    "term": "Autumn Term",
    "title_j": "ヨーロッパ文化史",
    "title_e": "Cultural History of Europe",
    "regno": 21208,
    "lang": "Language of Instruction: J",
    "summary_e": "English Summary: This course examines various themes in the cultural history of Europe, from medieval to modern times. Students will engage in research exercises to deepen their understanding of these topics.",
    "summary_j": "Japanese Summary: このコースでは、中世から近代のヨーロッパの文化史のさまざまなテーマを考察します。学生は、これらのトピックをより深く理解するための研究演習に取り組みます。"
  },
  {
    "cno": "HPE001",
    "term": "Spring Term",
    "title_j": "健康科学",
    "title_e": "Health Science",
    "regno": 10480,
    "lang": "Language of Instruction: j",
    "summary_e": "English Summary: This course aims to explore the knowledge necessary to maintain lifelong health, including topics such as safety, diseases, nutrition, sleep, and mental health. It is a compulsory graduation course that focuses on improving health literacy through face-to-face classes and group discussions. The curriculum may vary depending on the number of students and includes an emphasis on individual and behavioral influences on health, nutrition, exercise habits, sleep, mental health management, and group presentations.",
    "summary_j": "Japanese Summary: このコースは、安全性、疾病、栄養、睡眠、メンタルヘルスなど、生涯にわたって健康であるために必要な知識を探求します。健康リテラシーを身につけるための必修科目であり、学生は受講者の人数によって変更される可能性があるカリキュラムの中で、対面授業やグループディスカッションを通じて学びます。"
  },
  {
    "cno": "HPE001",
    "term": "Spring Term",
    "title_j": "健康科学",
    "title_e": "Health Science",
    "regno": 10485,
    "lang": "Language of Instruction: J",
    "summary_e": "English Summary: This course aims to explore the knowledge necessary for a healthy life. It is a face-to-face course that covers various topics such as safety, diseases, nutrition, sleep, and mental health. The goals of the course include developing the ability to gather and assess information, make informed decisions, and apply them to real-life situations. The course consists of group discussions, presentations, and exams, and the grading is based on class participation, reports/tests, and group presentations. The class may be subject to changes depending on class size and social conditions.",
    "summary_j": "Japanese Summary: このコースは、生涯にわたって健康であるために必要な知識を学ぶことを目的としています。授業は対面形式で行われ、人々や社会が抱える健康問題についての基本的な知識や科学的根拠を学び、自分自身で情報を収集し、意志決定や実践する能力を身につけます。具体的なテーマとしては、栄養、運動、睡眠、メンタルヘルスなどがあり、グループ発表や評価も行われます。"
  },
  {
    "cno": "WFR202",
    "term": "Spring Term",
    "title_j": "上級フランス語I",
    "title_e": "Advanced French  I",
    "regno": 10511,
    "lang": "Language of Instruction: O",
    "summary_e": "This course is aimed at improving overall French language skills and expanding knowledge of French-speaking culture. The focus is on preparing students for the DELF exam, training French-Japanese translation skills, and promoting understanding of French society. The course is divided into three mini-courses taught by different instructors, focusing on listening &amp; speaking, writing, and reading skills. The evaluation and grading policies vary based on the instructor. Please note that this course is for non-native French speakers and students from French-speaking countries are not accepted.",
    "summary_j": "この上級フランス語Ⅰコースは、フランス語能力とフランスの文化に関連する多くの側面を統合したものです。特に、DELFフランス語能力試験の準備と、フランス語テキストの口頭コミュニケーションと日本語への翻訳の練習に重点を置いています。履修条件はフランス語IIIまたは同等の能力です。なお、上級フランス語コースは任意の順番で履修できます。"
  },
  {
    "cno": "POL232",
    "term": "Winter Term",
    "title_j": "比較政治学",
    "title_e": "Comparative Politics",
    "regno": 31311,
    "lang": "Language of Instruction: J",
    "summary_e": "The main objective of this course is to examine the relationship between state and society in various political regimes. The main focus will be on the processes of modernization and democratization. The language of instruction differs by year.",
    "summary_j": "国家と社会の関係を各政治体制で検討することがこのコースの主な目的です。近代化と民主化のプロセスに重点を置きます。開講言語は年度ごとに異なります。"
  },
  {
    "cno": "QELE506",
    "term": "Winter Term",
    "title_j": "言語習得論",
    "title_e": "Language Acquisition",
    "regno": 32110,
    "lang": "Language of Instruction: E",
    "summary_e": "",
    "summary_j": "5) 言語研究が教育実践にどのように影響を与えるかの認識を培う"
  },
  {
    "cno": "WKR201",
    "term": "Spring Term",
    "title_j": "上級韓国語 I",
    "title_e": "Advanced Korean I",
    "regno": 10520,
    "lang": "Language of Instruction: O",
    "summary_e": "English Summary: This course aims to improve oral and literary communication skills in Korean. It requires completion of Korean III or equivalent level. The course focuses on fostering intercultural competence in the Korean language and culture to effectively communicate with Korean people. It also emphasizes developing speaking skills and expressing ideas through presentations. In addition, the course aims to deepen knowledge about contemporary Korean society and culture.",
    "summary_j": "Japanese Summary: このコースは、口頭表現力と文章表現力を向上させることを目的としています。韓国語Ⅲまたは同等の学力が必要です。授業では、韓国人とのコミュニケーションに必要な異文化間能力を高めるため、韓国語と韓国文化の知識を深めることが重要です。また、話す能力を特に重視し、プレゼンテーションを通じて自分の意見を表現する方法を学ぶことも目標としています。"
  },
  {
    "cno": "WSP101",
    "term": "Spring Term",
    "title_j": "スペイン語 I",
    "title_e": "Spanish I",
    "regno": 10522,
    "lang": "Language of Instruction: O",
    "summary_e": "This is an introductory course for learning the Spanish language. It focuses on acquiring basic grammar and communication skills, with an emphasis on speaking and listening abilities. The course also includes lessons on Spanish culture. It is open to both beginners and students with some prior knowledge of Spanish.",
    "summary_j": "これはスペイン語を学ぶための入門科目です。基本的な文法とコミュニケーション能力を身につけることに焦点を当て、話すことや聞くことに重点を置いています。また、スペインの文化についての授業も行われます。初心者だけでなく、ある程度のスペイン語の知識を持つ学生も受講することができます。"
  },
  {
    "cno": "WSP101",
    "term": "Spring Term",
    "title_j": "スペイン語 I",
    "title_e": "Spanish I",
    "regno": 10523,
    "lang": "Language of Instruction: O",
    "summary_e": "English Summary: This introductory course for the Spanish language aims to acquire the basics for beginner level (A1). The course focuses on grammar, communication abilities, and Spanish culture. It is targeted towards first learners of Spanish, but students with some knowledge of the language are also welcome. The course includes face-to-face classes and emphasizes creating a cooperative learning atmosphere. The learning goals include mastering grammar aspects unique to Spanish, conjugation of verbs in the present tense, and basic communication skills for daily life situations.",
    "summary_j": "Japanese Summary: このスペイン語の入門科目では、発音と初級文法を学んだ後、主に会話と聴解能力を習得します。スペインの文化についても教えられます。対象は初めてスペイン語を学ぶ人々で、既にある程度の知識がある学生も参加できますが、良い学習雰囲気を作るために協力的になることが望まれます。授業は対面授業です。"
  },
  {
    "cno": "WSP101",
    "term": "Spring Term",
    "title_j": "スペイン語 I",
    "title_e": "Spanish I",
    "regno": 10524,
    "lang": "Language of Instruction: O",
    "summary_e": "This introductory Spanish course is designed for first-time learners. The course focuses on basic grammar and communication skills, with an emphasis on gender and number forms in articles, nouns, and adjectives, as well as verb conjugation in the present tense. The goal is for students to be able to communicate in basic everyday situations. The course includes detailed grammar explanations, readings, written compositions, vocabulary reinforcement, and oral practice. Additionally, audiovisual materials are used to introduce Spanish and Latin American culture. The grading policy consists of final exams, oral exams, quizzes and tasks, and attendance and participation. It is important for students to attend class regularly and be punctual. Please note that the classes are held face-to-face and will not be recorded.",
    "summary_j": "このスペイン語の入門科目は、初めて学ぶ人を対象としています。このコースでは、基本的な文法とコミュニケーション能力に焦点を当て、記事、名詞、形容詞の性と数の形式、および現在時制の動詞の活用に重点を置いています。学生が日常の基本的な状況でコミュニケーションができるようにすることを目標としています。このコースでは、詳細な文法の説明、読解、作文、単語の強化、口頭練習が含まれます。さらに、視聴覚教材を使用してスペインとラテンアメリカの文化を紹介します。成績評価のポリシーは、期末試験、口頭試験、小テストと課題、出席と参加度です。定期的に出席し、時間に正確であることが重要です。授業は対面で行われ、録画はされませんのでご注意ください。"
  },
  {
    "cno": "WSP101",
    "term": "Spring Term",
    "title_j": "スペイン語 I",
    "title_e": "Spanish I",
    "regno": 10525,
    "lang": "Language of Instruction: O",
    "summary_e": "This introductory course for the Spanish language focuses on teaching the basics of grammar and communication skills. Students will learn about the grammatical differences between Spanish and English, such as gender and number forms in articles, nouns, and adjectives. The goal is to develop conversational abilities and master verb conjugation in the present tense. The course will also cover greetings, basic questions and responses, and expressions for everyday actions. In addition, students will be exposed to Spanish and Latin American culture through the use of audiovisual materials. The grading policy includes final exams, oral exams, quizzes and tasks, and attendance and participation. It is important to note that attendance is required, and students who miss classes four times or more will not be eligible for the final exam.",
    "summary_j": "このスペイン語の入門科目では、スペイン語の発音と基礎的な文法を学び、主に話す能力と聞く能力を身につけます。スペインの文化についても教えられます。授業では文法の説明、読み物、作文が行われます。単語や表現を強化することで口頭のスキルを向上させます。また、スペインとラテンアメリカの社会文化の側面を紹介するためにオーディオビジュアル資料も使用されます。成績評価は最終試験（35％）、口頭試験（20％）、小テストと課題（25％）、出席と参加（20％）で構成されています。"
  },
  {
    "cno": "WSP201",
    "term": "Spring Term",
    "title_j": "上級スペイン語 I",
    "title_e": "Advanced Spanish I",
    "regno": 10526,
    "lang": "Language of Instruction: O",
    "summary_e": "English Summary: This course is designed to improve oral and written communication skills in Spanish. It is recommended for students who have completed Spanish III or have an equivalent level of proficiency. The course is divided into three parts: oral interactions and grammar, written compositions, and readings. Oral interactions will focus on developing speaking and listening skills, while grammar work will cover various aspects including past tenses and usage in complex sentences. Written compositions will expand on grammatical and textual knowledge, and readings will enhance vocabulary and reading strategies. Assignments such as theatrical plays and song singing in Spanish will be common. The language of instruction is mainly Spanish, and attendance, participation, and exams will be graded.",
    "summary_j": "Japanese Summary: このコースはスペイン語の口頭および文章表現能力を向上させるためのものです。スペイン語IIIを既修したり同等の能力を持っている学生を対象としています。コースは、口頭対話と文法、文章作成、読解の3つのパートから成り立っています。口頭対話では、スピーキングとリスニングのスキルを発展させるために文法に基づいた活動が行われます。文法の内容は、過去時制や従属的な複雑な文での使用方法を含みます。文章作成では、自己や周囲の世界についてのテキストを執筆することに焦点を当てます。読解では、スペインとラテンアメリカの文化とそれらが他の文化に与える影響について扱われます。演劇やスペイン語の歌の歌唱、自宅でのトピックの準備や追加のスペイン語のテキストの作成などの課題は授業内で一般的です。授業の主要な教授言語はスペイン語であり、出席、参加、試験などが評価されます。"
  },
  {
    "cno": "ANT214",
    "term": "Spring Term",
    "title_j": "グローバル時代のアジアの宗教運動",
    "title_e": "Global Religious Movements in Asia",
    "regno": 11117,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores how different religions adapt to the world of consumer capitalism, mass migrations, and new technologies. Religious participation has been increasing rapidly in recent years, but not through traditional institutions like temples, pilgrimages, and rituals. Instead, religions spread through transnational migration, social media, and consumer practices. By focusing on ethnographies conducted mainly in Asia, this course examines how these emerging practices shape contemporary religion. Through discussions, readings, and research projects, students will gain familiarity with contemporary ethnographic writing on religion in Asia, compare new forms of religious practice in Asia with other regions, and examine the particularities of global religions in diverse Asian contexts.",
    "summary_j": "この科目では、異なる宗教が消費主義の世界、大規模な移民、新技術にどのように適応しているかを調査します。宗教参加は近年、寺院、巡礼、儀式などの伝統的な制度とは異なる方法で加速しています。現代の世界では、宗教は国境を越えた移民、ソーシャルメディア、消費活動を通じて広がっています。アジアを中心に実施された民族誌を中心に、これらの新しい実践が現代の宗教をどのように形作っているかを探求します。"
  },
  {
    "cno": "ANT311",
    "term": "Spring Term",
    "title_j": "人類学調査実習 I",
    "title_e": "Field Training in Anthropology I",
    "regno": 11118,
    "lang": "Language of Instruction: J",
    "summary_e": "This course prepares students for ethnographic fieldwork by teaching research proposal writing skills, literature search competency, logical academic thinking, and understanding of issues related to conducting ethnographic fieldwork. The course covers topics such as research proposal writing, field notes, data collection methods, ethics in the field, field site lectures and student presentations, practical issues in the field, and proposal presentations. The grading policy includes attendance and class participation, news article and journal article presentations, and a proposal.",
    "summary_j": "このコースは、人類学のフィールドワークに向けた準備をするための授業であり、研究提案書の書き方、文献収集能力、論理的な学術的思考、および人類学的フィールドワークに関連する問題の理解を教えます。授業では、研究提案書の書き方、フィールドノート、データ収集方法、フィールドでの倫理、フィールドサイトでの講義と学生の発表、フィールドでの実際的な問題、プロポーザルの発表などのトピックをカバーします。成績評価は、出席と授業参加、ニュース記事と雑誌論文の発表、およびプロポーザルで構成されています。"
  },
  {
    "cno": "BIO384",
    "term": "Spring Term",
    "title_j": "生命科学特論 I",
    "title_e": "Advanced Studies in Biology I",
    "regno": 11138,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is designed for senior students who will be conducting senior thesis research in the Mizoguchi Laboratory. Students will learn how biological research is conducted in the field of plant science, including molecular biology and molecular genetics, by reading original research papers. In weekly meetings, students will share and discuss lab maintenance issues, give progress reports on their own research, and present original papers related to their senior thesis research. The course will be conducted in face-to-face mode and grading will be based on active participation (65%) and presentations (35%).",
    "summary_j": "この授業は、溝口研究室で卒業論文の研究に関与するシニア学生を対象としています。学生は、分子生物学や分子遺伝学を含む植物科学の分野で、生物学の研究がどのように行われるかを、研究論文を通じて学びます。週次のミーティングでは、研究室の問題やテーマについて共有し、各メンバーは自身の研究の進捗状況を報告し、関連する研究論文について発表します。授業では、個々の研究計画や進捗状況の発表を行い、関連する原著論文についても紹介します。成績評価は、積極的な参加度が65％、発表の評価が35％とされています。"
  },
  {
    "cno": "BUS381",
    "term": "Spring Term",
    "title_j": "会計学特別研究",
    "title_e": "Advanced Studies in Accounting",
    "regno": 11148,
    "lang": "Language of Instruction: E",
    "summary_e": "This course introduces students to the principles of management accounting, with a focus on the internal use of accounting information for organizational management. Managers face numerous decision-making and performance evaluation scenarios that require the use of financial and non-financial information. Topics covered in this course include the use of cost accounting information for decision-making, the function of budgets for performance evaluation, short-term business decisions, and capital investment decisions. The goal of the course is to equip students with the knowledge and ability to understand, analyze, and evaluate financial and non-financial accounting information. Prior knowledge of fundamental accounting and cost accounting is recommended for students taking this course.",
    "summary_j": "このコースは、学生に経営会計の基礎原則を紹介します。主に、組織の管理において会計情報を内部で利用することに重点を置いています。マネージャーは、戦略的計画、予算、マーケティング、オペレーション、法律、規制など、さまざまな意思決定と業績評価に直面しています。マネージャーの業務には、財務情報と非財務情報が不可欠であり、関連する情報を活用することは組織管理のキャリアにおいて重要なスキルです。このコースでは、原価計算情報の意思決定における使用法、予算の機能、短期的なビジネスの意思決定、資本投資の意思決定など、さまざまなトピックを取り上げます。このコースは、財務および非財務の会計情報を理解し、分析し、評価するための知識と能力を学生に身に付けることを目指しています。このコースには、会計学の基礎的な知識と原価計算の基礎的な知識があることが望ましいです。"
  },
  {
    "cno": "DPS204",
    "term": "Spring Term",
    "title_j": "開発のミクロ経済学",
    "title_e": "Development Microeconomics",
    "regno": 11162,
    "lang": "Language of Instruction: J",
    "summary_e": "This course aims to familiarize students with the economic problems and policy concerns of developing countries, and equip them with tools of analysis and measurement to better understand them. Although the class is conducted in Japanese, non-native speakers are encouraged to take the course as most reading materials are in English.",
    "summary_j": "このコースは、開発途上国の経済問題と政策に関する学問的な道具を学び、それらをよりよく理解するために使用される分析と測定の方法に精通することを目的としています。日本語を話すクラスですが、非日本語話者も参加できるように、ほとんどの教材が英語で提供されています。"
  },
  {
    "cno": "ECO102",
    "term": "Spring Term",
    "title_j": "ミクロ経済学原論",
    "title_e": "Principles of Microeconomics",
    "regno": 11164,
    "lang": "Language of Instruction: E",
    "summary_e": "This course covers the basic concepts of traditional microeconomics and its applications. Topics include market, demand, supply, equilibrium, consumer behavior, firm behavior, market failure, economic policy, taxes, subsidies, and income distribution. It is required to have a basic understanding of algebra and calculus.",
    "summary_j": "このコースでは、伝統的なミクロ経済学の基礎部分と応用例について学びます。取り扱うトピックは市場、需要、供給、均衡、消費者の行動と効用最大化、生産者の行動と利潤最大化、市場の失敗と経済政策、税と補助金、所得分配などです。微積分の理解が前提とされています。"
  },
  {
    "cno": "EDU102",
    "term": "Spring Term",
    "title_j": "教育とコミュニケーション概論",
    "title_e": "Introduction to Education and Communication",
    "regno": 11175,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the role of communication in education and introduces new forms of learning through communication facilitated by information and communications technologies. It also provides an introduction to instructional design and technology as a field, covering topics such as the history of instructional design and influential learning and design theories. The course concludes with hands-on experience in educational development practices used by instructional designers. The learning goals include becoming familiar with the systematic creation of education, understanding the differences between instructional theory and learning theory, evaluating educational products for potential improvements, and designing a functional website for learning.",
    "summary_j": "このコースは、教育におけるコミュニケーションの役割を紹介し、情報通信技術によって可能になった教室内外での学びを探求します。また、教育の文脈においてコミュニケーションがどのように設計されるのかを学び、教材設計の基本的な側面や技術についての導入を行います。これには、IDTの歴史の概要、教材設計の具体化、学習理論と設計理論の概要などが含まれます。コースは、教材設計の実践で使用される基本的な開発プラクティスの経験で締めくくられます。学修目標は、教育の体系的な創造に慣れ親しむことや、教材設計と学習理論の違いを理解することなどです。また、教育製品の改善点を評価したり、学習のための機能的なウェブサイトのデザイン課題を達成するなどの能力も獲得します。"
  },
  {
    "cno": "EDU223",
    "term": "Spring Term",
    "title_j": "学習分析入門",
    "title_e": "Introduction to Learning Analytics",
    "regno": 11182,
    "lang": "Language of Instruction: E",
    "summary_e": "This course provides an overview of how learning analytics through the digitalization of education can be used to understand learners' situations and measure the effectiveness of education in order to improve educational outcomes, and assessment methods for various learning activities. The learning goals include collecting real-world discourse data, compiling it into a spreadsheet, and reporting basic measures. Learners will also develop academic-oriented skills such as presenting data selection and collection process, as well as analyzing the statistics surrounding their data set. The course covers a wide range of topics related to learning analytics and ends with the submission of a final paper.",
    "summary_j": "このコースでは、教育のデジタル化を通じた学習分析がいかに学習者の状況を理解し、教育の効果を測定して教育の成果を向上させるために活用されるか、さまざまな学習活動の評価方法について概観します。学修目標として、学習者は実世界のディスコースデータを収集し、スプレッドシートにまとめ、基本的な指標を報告することが求められます。また、参加型（または構造的）データの測定に関する基本的な推論力を習得します。最終的に、カスタム収集データセットを使用して4〜5ページの最終論文を提出することが目標となります。"
  },
  {
    "cno": "ENV103",
    "term": "Spring Term",
    "title_j": "環境経営入門",
    "title_e": "Introduction to Environmental Management",
    "regno": 11184,
    "lang": "Language of Instruction: J",
    "summary_e": "This course aims to explore the meaning and method of environmental conservation from a management perspective. It discusses the contradictions faced by modern businesses, which seek both profit and social responsibility, including environmental conservation. Students will learn about the relationship between economy and ecology, concepts and tools of environmental management, environmental accounting, and more. The course encourages students to understand the complex relationship between environmental protection and business activities, as well as the importance of sustainability.",
    "summary_j": "この講義は、企業の経営視点から環境保護の意味と方法を学ぶものです。現代の企業は利潤追求だけでなく、環境保護や社会責任を追求する必要があります。講義では、エコノミーとエコロジーの関係、環境経営のコンセプトやツール、環境会計などについて学びます。学生は環境保護とビジネス活動の複雑な関係や、持続可能性を理解することが期待されています。"
  },
  {
    "cno": "GSS101",
    "term": "Spring Term",
    "title_j": "ジェンダー・セクシュアリティ研究へのアプローチ",
    "title_e": "Approaches to Gender and Sexuality Studies",
    "regno": 11186,
    "lang": "Language of Instruction: J",
    "summary_e": "This course serves as the foundation course for the Gender and Sexuality Studies Program and aims to provide an overview of the general frameworks, basic concepts, and historical backgrounds of gender studies. Students will learn about the current state and possibilities of gender research and analysis in various disciplines. Through this course, students will develop the necessary analytical skills to engage in interdisciplinary gender analysis. The course also aims to enhance students' understanding of the importance of gender perspectives, promote critical thinking, and encourage them to apply their knowledge in real-world situations.",
    "summary_j": "この講義はジェンダーとセクシュアリティ研究プログラムの基礎科目として設立されたものであり、ジェンダー研究の基本的な枠組み、概念、歴史的背景を学びます。これらの理解を基に、さまざまな学問分野におけるジェンダー研究と分析の蓄積と可能性について説明や議論を行い、学生が学際的な領域でジェンダー分析を行うための基本的な分析能力を身につけることを目指しています。"
  },
  {
    "cno": "HST102",
    "term": "Spring Term",
    "title_j": "西洋史（イギリス）I",
    "title_e": "History of Europe (Britain) I",
    "regno": 11189,
    "lang": "Language of Instruction: J",
    "summary_e": "This course is a study of Western European history, with a particular focus on the political, cultural, and social aspects of British history from medieval to modern times. The learning goals are to understand key issues in early modern English/British history, develop the ability to read and interpret a variety of English historical documents, and analyze and discuss historical events and changes from an academic perspective. The lecture will be conducted in Japanese, but course materials and documents will mostly be in English.",
    "summary_j": "このコースは、西ヨーロッパの歴史、特に中世から現代までのイギリスの政治、文化、社会の側面に焦点を当てたものである。学修目標は、近代イギリス（イングランド）の重要な問題を理解し、さまざまな英語の歴史的文書や他の資料を読み解く能力を身につけ、学術的な視点から歴史的な出来事や変化を分析し議論する能力を習得することである。講義は日本語で行われるが、教材は主に英語で提供される。"
  },
  {
    "cno": "HST233",
    "term": "Spring Term",
    "title_j": "南アジア史（インド）",
    "title_e": "History of South Asia (India)",
    "regno": 11194,
    "lang": "Language of Instruction: J",
    "summary_e": "This course provides an overview of the history of South Asia, including India, focusing on important historical events such as the independence movement and religious conflicts. Students will read Bipan Chandra's \"History of Modern India\" and learn about the struggle for independence and the teachings of Mahatma Gandhi. The course aims to understand how people strived for freedom through non-violence under the leadership of Gandhi and how this history is still relevant today.",
    "summary_j": "このコースは、南アジアの歴史の概要に焦点を当てたインドを含む南アジアの歴史を概説しています。ビパン・チャンドラの『近代インドの歴史』を読み、インドの独立運動や宗教対立などのテーマについて理解を深めます。また、マハートマ・ガーンディーの非暴力と真理を通じた自由の指導と彼の人生の中での苦闘も学びます。学修目標は、ガーンディーの指導の下で人々が非暴力の中で自由を追求するためにどのように苦闘したかを学び、現代にも非常に関連性のあるものとすることです。"
  },
  {
    "cno": "IRL233",
    "term": "Spring Term",
    "title_j": "アフリカの政治と国際関係",
    "title_e": "Politics and International Relations in Africa",
    "regno": 11204,
    "lang": "Language of Instruction: E",
    "summary_e": "This course offers an analysis of domestic politics, social structure, and international relations in Africa. It explores the concept of Africa as an 'idea' shaped by European colonialism and the continent itself. It examines the historical and political factors that contributed to the formation of the 'idea' of Africa and the formation of African identity. The course also highlights the potential contributions of Africa to international relations theories and the recognition of Africa as a significant player in global politics. It aims to challenge the perception of Africa as a peripheral object of study and emphasizes the agency and distinctive identities of individual African states.",
    "summary_j": "このコースは、アフリカ地域の内政、社会構造、国際関係を分析します。ヨーロッパの植民地主義によって形成されたアフリカの「アイデア」と、大陸そのものについて探求します。アフリカの「アイデア」の形成とアフリカのアイデンティティの形成に寄与した歴史的および政治的要因を検討します。このコースでは、アフリカが国際関係理論に与える潜在的な貢献と、アフリカがグローバル政治において重要な役割を果たすことを強調しています。アフリカを学問の「周辺」であるという認識に挑戦し、個別のアフリカ諸国の主体性と独自のアイデンティティを重視しています。"
  },
  {
    "cno": "ISC103",
    "term": "Spring Term",
    "title_j": "コンピュータ基礎",
    "title_e": "Foundation of Computers",
    "regno": 11211,
    "lang": "Language of Instruction: E",
    "summary_e": "This class provides students with an overview of various aspects of computer science, from data manipulation to the theory of computation. Students will learn about the history of computers, computer hardware, software and programming, and information systems in order to understand the fundamentals of computer science. The lectures will be held three times a week.",
    "summary_j": "この授業では、コンピューターサイエンスのさまざまな専門分野について、データの操作から計算理論まで、概観を提供します。コンピューターサイエンスの基礎を理解するために、コンピューターの歴史、コンピューターハードウェア、ソフトウェアとプログラミング、情報システムなどのトピックを学びます。講義では、週に3回行われます。"
  },
  {
    "cno": "ISC344",
    "term": "Spring Term",
    "title_j": "Web工学特論",
    "title_e": "Topics in Web Engineering",
    "regno": 11215,
    "lang": "Language of Instruction: J",
    "summary_e": "In this class, students learn about web application technologies and the mechanisms and operations of systems and coding. They work with languages such as HTML, CSS, JavaScript, PHP, and Perl. Students are expected to have knowledge of computer architecture and basic programming skills. By completing this course, students will be able to explain the mechanisms of web information systems and web applications, understand the fundamental technologies of web front-end, and explain the relationships and roles of frameworks and databases in the back-end system.",
    "summary_j": "このクラスでは、学生はウェブアプリケーション技術を学び、システムとコーディングについての仕組みと操作も学びます。このクラスではHTML、CSS、JavaScript、PHP、Perlなどを取り扱います。また、学生はコンピュータアーキテクチャと基本的なプログラミングスキルについても学習しています。このクラスを修了することで、学生はウェブ情報システムとウェブアプリケーションの仕組みや基礎的な技術を理解し、フロントエンドやバックエンドシステムにおけるフレームワークやデータベースの関係と役割について説明できるようになります。\n\n**English Summary:**"
  },
  {
    "cno": "LED361",
    "term": "Spring Term",
    "title_j": "外国語としての日本語教授法III",
    "title_e": "The Teaching of Japanese as a Foreign Language III",
    "regno": 11229,
    "lang": "Language of Instruction: J",
    "summary_e": "This course involves detailed discussions on the purposes, contents, and methods of teaching Japanese as a foreign language. It is intended for students who have completed THE TEACHING OF JAPANESE AS A FOREIGN LANGUAGE I and II. The course includes continuing class observations and tutorials, as well as conducting classroom research analysis and tutorial analysis in order to develop Japanese teaching skills.",
    "summary_j": "この科目は、外国語としての日本語を教えるための目的、内容、方法について詳しく議論します。外国語としての日本語教育法IおよびIIを完了した学生のための科目であり、JLPでの授業観察とTHE TEACHING OF JAPANESE AS A FOREIGN LANGUAGE IおよびIIで行われたチュートリアルに続いて、教室での研究分析とチュートリアル分析も行われます。"
  },
  {
    "cno": "MCC108",
    "term": "Spring Term",
    "title_j": "翻訳入門",
    "title_e": "Introduction to Translation",
    "regno": 11270,
    "lang": "Language of Instruction: E",
    "summary_e": "This course provides an introduction to the field of Translation Studies, exploring key issues and debates in translation theory. Through lectures, discussions, and practice activities, students will learn about the challenges and different perspectives in translation, such as fidelity and equivalence. Translation is presented as a crucial cultural practice that reflects society and facilitates understanding of change. The course aims to develop students' knowledge of translation theories, ability to analyze and evaluate translations, and reflection on their own learning and development as translators.",
    "summary_j": "このコースでは、翻訳研究の分野に入門し、翻訳の理論における重要な問題や議論について探求します。講義、議論、実習を通じて、忠実さや同等性といった翻訳の異なる視点や課題について学びます。翻訳は社会を反映する貴重な文化的実践であり、変化を理解する手段であると位置づけられています。このコースでは、学生の翻訳理論の知識を深め、翻訳を分析・評価する能力、自身の学習および翻訳者としての成長についての反省を促すことを目指しています。"
  },
  {
    "cno": "MCC218",
    "term": "Spring Term",
    "title_j": "アメリカにおける言語",
    "title_e": "Language in the United States",
    "regno": 11273,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the history, development, and characteristics of English in North America and its social, historical, and cultural aspects. It examines regional and social dialects, language policy, and the relationship between English and other languages in the United States. The learning goals include understanding the history and variation of English in the U.S., appreciating the role and importance of languages other than English, and becoming familiar with language legislation and policies. It also aims to understand the social and political tensions among different language groups, connect issues in second language acquisition with language in the U.S., search for, comprehend, and critique research articles on language, and develop a comparative perspective on language in society. The course requires active participation, critical thinking, and an independent research project.",
    "summary_j": "北米の英語の起源、発達及び特徴の研究を通じて英語の歴史的、文化的、社会的諸相を考察する。地域的、社会的方言、言語政策、英語と他言語との関係についても論ずる。学修目標は、アメリカ合衆国における英語の歴史と変異を理解することや、英語以外の言語の役割や重要性を理解すること、アメリカ合衆国における重要な言語法や政策の歴史を把握すること、言語グループ間の社会・政治的緊張を理解すること、第二言語習得の問題をアメリカの言語と関連付けること、言語に関する研究論文を検索、理解、批判する能力の開発、アメリカの言語を社会の中で言語の枠組みの中に捉える比較的見解を養うことである。授業は、アメリカの言語状況に関連する幅広いトピックについての情報を総合的に批判的思考を働かせながら学修し、クラス活動に積極的に参加し、独立した研究プロジェクトに取り組み、その結果を口頭および書面で発表することを必要とする。"
  },
  {
    "cno": "MCC236",
    "term": "Spring Term",
    "title_j": "創造する翻訳",
    "title_e": "Translation at Work",
    "regno": 11275,
    "lang": "Language of Instruction: E",
    "summary_e": "【Japanese】翻訳の創造的なプロセスにおける情報やアイディアの流れと変化について、選ばれた翻訳作品の記述的および比較的な分析を通じて学ぶことができるコースです。自身の翻訳プロジェクトにも取り組みます。コースの内容は、翻訳工業のグローバル化に伴い、時間やコスト、一貫性やチームワークなどの制約に対応するために特化したツールの使用が加速しました。このクラスでは、翻訳工業の主要なプレーヤーが広く使用している多数の業界をリードするアプリケーションを使い、翻訳の作業環境、翻訳メモリ技術、翻訳プロジェクト管理、翻訳ワークフロー管理、翻訳品質管理、機械翻訳などについて知識を身につける機会を提供します。個人的な翻訳タスクや共同翻訳タスクを通じて、(1)ツールが使用されるローカリゼーション業界の概要、(2)それらの可能性と制約、(3)パフォーマンスの評価方法、および(4)翻訳産業での翻訳品質の評価方法について理解を深めることができます。\n\n【English】This course provides an understanding of the process and mechanisms behind creative acts of translation and the way information and ideas are translated and transformed. Students will deepen their understanding through descriptive and comparative analysis of various cultural products that involve translation, such as novels, manga, and films. It should be noted that this course is not about creative translation. In addition, this course offers hands-on exploration of industry-leading applications used in the translation industry, allowing students to gain practical knowledge about the translation working environment, translation memory technology, translation project management, translation workflow management, translation quality management, machine translation, and more. By completing individual and collaborative translation tasks using these tools, students will gain an understanding of the localization industry, the potential and limitations of the tools, methods of evaluating their performance, and how translation quality is evaluated in the industry.",
    "summary_j": ""
  },
  {
    "cno": "MUS381",
    "term": "Spring Term",
    "title_j": "音楽フィールドワーク：理論と実践",
    "title_e": "Music Fieldwork Theory and Practice",
    "regno": 11287,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on musicological fieldwork theory, practice, and writing musical ethnographies. It involves readings and discussions on these topics and provides opportunities for fieldwork trips in Tokyo. Students will conduct a short fieldwork project and present their research findings in both written and oral forms. It is recommended for students who have taken music and/or anthropology classes at ICU.",
    "summary_j": "このコースでは音楽学的なフィールドワークの理論と実践についての読書が行われ、音楽のエスノグラフィーの書き方について異なるアプローチが考えられます。学期の後半では、東京でいくつかのフィールドワーク旅行に参加し、その結果をグループプロジェクトとしてまとめます。学生はICUでいくつかの音楽と/または人類学の授業を受けたことを期待されています。"
  },
  {
    "cno": "PHR226",
    "term": "Spring Term",
    "title_j": "旧約ヘブライ語",
    "title_e": "Old Testament Hebrew",
    "regno": 11294,
    "lang": "Language of Instruction: J",
    "summary_e": "This course is an introductory study of biblical Hebrew, focusing on the grammar and reading of representative texts from the Hebrew Bible. The course aims to teach students the fundamentals of biblical Hebrew grammar and enable them to read and translate biblical Hebrew texts using a lexicon. The learning goals include the ability to translate biblical Hebrew texts into Japanese or English, analyze the texts using grammar, and utilize them as materials for historical critical studies. The course covers various topics related to Hebrew grammar and translation, and evaluation is based on class participation, weekly tests, and a final exam.",
    "summary_j": "この授業は、旧約聖書のヘブライ語の基礎を学ぶものであり、古代ヘブライ語の文法を学びながら、旧約聖書の代表的なテキストを辞書を用いて読み解くことを目指しています。学修目標は、旧約聖書のヘブライ語文章を日本語または英語に訳し、テキストを文法的に分析し、歴史研究や思想研究の資料として活用する知識を身につけることです。授業では、ヘブライ語の文法やテキストの翻訳に関するさまざまなトピックがカバーされ、学生の参加度やテストの成績によって評価されます。"
  },
  {
    "cno": "POL103",
    "term": "Spring Term",
    "title_j": "政治学概論",
    "title_e": "Introduction to Political Science",
    "regno": 11309,
    "lang": "Language of Instruction: J",
    "summary_e": "This course covers various fields of political science and explores different methodologies and methods of learning in the discipline. It aims to analyze basic concepts and main ideas of political science, such as democracy, politicians, political parties, political processes, bureaucracy, political economy, political morality, and more. The course also focuses on helping students develop a basis for political judgment and encourages them to read assigned materials and write essays to enhance their understanding. The language of instruction may vary by year.",
    "summary_j": "このコースでは、政治学の様々な領域をカバーし、学問の方法や学習方法についても検討します。民主主義、政治家、政党、政治プロセス、官僚制、政治経済、政治倫理など、政治学の基本的な概念や主要なアイデアを分析することを目指します。また、学生が政治的判断を形成するための基盤を構築することも重要視されており、割り当てられた読み物を読み、エッセイを書くことが求められます。言語は年によって異なる場合があります。"
  },
  {
    "cno": "SOC208",
    "term": "Spring Term",
    "title_j": "食と農の社会学",
    "title_e": "Sociology of Agriculture and Food",
    "regno": 11328,
    "lang": "Language of Instruction: J",
    "summary_e": "The purpose of this course is to analyze various social phenomena surrounding food and agriculture. It explores both the macro aspects such as food security systems and laws, as well as the micro aspects such as the politics among social groups related to agriculture and food. The language of instruction varies depending on the year.",
    "summary_j": "このコースの目的は、食品と農業に関連する様々な社会現象を分析することです。食品や農業に関わる法律や規制などのマクロな社会構造だけでなく、社会運動が食品システムに与える影響などのミクロな側面も調査します。開講年度によって言語が異なります。"
  },
  {
    "cno": "QALL402",
    "term": "Spring Term",
    "title_j": "現場実習による専門学習",
    "title_e": "Field Research and Professional Learning",
    "regno": 12002,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to provide students with opportunities and skills to connect their fields of interest or specialization to their personal and professional lives outside of university. The expectation is that these connections will enhance academic motivation and provide new perspectives on learning and work. Students will be encouraged to contribute to society by participating in internships or service activities related to their respective fields of specialization. They will share their experiences and findings in class and learn to effectively communicate with individuals in different fields. Students will have the opportunity to provide services at NGOs/NPOs, governmental organizations, international organizations, museums, schools, and companies.",
    "summary_j": "このコースは、学生に大学外での個人的および職業的な生活と専門分野を結びつける機会とスキルを提供し、これらのつながりが学術的な動機付けと学びや仕事に対する新たな視点をもたらすことを期待しています。このコースでは、学生は専門分野に関連する場所でインターンシップ/サービスを行うことで社会への貢献の方法を見つけるよう促されます。学生はその経験や発見をクラスで共有し、異なる分野の人々と効果的にコミュニケーションすることを学びます。学生はNGO/ NPO、政府機関、国際機関、博物館、学校、企業でのサービスを提供します。"
  },
  {
    "cno": "QPFD413",
    "term": "Spring Term",
    "title_j": "現代企業理論",
    "title_e": "Modern Theory of Business",
    "regno": 12201,
    "lang": "Language of Instruction: E",
    "summary_e": "English Summary / 英語の要約: This course examines the contributions of 18 prominent management thinkers to the understanding of organizational behavior and managerial thinking. It covers a range of theorists, from early pioneers such as Frederick W. Taylor and Max Weber, to classical writers like Alfred D. Chandler, Peter Drucker, and Frederick Herzberg, and more recent thinkers such as Oliver Williamson, Rosabeth Moss Kanter, and Henry Mintzberg. Students are expected to read core materials in advance and actively participate in presentations and discussions on each theorist.",
    "summary_j": "Japanese Summary / 日本語の要約: この科目では、組織の行動や経営者の思考に関する18人の主要な経営思想家の貢献を探求します。フレデリック・テイラーやマックス・ウェーバーなどの初期の理論家から、アルフレッド・D・チャンドラーやピーター・ドラッカー、フレデリック・ハーズバーグなどの古典的な著者、オリバー・ウィリアムソン、ロザベス・モス・キャンター、ヘンリー・ミンツバーグなどの最近の思想家まで取り上げます。"
  },
  {
    "cno": "QPPI516",
    "term": "Spring Term",
    "title_j": "国際機構論",
    "title_e": "International Organization",
    "regno": 12203,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to provide a basic understanding of international organizations (IOs), focusing on the theories, history, and practice of IOs. It covers a range of topics including the United Nations, peace and security, criminal justice, humanitarian assistance, human rights, refugee and migration, health, and development. Students are expected to actively participate in class, read suggested materials, and prepare a presentation and term paper. Emphasis is placed on critical analysis skills and staying informed about current international and domestic affairs.",
    "summary_j": "このコースは、国際機構（IOs）に関する基礎的な理解を提供することを目的としており、IOsの理論、歴史、実践に焦点を当てています。国連、平和と安全保障、犯罪司法、人道支援、人権、難民と移民、健康、開発など、さまざまなトピックをカバーしています。学生は積極的に授業に参加し、提案された資料を読み、プレゼンテーションと単位論文を準備することが求められます。批判的分析能力や現在の国際情勢や出身国の内政について情報を得ることに重点が置かれています。"
  },
  {
    "cno": "ELA042",
    "term": "Autumn Term",
    "title_j": "リベラルアーツ英語プログラム(Stream 4)：アカデミック・スキル",
    "title_e": "English for Liberal Arts Program(Stream 4): Academic Skills",
    "regno": 20108,
    "lang": "Language of Instruction: E",
    "summary_e": "The Academic Skills (AS) course is designed to provide additional support to the core Academic Reading and Writing and Reading and Content Analysis courses. Through practical opportunities in class, students will develop their study skills, research abilities, presentation skills, and overall language proficiency. The course is taught over three terms and must be taken in sequence. The curriculum includes components such as Speaking & Listening, Extensive Reading, and Research and Presentation. The goal is to help students participate more fully in their academic courses and prepare them for courses taught in English outside of the program.",
    "summary_j": "アカデミック・スキル（AS）コースは、リベラルアーツ英語プログラムの中心である「読解と論文作成」と「精読と英文構成法」の授業をサポートする科目です。実践的な学習の機会を通じて、学生は学習方法、リサーチ、プレゼンテーション、言語能力などを発展させることができます。このコースは3学期にわたって教えられ、順番に履修する必要があります。カリキュラムにはSpeakng & ListeningやExtensive Reading、Research and Presentationなどの要素が含まれています。目標は、学生が本格的に授業に参加し、ELA以外の英語での授業にも備えることです。"
  },
  {
    "cno": "JLP081",
    "term": "Autumn Term",
    "title_j": "日本語特別教育 1",
    "title_e": "Special Japanese 1",
    "regno": 20209,
    "lang": "Language of Instruction: J",
    "summary_e": "The Special Japanese Program is designed for students learning Japanese as a mother tongue, first language, or heritage language. In this course, students will acquire basic skills necessary for university students, such as vocabulary building, reading comprehension, writing passages, and oral expression. The course consists of five class hours per week and requires completion of the \"INTRODUCTION TO JAPANESE FOR FIRST/HERITAGE LANGUAGE SPEAKERS\" or equivalent as a prerequisite.",
    "summary_j": "この日本語特別教育プログラムは、母語・第１言語・継承語として日本語を学ぶ学生のためのものです。大学生として必要な語彙力、読解力、文章作成力、口頭表現力を身につけるための基礎的なスキルを習得します。週に5時間の授業があり、事前に「第一言語・継承語話者のための日本語入門」または同等のレベルを取っていることが前提条件です。"
  },
  {
    "cno": "JLP085",
    "term": "Autumn Term",
    "title_j": "第一言語／継承語話者のための日本語入門",
    "title_e": "Introduction to Japanese for First/Heritage Language Speakers",
    "regno": 20212,
    "lang": "Language of Instruction: J",
    "summary_e": "This course is designed for students who want to learn Japanese as their mother tongue, first language, or heritage language. It aims to provide a strong foundation for studying Japanese at JLP for students who have not had formal training in the Japanese language. The course includes six class hours per week and exposes students to various spoken and written Japanese, helping them develop the skills needed to study Japanese in an academic context. The course will focus on basic linguistic knowledge and study skills and will serve as a foundation for continuous learning of Japanese in the JLP.",
    "summary_j": "このコースは、日本語を母国語、第一言語、または継承語として学びたい学生を対象としています。日本語学校（JLP）での学習のための強固な基盤を提供することを目的としており、日本語を正規の訓練を受けていない学生に対しても対応しています。週に6時限の授業があり、日本語の様々な話し言葉と書き言葉に触れながら、学術的な文脈で日本語を学ぶためのスキルを身につけることができます。このコースでは基本的な言語知識と学習スキルに重点が置かれ、JLPでの日本語の継続的な学習の基盤となります。"
  },
  {
    "cno": "GEX001",
    "term": "Autumn Term",
    "title_j": "Ｘ：キリスト教概論",
    "title_e": "X: Introduction to Christianity",
    "regno": 20302,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the basic concepts of the Christian faith and its theological significance in relation to modern culture. The study is based on the Bible, with a focus on the Old and New Testaments. The course aims to understand the structure of the Christian Scriptures, the content of Christian faith, the anthropological significance of the Scriptures, and the relationship between violence and religion. The course includes video lectures and quizzes, course preparation assignments, and comment sheets. Attendance is mandatory, with a maximum of two absences allowed.",
    "summary_j": "このコースは、キリスト教信仰の基本的な内容とその神学的意義について、現代文化との関連性を探求します。旧約聖書と新約聖書に基づいて学ぶ内容であり、キリスト教の聖典の構造、信仰内容、人類学的意義、暴力と宗教の関係について理解を深めることを目指しています。コースにはビデオレクチャーやクイズ、課題、コメントシートが含まれています。出席は必須で、2回までの欠席が許可されています。"
  },
  {
    "cno": "GEX001",
    "term": "Autumn Term",
    "title_j": "Ｘ：キリスト教概論",
    "title_e": "X: Introduction to Christianity",
    "regno": 20303,
    "lang": "Language of Instruction: J",
    "summary_e": "English Summary: This course aims to teach students the basic concepts and theological significance of Christianity, as well as the features and challenges it poses in modern society. Students will acquire the skills to critically study religion and engage in discussions and debate with others. Attendance and participation, quizzes, and a final exam will be the factors in determining the final grade.",
    "summary_j": "Japanese Summary: この授業は、キリスト教の基本的な内容や思想的意義を学び、現代社会におけるキリスト教の特徴や課題を理解することを目指しています。学生は宗教を批判的に学ぶためのスキルを身につけ、他者との議論や意見のやり取りを通じて自己の意見を考察することも求められます。成績は出席と参加（40%）、小テスト（20%）、期末試験（40%）で評価されます。"
  },
  {
    "cno": "GEH045",
    "term": "Autumn Term",
    "title_j": "Ｈ２：英語の世界、世界の英語",
    "title_e": "H2: World of English, English of the World",
    "regno": 20306,
    "lang": "Language of Instruction: J",
    "summary_e": "This course introduces basic knowledge and analysis methods of modern linguistics and applies them to the English language to help students understand the possible research topics about English. English has become a global language, used daily by millions of people from diverse linguistic and cultural backgrounds. This course provides an overview of the academic study of world Englishes, investigating the history and global spread of English, examining various varieties used around the world, and exploring the educational implications. The learning goals include critical understanding of the history and development of world Englishes, examination of social, economic, cultural, and political issues related to the global spread of English, reflection on being a learner of English and becoming an active participant in the community of world users of English, and critical reflection on the impact of English at the individual and societal levels.",
    "summary_j": "この科目は、現代言語学の基本的な知識と分析方法を紹介し、それを英語に適用することで、学生が英語に関する研究トピックを学ぶのを助けるものです。英語は現在、言語的および文化的背景の異なる何億もの人々によって日常的に使用され、世界中のさらに多くの人々によって学ばれています。英語の非母語話者は母語話者よりもはるかに多く、地元の言語や文化の影響を受けた使用方法が英語を豊かにしています。この科目では、世界の英語の学術的な研究について概観し、英語の歴史と世界的な拡がりを調査し、世界で使用されるいくつかのバリエーションを探求し、教育上の意義を探ります。目標は、世界の英語の歴史と発展の批判的な理解を示し、英語の世界的な拡がりに関連する社会的、経済的、文化的、政治的な問題を批判的に検討し、英語の学習者として自己を反省し、英語の世界の利用者のコミュニティで活動的な参加者になること、英語の世界的な拡がりに関する議論を批判的に考え、個人や社会のレベルでの英語の影響について意見を持つことです。"
  },
  {
    "cno": "GES007",
    "term": "Autumn Term",
    "title_j": "Ｓ１：国際関係の課題",
    "title_e": "S1: Issues in International Relations",
    "regno": 20310,
    "lang": "Language of Instruction: J",
    "summary_e": "The course provides a critical review of selected issues in contemporary international relations, focusing on how international politics are involved in these issues and how individuals are connected to them. The goals of the course include approaching international issues from a multilateral perspective, enhancing understanding and analysis of issues, improving writing skills, and re-considering critical analysis. The class consists of lectures and discussions, and the topics covered include globalization, national security, human security, food security, infectious disease control, human rights, and migration.\n\n[Japanese Summary]",
    "summary_j": "この講義では、現代の国際関係における選ばれた課題を批判的に考察し、国際政治がこれらの問題にどのように関連しているか、また個人がこれらの問題にどのように関わっているかを重視します。この講義の目標は、国際的な課題に多側面的な視点から取り組むこと、問題の理解と分析を高め、文章力を向上させること、そして批判的な分析を再考することです。講義は、グローバリゼーション、国家安全保障、人間の安全保障、食料安全保障、感染症対策、人権、人の移動などのテーマに焦点を当てています。"
  },
  {
    "cno": "GES032",
    "term": "Autumn Term",
    "title_j": "Ｓ１：歴史学",
    "title_e": "S1: History",
    "regno": 20312,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the characteristics of historical studies and their relationship with other fields such as humanities and social sciences. It emphasizes the importance of understanding history as an academic discipline and the need to analyze past events using valid methods. The course also focuses on four major themes in Japanese and East Asian history, including diplomacy and trade, disasters and pandemics, war and politics, and territory. Students will examine primary documents related to these themes and consider how different people interpreted the events at the time. The course will also address the challenges and limitations faced by historians in understanding the past and its relevance to the present.",
    "summary_j": "このコースは歴史学の特質と人文科学や社会科学との関係を探究します。学問としての歴史を理解することの重要性を強調し、適切な方法を用いて過去の出来事を分析する必要性も述べています。また、日本や東アジアの歴史における4つの主要なテーマ、外交と貿易、災害とパンデミック、戦争と政治、領土に焦点を当てます。学生はこれらのテーマに関連する主要文書を研究し、当時の人々がどのように出来事を解釈したのかを考えます。さらに、歴史家が過去を理解する際に直面する課題や制約にも取り組み、その過去が現在に対してどのように関連しているかを考えます。"
  },
  {
    "cno": "GES051",
    "term": "Autumn Term",
    "title_j": "Ｓ２：メディアと記号",
    "title_e": "S2: Media and Cultural Signs",
    "regno": 20314,
    "lang": "Language of Instruction: J",
    "summary_e": "This course explores how meaning is constructed through media and the significance of semiotic analysis in revealing the hidden meanings of various signs in our everyday lives. It aims to provide students with a critical approach towards media representation and an understanding of how media imposes specific meanings as 'natural' or as ideology. The course will cover linguistic, literary, and cultural studies perspectives on media representation, with a focus on TV, film, and comics. Lectures will be conducted in Japanese, but English can be used for questions, discussion, comment sheets, and the final essay.",
    "summary_j": "このコースでは、メディアを通じて意味がどのように社会的に構築されるかを調査する。意味論分析によって、私たちが日常生活で見過ごしがちなさまざまな記号の意味を明らかにし、異なる解釈の可能性を拓くことができる。"
  },
  {
    "cno": "GES094",
    "term": "Autumn Term",
    "title_j": "Ｓ２：「災後」の人間・社会・文化",
    "title_e": "S2: Human, Society and Culture in Post-disaster Era",
    "regno": 20317,
    "lang": "Language of Instruction: J",
    "summary_e": "This course focuses on exploring the possibilities of new post-disaster research methods from three perspectives: \"science, technology, society,\" \"culture, symbolism,\" and \"politics, policy.\" The course aims to analyze various aspects of post-disaster society from an interdisciplinary perspective and cultivate imagination in perceiving past and future disasters as one's own. In addition, the course seeks to discuss infectious diseases as disasters in the current situation.",
    "summary_j": "この科目では、「科学・技術・社会」「文化・象徴」「政治・政策」の三つの視点から、新しい「災後」研究方法の可能性を探求します。さまざまな分野からの学際的な視点で災後社会の多様な側面を分析し、過去や未来の災害を「自分のこと」として捉える想像力を養い、感染症も「災害」として議論することを目指しています。"
  },
  {
    "cno": "GEN012",
    "term": "Autumn Term",
    "title_j": "Ｎ１：物理の世界（Ｂ）- 物理が教えてくれるもの",
    "title_e": "N1: World of Physics (B) - Answers from Physics",
    "regno": 20318,
    "lang": "Language of Instruction: E",
    "summary_e": "Summary in English: This course aims to explain the foundations and concepts of physics in a different approach, focusing on concrete devices and objects commonly found in daily life. The goal is to understand how these objects work and to find principles of physics within them. The course covers topics such as the laws of motion, mechanical objects, fluids, heat and phase transitions, and thermodynamics. The language of instruction is English and students will be evaluated through exams, research reports or essays, homework, online assignments, and active participation.",
    "summary_j": "Summary in Japanese: このコースは物理学の基礎と概念を伝えるため、従来の方法とは異なるアプローチを取ります。具体的なデバイスや日常生活でよく見られるオブジェクトに焦点を当て、それらがどのように機能しているのかを理解することを目指します。コースは運動の法則、機械のオブジェクト、流体、熱と相変化、熱力学などのトピックをカバーしています。教授言語は英語で、評価は試験、研究レポートまたはエッセイ、宿題、オンライン課題、積極的な参加を通じて行われます。"
  },
  {
    "cno": "HPE005",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅠ",
    "title_e": "Physical Education Exercise I",
    "regno": 20410,
    "lang": "",
    "summary_e": "This course aims to promote a healthy body and mind through physical activity for better student life. It offers physical education classes to help students adapt to their new university life and foster relationships with individuals from different cultural backgrounds. Through activities and various problem-solving experiences, students can deepen their understanding of themselves, others, and group dynamics, while enjoying the classes.",
    "summary_j": "この授業は、身体活動を通じて健康な心と体を育むことを目指しています。新しい大学生活に慣れるとともに、他の学生との人間関係を促進するための体育授業を展開します。仲間との交流や様々な課題解決の経験を通じて、自己や他者、集団づくりについて理解を深めることができます。"
  },
  {
    "cno": "HPE005",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅠ",
    "title_e": "Physical Education Exercise I",
    "regno": 20411,
    "lang": "",
    "summary_e": "This course aims to promote a healthy body and mind for better school life through physical activity. It is designed to help students adjust to university life and facilitate relationships with individuals from different cultural backgrounds. Through interaction with peers and various problem-solving experiences, students will deepen their understanding of themselves, others, and group dynamics. The class will also provide enjoyable lessons and opportunities for socializing.",
    "summary_j": "この授業は身体活動を通して、健康な体と心を作り、より良い学校生活を目指しています。このクラスでは、大学生活に慣れるための体育授業を行い、様々な文化的な価値観を持つ他の人との人間関係を促進します。さまざまな課題解決の体験を通じて、自己や他者、集団について理解を深めることができます。"
  },
  {
    "cno": "HPE005",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅠ",
    "title_e": "Physical Education Exercise I",
    "regno": 20412,
    "lang": "",
    "summary_e": "This course aims to promote physical and mental health through physical activity, with the goal of improving school life. The course focuses on helping students adjust to university life and fostering relationships with individuals from diverse cultural backgrounds. Through activities and problem-solving experiences, students will deepen their understanding of themselves, others, and group dynamics. The course is designed to be enjoyable and includes opportunities for social interaction. Attendance is mandatory, and the course will be conducted in-person, although online classes may be implemented due to social circumstances.",
    "summary_j": "このコースは、身体活動を通じて健康な心身を育成し、より良い学校生活を目指すことを目的としています。新しい大学生活に慣れるための支援や文化的な異なる人々との関係構築を促進する体育授業です。仲間との交流や様々な課題解決の体験を通じて、自己や他者、集団についての理解を深めることができます。楽しい授業を展開するための内容です。授業は対面形式で行われ、出席が必須ですが、社会情勢によりオンライン授業に変更することがあります。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20413,
    "lang": "",
    "summary_e": "This course aims to enhance understanding of oneself and others and develop communication skills through team sports. Students will experience various team sports such as tag rugby, flying disc, soft volleyball, unihoc, and table tennis. The class will focus on improving verbal and non-verbal communication, physical competence, and self-identity, with applications for daily life. Attendance will be evaluated for grading, and there will be no exams. It is a compulsory course for graduation from ICU.",
    "summary_j": "このコースは、チームスポーツを通じて自己と他者の理解を深め、コミュニケーション能力を発展させることを目指しています。学生たちは、タグラグビーやフライングディスク、ソフトバレーボール、ユニホック、卓球など、さまざまなチームスポーツを体験します。クラスでは、言語的および非言語的なコミュニケーション能力、身体的な能力、自己のアイデンティティを向上させることに重点を置き、日常生活に応用できるようにします。評価のために出席が評価され、試験はありません。ICUの卒業には必修科目です。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20418,
    "lang": "",
    "summary_e": "This course focuses on team sports as a means of developing communication skills and understanding oneself and others. Students will experience various team sports and learn about teamwork, leadership, followership, inclusion, self-identity, goal setting, and verbal and non-verbal communication. The course aims to provide students with basic skills that can be applied to their daily lives. It is a compulsory graduation course and may be conducted online depending on social conditions.",
    "summary_j": "この授業はチームスポーツを通じてコミュニケーション能力の向上と自己・他者の理解を目指しています。学生はさまざまなチームスポーツを体験し、チームワーク、リーダーシップ、フォロアーシップ、インクルーシブ、自己認識、目標設定、そして言語と非言語のコミュニケーションについて学びます。この授業は日常生活に応用できる基礎能力の習得を目指しています。卒業に必修の科目であり、社会状況によってはオンラインで行われる場合もあります。"
  },
  {
    "cno": "HPE006",
    "term": "Autumn Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 20424,
    "lang": "",
    "summary_e": "Summary (English): This course aims to enhance self-understanding and understanding of others, as well as develop communication skills through participating in team sports. Students will experience various team sports and learn about teamwork, leadership, followership, self-identity, inclusion, goal setting, and verbal and non-verbal communication skills that can be applied to their daily lives. This course is a compulsory graduation course.",
    "summary_j": "Summary (Japanese): このコースは、チームスポーツを通じて自己理解と他者理解を深め、コミュニケーション能力を開発することを目指しています。学生は複数のチームスポーツを体験し、チームワーク、リーダーシップ、フォロワーシップ、自己認識、インクルージョン、目標設定、言語や非言語コミュニケーションなどの基本的なスキルを身につける機会があります。この科目は卒業必修科目です。"
  },
  {
    "cno": "WFR201",
    "term": "Autumn Term",
    "title_j": "上級フランス語Ⅱ",
    "title_e": "Advanced French II",
    "regno": 20511,
    "lang": "Language of Instruction: O",
    "summary_e": "This advanced level course integrates various aspects of studying French language and culture. Advanced French Ⅱ focuses on preparing for the DAPF French proficiency test, appreciating French culture, and practicing language skills such as translating Japanese texts into French and writing. Students must have completed French III or have equivalent language skills. There is no required order for taking Advanced French courses.",
    "summary_j": "この上級レベルのコースは、フランス語の言語能力と文化の研究に関連する多くの側面を統合しています。特に、Advanced French Ⅱでは、DAPFフランス語能力試験の準備、フランス文化の理解、および言語の実践（日本語の文をフランス語に翻訳するということやフランス語の作文）に重点を置いています。必修科目はフランス語Ⅲまたは同等の前提条件です。注意：上級フランス語のコースを受講するために特定の順序は必要ありません。"
  },
  {
    "cno": "WKR102",
    "term": "Autumn Term",
    "title_j": "韓国語 II",
    "title_e": "Korean II",
    "regno": 20515,
    "lang": "Language of Instruction: O",
    "summary_e": "This course, Korean 2, is a continuation of Korean 1 and is designed to enhance students' communicative skills in modern Korean. The course focuses on introducing further grammar points and useful expressions through interactive activities. Students will also learn about Korean culture throughout the semester. The course aims to enable students to communicate in Korean on broader topics, comprehend basic-intermediate-level grammar, and gain knowledge about Korean culture and contemporary lifestyle. The grading policy includes mid and final exams, attendance and participation, and home assignments.",
    "summary_j": "このコースは、韓国語1に続く韓国語2であり、学習者の現代韓国語のコミュニケーション能力を向上させるために設計されています。このコースでは、インタラクティブな活動を通して、さらなる文法ポイントや有用な表現を紹介します。学生はまた、学期を通じて韓国文化についても学びます。このコースの目標は、日常生活のより幅広いトピックで韓国語でコミュニケーションを取る能力を身につけ、基礎から中級レベルの文法を理解し、韓国の文化と現代のライフスタイルに関する知識を獲得することです。成績評価基準には、中間試験と期末試験、クラスへの出席と参加、課題が含まれています。"
  },
  {
    "cno": "WKR102",
    "term": "Autumn Term",
    "title_j": "韓国語 II",
    "title_e": "Korean II",
    "regno": 20516,
    "lang": "Language of Instruction: O",
    "summary_e": "English Summary: This course is a continuation of Korean 1 and aims to improve students' basic communicative skills in modern Korean to a basic-intermediate level. The course covers grammar, useful expressions, and interactive activities to enhance speaking, listening, reading, and writing skills. Throughout the course, students will also be introduced to various aspects of Korean culture. The details of the class will be announced by the instructor on the first day.",
    "summary_j": "Japanese Summary: 「韓国語Ⅰ」に続くコースで、基礎から中級レベルの文法を学び、韓国語でのコミュニケーション能力を向上させると同時に、韓国の文化や現代の生活に関する知識も学ぶ。授業では、話す・聞く・読む・書く能力を高めるために様々な活動が行われる。授業の詳細は初日に担当教員から説明される予定。"
  },
  {
    "cno": "WKR202",
    "term": "Autumn Term",
    "title_j": "上級韓国語 II",
    "title_e": "Advanced Korean II",
    "regno": 20517,
    "lang": "Language of Instruction: O",
    "summary_e": "This course is for those who want to improve their speaking and writing abilities in Korean. A prerequisite for this course is Advanced Korean I or equivalent. The class will be held in a classroom and the textbook used is \"Sejong Korean.\" LINE will be utilized for close communication with students. The details of the class schedule will be explained by the instructor on the first day of class.",
    "summary_j": "このコースは、話す力と書く力を向上させたい人のためのものです。韓国語の上級I以上の前提条件が必要です。授業は教室で行われ、教科書は『Sejong Korean』です。学生との連絡のためにLINEも使用されます。授業スケジュールの詳細は、最初のクラスで講師によって説明されます。"
  },
  {
    "cno": "ELG206",
    "term": "Autumn Term",
    "title_j": "理系学生のための卒業論文作成法（英語）",
    "title_e": "Senior Thesis Science Writing (English)",
    "regno": 20607,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is open to NS major students and focuses on scientific report writing using the IMRaD structure. Writing skills are crucial in the scientific community for effective collaboration and pursuing a scientific career. Students will learn about different sections of the IMRaD structure and will be asked to write examples for each section. In addition, they will design and conduct a mini-experiment to obtain empirical data for their own IMRaD report. The course covers various aspects of scientific writing, such as formatting, citing, presenting data, and writing effective introduction, methods, results, and discussion sections. Successful students will be able to write a coherent scientific report paper with appropriate structure and tone using their own empirical data.",
    "summary_j": "この科目は、NSメジャーを選択している学生を対象にしています。科学のコミュニティにおいて、英語による文章の執筆は最も重要なコミュニケーション形式です。書くスキルを向上させることで他の科学者との協力がより良くなり、科学分野でのキャリアを目指す人にとって良いライティングスキルは欠かせません。この科目では、IMRaDの構造を用いた科学的レポートの執筆に焦点を当てます。"
  },
  {
    "cno": "ELG206",
    "term": "Autumn Term",
    "title_j": "理系学生のための卒業論文作成法（英語）",
    "title_e": "Senior Thesis Science Writing (English)",
    "regno": 20608,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is open to NS major students and aims to improve their scientific writing skills using the IMRaD structure. The course will cover genre-specific writing features and students will learn to write each section of an IMRaD paper, use appropriate vocabulary and grammar, describe visual data, analyze papers in their field, and understand the features of a well-written abstract. The course will be conducted in English.",
    "summary_j": "この科目はNSメジャーの学生を対象にしており、IMRaD形式を使用した科学論文の書き方を向上させます。ジャンル別の書き方の特徴や、IMRaD論文の各セクションの例文作成、適切な語彙と文法の使用、グラフやチャートで表現された視覚データの説明、自分の専門分野の論文の分析、上手に書かれた抄録の特徴を学ぶことができます。この科目は英語で行われます。"
  },
  {
    "cno": "TCP101",
    "term": "Autumn Term",
    "title_j": "英語コミュニケーション",
    "title_e": "English Communication",
    "regno": 20609,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is designed to help students in the English Teacher Certification Program improve their English proficiency skills. The aim is for students to reach the C1 level according to the CEFR. The course also focuses on developing students' ability to use English for teaching, adjusting their language to students, providing appropriate input, and using language flexibly to facilitate classroom interaction. The course is offered in both the Autumn and Winter terms, with different proficiency levels required for each term. The course will cover various academic topics, with an emphasis on building academic vocabulary.",
    "summary_j": "このコースは、英語教師認定プログラムの受講生が英語運用能力を向上させるためのものです。CEFRに基づいてC1レベルに到達することを目指します。また、教育のための英語の使用能力を育成し、言語を柔軟に使い、クラスルームでのインタラクションを促進するための能力も開発します。コースは秋学期と冬学期の両方で提供され、それぞれの学期には異なるレベルの英語能力が必要です。コースではさまざまな学術的なトピックを取り上げ、学術語彙の構築に重点を置いています。"
  },
  {
    "cno": "AMS101",
    "term": "Autumn Term",
    "title_j": "アメリカ学原論",
    "title_e": "Principles of American Studies",
    "regno": 21118,
    "lang": "Language of Instruction: E",
    "summary_e": "This course serves as an introduction to American Studies, approaching the understanding of American society, culture, and history through an interdisciplinary lens. The course specifically focuses on science fiction film and television, exploring how these cultural works mediate social difference, state power, and our understanding of political belonging and conflict. The primary sources analyzed in the course include famous American science fiction works such as The Twilight Zone, Invasion of the Body Snatchers, Blade Runner, Night of the Living Dead, and Get Out. Through the analysis of these sources, students will gain familiarity with key concepts and methods of American Studies and science fiction film studies, while developing skills in summarizing and interpreting primary and secondary sources, analyzing links between cultural objects and historical contexts, and communicating complex ideas through writing and verbal discussions.",
    "summary_j": "このコースは、アメリカ合衆国の社会、文化、歴史の理解に対して学際的なアプローチを採用し、アメリカ研究への導入となる。映画やテレビを通じて、文化作品が社会的な差異の歴史的な発展、国家権力、政治的所属感や対立の日常的な理解といった領域をどのように媒介するのかを問いかける。このコースは、アメリカの主要なSF作品を中心に据え、アメリカ研究のキーワードや映画分析の方法を学び、人文科学や社会科学のさまざまな場面で応用できる分析ツールを開発するものである。"
  },
  {
    "cno": "ANT103",
    "term": "Autumn Term",
    "title_j": "人類学原論",
    "title_e": "Principles of Anthropology",
    "regno": 21119,
    "lang": "Language of Instruction: J",
    "summary_e": "This course provides an overview of the history of anthropological theory and introduces basic concepts of anthropology. It focuses on the material aspects of culture, social structure and organization, and the symbolic aspects of culture and culture change. The course aims to deepen students' understanding of the variations and similarities of human life and the importance of anthropological perspectives in daily living. Students will also learn about the aims and significance of fieldwork, the methodological characteristics of cultural anthropology, and develop skills in problem analysis and academic writing.",
    "summary_j": "このクラスでは、人類学理論の歴史を概観し、人類学の基本的な概念を紹介する。文化の実証面、社会構造と組織、文化と社会の象徴的側面、そして文化の変化に重点を置く。このコースの目的は、人間の営為の多様性と類似性をより深く理解し、日常生活の中で人類学的な視点の重要性を学ぶことである。学生はまた、フィールドワークの目的と意義、文化人類学の方法論的特徴についても学び、問題分析のスキルと学術的な執筆能力を開発する。"
  },
  {
    "cno": "BUS101",
    "term": "Autumn Term",
    "title_j": "会計学",
    "title_e": "Accounting",
    "regno": 21149,
    "lang": "Language of Instruction: J",
    "summary_e": "Summary (English): This course provides an overview of the financial structure of modern business, including the double entry system and financial reporting. It also covers topics such as financial statement analysis, auditing, and legal requirements in Japan. The main objective of the course is to help students understand the fundamental principles of bookkeeping and acquire the necessary knowledge for future accounting and finance courses. The course is open to all students who are interested in becoming accounting professionals or working in the field of business. Grading is based on quizzes (35%) and a final exam (65%). It is recommended for students to read the textbook before class and practice solving problems to reinforce their understanding of double-entry bookkeeping.",
    "summary_j": "Summary (Japanese): このコースは、近代企業の財務構造や複式会計制度、財務報告書の作成などについて学ぶものである。また、会計監査や法令的規制にも触れる。学修目標は、複式簿記の原則を理解し、財務諸表を作成できること、財務諸表の意味を理解できることなどである。コース全体の成績評価は、小テストが35%、期末試験が65%で決められる。"
  },
  {
    "cno": "CHM221",
    "term": "Autumn Term",
    "title_j": "無機化学 I",
    "title_e": "Inorganic Chemistry I",
    "regno": 21159,
    "lang": "Language of Instruction: E",
    "summary_e": "Inorganic Chemistry I covers the basics of atomic, electronic, and molecular structure, as well as bonding theory. It aims to provide an understanding of the periodicity of elements and the important aspects of inorganic chemistry, such as the structure, properties, and reactivities of inorganic substances. The course also explores the characteristics of Main Group elements and encourages familiarity with chemical resources. The language of instruction is English and the grading policy includes continual assessment and a final examination.",
    "summary_j": "無機化学Iは、原子、電子、分子の構造の基礎から始めて、結合理論を扱い、元素の周期律と無機化学の最も重要な側面である無機物質の構造、性質、反応性、およびそれらの関係性を理解することを目指しています。この授業は、元素の化学に基づく基本的な概念を理解し、現代無機化学の範囲と有用性についての認識を得ることを目標としています。また、メイングループ元素の特徴についても学び、化学リソース（原著論文、総説、教科書、インターネットリソース）にも関心を持つことが重要です。"
  },
  {
    "cno": "DPS203",
    "term": "Autumn Term",
    "title_j": "開発のマクロ経済学",
    "title_e": "Development Macroeconomics",
    "regno": 21171,
    "lang": "Language of Instruction: J",
    "summary_e": "This course aims to familiarize students with the economic problems and policy concerns of developing countries. The specific topics covered include the history of development economics, growth theory, commodity export policy and terms of trade, import substituting industrialization, domestic savings and financial intermediation, external debt crisis, and Australia model. It is recommended to have prior knowledge of principles of macroeconomics.",
    "summary_j": "この科目は途上国の経済問題や政策に詳しくなることを目的としています。具体的な内容としては、開発経済学の歴史、経済成長論、商品輸出政策や交易条件、輸入代替工業化、国内貯蓄と金融仲介、対外債務危機、オーストラリアモデルなどが取り上げられます。マクロ経済学の基礎を履修することが望ましいです。"
  },
  {
    "cno": "ECO213",
    "term": "Autumn Term",
    "title_j": "経済学のための数学入門",
    "title_e": "Introduction of Mathematics to Economics",
    "regno": 21175,
    "lang": "Language of Instruction: J",
    "summary_e": "This course covers basic level mathematics in order to prepare students to study intermediate micro/macro economics. The topics covered include functions, sets, limits, differentiation, partial derivatives, Lagrangean, integration, and probability and statistics. Examples from economics will be used, so it is recommended that students have taken courses in PRINCIPLE OF MACROECONOMICS and PRINCIPLE OF MICROECONOMICS.",
    "summary_j": "この科目は、中級経済学の準備のために基礎レベルの数学を取り扱っています。関数、集合の基本概念、極限、微分、偏微分、ラグランジュ、積分、確率統計の基本概念について学びます。経済学の事例を使用するため、マクロ経済学原論とミクロ経済学原論の履修を強くおすすめします。"
  },
  {
    "cno": "ECO259",
    "term": "Autumn Term",
    "title_j": "金融,貨幣と金融市場",
    "title_e": "Money, Banking and Financial Markets",
    "regno": 21176,
    "lang": "Language of Instruction: E",
    "summary_e": "This course provides a comprehensive study of the financial system, including money, banking, and financial markets. Students will learn about the role, structure, and operation of the financial system, covering topics such as debt and equity markets, financial institutions, central banking, and monetary policy. Through analysis of case studies and real-world events, students will deepen their understanding of financial markets and institutions and develop skills in debating and arguing. The course also focuses on developing students' ability to learn and communicate in English, as well as critically think, apply knowledge in real-world situations, and express ideas in oral and written communication.",
    "summary_j": "このコースは学生に金融システムの役割と構造、運営について総合的に学びます。具体的なトピックは債券市場、株式市場、金融機関、中央銀行などを含みます。学生はケーススタディーと実際のイベントの分析を通じて、金融市場や金融機関の理解を深め、議論や論争の能力を開発します。さらに、学生は英語で学び、世界中の人々とコミュニケーションする能力や批判的思考能力を培い、実生活の状況に知識を応用する能力も養います。"
  },
  {
    "cno": "ECO263",
    "term": "Autumn Term",
    "title_j": "日本経済論",
    "title_e": "Japanese Economy",
    "regno": 21178,
    "lang": "Language of Instruction: J",
    "summary_e": "Summary (English): This lecture aims to provide students with a thorough understanding of the post-war Japanese economy through the use of macro- and microeconomic theories. It covers basic concepts such as GDP, business cycles, economic growth, inflation/deflation, as well as fiscal, monetary, and structural policies. The lecture also analyzes the special features of the Japanese economy from a business cycle and economic growth perspective, and discusses the effectiveness of economic policies implemented during that time. Additionally, it addresses future challenges for the Japanese economy, including the outdatedness of the current economic system, fiscal deterioration, the impact of aging and declining population, and inequality. ",
    "summary_j": "要約 (日本語): この講義は、マクロ・ミクロ経済理論を用いて戦後の日本経済について徹底的な理解を提供することを目的としています。GDP、景気循環、経済成長、インフレ/デフレ、財政・金融・構造政策などの基本的な概念を学ぶ内容が含まれます。この講義ではまた、景気循環と経済成長の観点から日本経済の特徴を分析し、当時実施された経済政策の効果についても議論します。さらに、現在の経済システムの時代遅れ、財政の悪化、高齢化と人口減少の影響、格差拡大のリスクなど、日本経済の将来的な課題にも取り組みます。"
  },
  {
    "cno": "EDU113",
    "term": "Autumn Term",
    "title_j": "教育の国際的展望",
    "title_e": "International Perspectives on Education",
    "regno": 21183,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the world literacy problem and its future prospects, as well as the changing landscape of primary, secondary, higher, and non-formal education. It aims to incorporate international perspectives in education to address pressing global issues such as poverty, demographic change, environment, war, and gender imbalance. Through literature and case studies, students will conduct research and propose necessary components for the education system of a chosen country.",
    "summary_j": "このコースでは、世界の識字問題とその将来の展望、また初等教育、中等教育、高等教育、非公式教育の変遷について研究します。国際的な視点を教育領域に取り込むことで、貧困、人口変動、環境、戦争、ジェンダーの不均衡といった世界的な問題に取り組むことが目標です。文献や事例を通じて研究し、選択した国の教育システムに国際的な視点を組み込むための必要な要素を提案します。"
  },
  {
    "cno": "EDU216",
    "term": "Autumn Term",
    "title_j": "図書館学",
    "title_e": "Library Science",
    "regno": 21187,
    "lang": "Language of Instruction: J",
    "summary_e": "This course provides a brief survey of libraries, with a focus on their function, organization, services, and administration. It also covers the planning and equipping of libraries. The course is recommended for those seeking teacher certification. The goals of the course are to understand the purpose and organization of various libraries and related institutions, as well as to obtain basic knowledge to search and evaluate information properly. The course covers topics such as the history of libraries, laws related to libraries, university libraries and the National Diet Library, school libraries and public libraries, information organizing methods, changing information, new services of libraries, and more.",
    "summary_j": "この授業では、図書館とその資料の収集、組織、保管と利用の機能や管理について概観し、図書館の計画と設備についても取り上げます。教職課程履修学生には特におすすめです。この授業の目標は、さまざまな図書館や関連機関の目的や組織を理解し、情報を適切に探索、評価するための基礎知識を得ることです。授業では、図書館の歴史、図書館に関連する法律、大学図書館や国立国会図書館、学校図書館や公共図書館、情報の組織化方法、変化する情報、図書館の新しいサービスなどのトピックを取り扱います。"
  },
  {
    "cno": "EDU308",
    "term": "Autumn Term",
    "title_j": "学習とコミュニケーションのデータ分析",
    "title_e": "Learning and Communication Data Analysis",
    "regno": 21192,
    "lang": "Language of Instruction: E",
    "summary_e": "This course discusses the data collected from online learning environments and their potential to improve learning. It also focuses on practicing data analysis techniques. Learners are encouraged to take a prerequisite course in learning analytics to prepare for this course. The course covers topics such as computer-mediated discourse analysis, effective studies, data selection, human interaction studies, behavior analysis, and critical discourse analysis. Learners will have the opportunity to analyze samples in either Japanese or English, and the course concludes with presentations and a final paper. There are no exams, but participation, completion of an anti-plagiarism certificate, and revisions on the final paper are required for grading.",
    "summary_j": "このコースでは、オンライン学習環境から収集されたデータとその学習向上の可能性について議論し、データ分析技術の実践に取り組みます。学習者は、このコースに備えて学習分析の前提コースを取ることが奨励されています。コースは、コンピューターメディエーションディスコース分析、効果的な研究、データ選択、人間の相互作用研究、行動分析、クリティカルディスコース分析などのトピックをカバーしています。学習者は、日本語または英語のサンプルを分析する機会があり、コースはプレゼンテーションと最終論文で締めくくられます。試験はありませんが、採点には参加、盗作防止のオンライン証明書の取得、および最終論文の修正が必要です。"
  },
  {
    "cno": "EDU320",
    "term": "Autumn Term",
    "title_j": "国際教育協力論",
    "title_e": "International Cooperation in Education",
    "regno": 21194,
    "lang": "Language of Instruction: J",
    "summary_e": "This course covers issues in international cooperation in education, including the history, relevant theories, aid agencies and NGOs, and global governance. Students will also learn methods to measure the social impacts of education. The course aims to prepare students to assess international cooperation in education comprehensively in their respective areas of interest through analytical skills.",
    "summary_j": "この科目は、国際教育協力に関する問題を議論します。国際教育協力の歴史、実践を裏付ける理論、援助機関やNGOの形態と組織、グローバルガバナンスの課題などをカバーします。また、教育の社会的影響を評価する方法も学びます。学生は、自分の関心分野における国際教育協力を総合的に評価するための分析スキルを身につけることを目指しています。"
  },
  {
    "cno": "ENV303",
    "term": "Autumn Term",
    "title_j": "環境問題特別研究Ⅰ",
    "title_e": "Advanced Studies in Environmental Issues I",
    "regno": 21198,
    "lang": "Language of Instruction: J",
    "summary_e": "An advanced, specialized course that examines environmental issues from a broad perspective. The course approaches topics such as environmental ethics, pollution control, and conservation of natural environments from the viewpoint of environmental management. Primarily aimed at junior and senior students, the course explores the importance of forests in our environment and the historical and modern development of environmental accounting. The class will be conducted in Japanese, but discussions and necessary questions can be conducted in English or German.",
    "summary_j": "環境問題について広範な視野で研究する高度な専門コース。環境倫理、公害対策、自然環境の保護など、環境管理の視点からの理論的・実践的なアプローチを行います。主に3、4年生が対象で、森林の重要性や環境会計の歴史、現代的な展開について学びます。授業は日本語で行われますが、参加者間のディスカッションや必要な質問は英語やドイツ語でも行うことができます。"
  },
  {
    "cno": "HST223",
    "term": "Autumn Term",
    "title_j": "日本思想史",
    "title_e": "Japanese Intellectual History",
    "regno": 21205,
    "lang": "Language of Instruction: J",
    "summary_e": "This course explores the conflict and accommodation between different intellectual discourses in Japan, including Confucianism, Shintoism, Buddhism, and Christianity. It focuses on the problems associated with the introduction of Christianity in the 16th and 19th centuries, as well as the intellectual origins of concepts such as guilt and sin, life and death, and love and humanity. The course aims to deepen students' understanding of the mentalities of ordinary people in early modern Japan and develop their own ideas about Edo period thought.",
    "summary_j": "この授業では、日本の様々な思想との葛藤と融和を探究します。これには儒学、神道、仏教、キリスト教が含まれます。16世紀と19世紀にキリスト教が導入された際の問題や、罪や罪悪感、生と死、愛や人間性といった概念の思想的起源に焦点を当てます。この授業では、日本近世の一般人の考え方についての理解を深め、江戸時代の思想について独自の考えを発展させることを目指しています。"
  },
  {
    "cno": "ISC104",
    "term": "Autumn Term",
    "title_j": "プログラミング基礎",
    "title_e": "Foundation of Programming",
    "regno": 21217,
    "lang": "Language of Instruction: J",
    "summary_e": "This course introduces students to the basic concepts of computer programming and problem-solving using Python. Students will learn about algorithm analysis and development, program creation, debugging, and testing various problems. The course covers Python principles and topics such as variables, conditional branches, loops, functions, lists, dictionaries, recursion, file input/output, and an introduction to object-oriented programming. Problem-solving topics include numerical simulations, combinatorial problems, and image processing.",
    "summary_j": "このコースでは、学生はPythonを使用してプログラミングの基本的な概念を学び、問題解決のためのスキルを身につける。学生はアルゴリズムの分析と開発、プログラムの作成、デバッグ、さまざまな問題のテストなどを学ぶ。変数、条件分岐、繰り返し、関数、リスト、辞書、再帰、ファイル入出力、オブジェクト指向プログラミングの導入など、Pythonの原則と主要なトピックもカバーされる。問題の解決には数値シミュレーション、組み合わせ問題、画像処理などが含まれる。"
  },
  {
    "cno": "LED274",
    "term": "Autumn Term",
    "title_j": "国語科教育法 I",
    "title_e": "Teaching Methods in Japanese (Kokugo-Ka) I",
    "regno": 21234,
    "lang": "Language of Instruction: J",
    "summary_e": "This is an introduction to the curriculum and teaching methods of Kokugo in Japanese junior high schools and senior high schools. It is a required course for teacher certification, focusing on the purposes, contents, and methods of teaching Kokugo, as well as the history, national guideline, course design, material development, teaching practicum, and textbook analysis.",
    "summary_j": "中学校及び高等学校の国語科の教育目的・内容・方法についての概論です。この科目は、国語科教員免許状取得のための必修科目であり、中学校の国語教育の問題や国語教育の変遷、学習指導要領、授業計画、教材開発、模擬授業、教材分析などが取り上げられます。"
  },
  {
    "cno": "LED356",
    "term": "Autumn Term",
    "title_j": "外国語としての日本語教授法I",
    "title_e": "The Teaching of Japanese as a Foreign Language I",
    "regno": 21237,
    "lang": "Language of Instruction: J",
    "summary_e": "Aims and methods of teaching Japanese as a foreign language: observation, simulation and practice in the ICU Japanese Language Programs. For students preparing to teach Japanese as a foreign language. The course extends over more than a single prerequisite to younger number. Prerequisite: Principles of Language Learning and Teaching.",
    "summary_j": "日本語教育の目的と方法について学ぶ。ICUにおける日本語教育プログラムでは、見学と模擬実習が行われる。外国語として日本語を教えるための準備をしている学生のための科目であり、予備条件として言語学習と教授の原則を学ぶことが必要。"
  },
  {
    "cno": "LED360",
    "term": "Autumn Term",
    "title_j": "日本語習得における諸問題",
    "title_e": "Topics in Japanese Language Acquisition",
    "regno": 21239,
    "lang": "Language of Instruction: J",
    "summary_e": "This course focuses on how learners of Japanese acquire the structural characteristics of the language, specifically in terms of pronunciation. It explores the difficulties and factors related to language acquisition, including the influence of the learner's native language. The course also examines the unique characteristics of Japanese pronunciation and discusses the factors that contribute to successful acquisition.",
    "summary_j": "日本語習得者が日本語の特徴的な発音を習得する過程と、それに関連する困難や要因について検討します。母語の影響や個別的な要因も考察し、日本語音声の特殊性についても取り上げます。日本語教育の研究に触れながら、発音習得の成功要因も議論します。"
  },
  {
    "cno": "MTH352",
    "term": "Autumn Term",
    "title_j": "幾何学 II",
    "title_e": "Geometry II",
    "regno": 21273,
    "lang": "Language of Instruction: E",
    "summary_e": "The aim of this course is to understand the definition of integration over manifolds. The course consists of one period of lecture and two periods of recitation weekly, using the online textbook \"Manifolds and Differential Forms.\" It is recommended to have taken CALCULUS and LINEAR ALGEBRA II as prerequisites, and BASIC CONCEPTS IN MATHEMATICS III is also recommended. The grading policy includes a final exam, homework, and participation in exercises.",
    "summary_j": "このコースでは、多様体上での積分の定義を理解することを目標としています。コースでは、「Manifolds and Differential Forms」というオンラインテキストを使用し、1つの時限を講義、2つの時限を演習として週に行います。前提条件として、微分積分学と線形代数学 IIの履修が必要であり、数学通論 IIIを履修した方が望ましいです。"
  },
  {
    "cno": "MCC103",
    "term": "Autumn Term",
    "title_j": "カルチュラル・スタディーズ入門",
    "title_e": "Introduction to Cultural Studies",
    "regno": 21280,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the history and development of cultural studies in different social contexts. It examines how our interests in music, movies, and hobbies shape our identities and explores the role of popular culture and media in shaping social norms. The course aims to help students understand how cultural studies can analyze and critique important issues in society, such as sexism, racism, and class inequality. By the end of the course, students should be familiar with key concerns, theories, and methodologies in cultural studies and be able to apply these concepts to analyze social and cultural aspects of their everyday lives.",
    "summary_j": "この授業では、カルチュラル・スタディーズの歴史と発展を異なる社会的文脈で探求します。音楽、映画、趣味など特定の分野に興味を持つことが自己のアイデンティティ形成にどのような影響を与えているのかを考察し、ポピュラーカルチャーやメディアが社会的規範を形成する役割を探ります。この授業はカルチュラル・スタディーズがセクシズム、人種差別、階級の不平等といった重要な社会問題を分析し批判する方法を学ぶためのものです。授業終了時には、学生はカルチュラル・スタディーズの鍵となる概念、理論、方法論に精通し、これらの概念を使って自己の日常生活の社会的・文化的側面を分析することができるようになっていることを目指しています。"
  },
  {
    "cno": "MCC236",
    "term": "Autumn Term",
    "title_j": "創造する翻訳",
    "title_e": "Translation at Work",
    "regno": 21287,
    "lang": "Language of Instruction: E",
    "summary_e": "This course offers students the opportunity to explore specialized tools used in the translation industry. Students will gain practical knowledge about translation working environment, translation memory technology, translation project management, and more. Through individual and collaborative translation tasks, students will gain an understanding of the localization industry, the potential and limitations of these tools, methods of evaluating their performance, and how translation quality is evaluated in the industry. The course aims to enable students to engage in team-working on translation projects, gain practical knowledge of the tools, understand the localization process, and have a deep understanding of aspects that impact translation quality in the industry.\n\n**Japanese Summary:**",
    "summary_j": "このコースでは、学生が翻訳業界で使用される専門ツールを探求する機会が提供されます。学生は、翻訳作業環境、翻訳メモリ技術、翻訳プロジェクト管理などに関する実践的な知識を得ます。個別と協力的な翻訳課題を通じて、学生はローカリゼーション業界の概要、これらのツールの可能性と制限、パフォーマンスの評価方法、翻訳業界での翻訳品質の評価方法を理解します。このコースは、学生がチームでの翻訳プロジェクトに参加し、ツールの実践的な知識を得ること、ローカリゼーションプロセスを理解すること、翻訳品質に影響を与えるさまざまな要素を深く理解することを目指しています。"
  },
  {
    "cno": "MCC274",
    "term": "Autumn Term",
    "title_j": "説得と言語",
    "title_e": "Persuasion and Language",
    "regno": 21290,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on the art of persuasion and how language is used to manipulate and influence others in various cultural contexts. Students will examine rhetorical devices used in popular songs, advertisements, headlines, political speeches, and more, to develop an understanding of how language can be persuasive. They will also have the opportunity to practice using rhetorical devices to make their own language more persuasive. The course will be taught online via Zoom, with class meetings recorded and available for review on Moodle.",
    "summary_j": "このコースでは、説得の芸術と言語が様々な文化の中でどのように操作され、他者への影響力を持つのかに焦点を当てています。学生は、音楽、広告、見出し、政治的演説などで使用される修辞技法を分析し、言語がどのように説得力を持つのかを理解します。また、自分自身の言語をより説得力のあるものにするために修辞技法の活用を実践する機会もあります。このコースはZoomを使用してオンラインで開講され、授業の録音やレビューはMoodleで利用可能です。"
  },
  {
    "cno": "MCC275",
    "term": "Autumn Term",
    "title_j": "コミュニケーション・テクノロジーと社会",
    "title_e": "Communication Technology and Society",
    "regno": 21291,
    "lang": "Language of Instruction: E",
    "summary_e": "English Summary: This course explores the adoption and use of new and old communication technologies and analyzes their role in society. It examines how communication technologies are introduced and shaped by social factors, as well as how they influence individuals, organizations, and society. The course aims to provide perspectives on the relationship between communication technologies and society, delve into the social history of older communication technologies, and critically examine the social and cultural aspects of new communication technologies such as the internet and mobile communications.",
    "summary_j": "Japanese Summary: このコースでは、新旧のコミュニケーション・テクノロジーの採用と使用について詳しく検討し、それらの技術が社会に果たす役割を分析します。コミュニケーション技術が社会に導入され、社会的要素によって形成される方法、さらには個人、組織、社会に与える影響を調査します。コースの目標は、コミュニケーション技術と社会の関係に対する視点を提供し、古いコミュニケーション・テクノロジーの社会的歴史を探求し、インターネットやモバイル通信などの新しいコミュニケーション・テクノロジーの社会的文化的側面を批判的に検討することです。"
  },
  {
    "cno": "PHR109",
    "term": "Autumn Term",
    "title_j": "新約聖書学概論",
    "title_e": "Introduction to the New Testament",
    "regno": 21302,
    "lang": "Language of Instruction: J",
    "summary_e": "This course examines the literary structure and ideological content of the Bible. The Old Testament is covered in Part I and the New Testament in Part II. Students will gain a deeper understanding of each book's historical context and analyze the overall ideas and teachings of the New Testament as a whole. The course aims to explore the central ideas of Christianity and how they have influenced people from the first century to the present day.",
    "summary_j": "このコースでは、新約聖書の27の書物の基本的な考え方を、それらが存在した歴史的文脈の中で学ぶことを目的としています。まず、新約聖書で最も古い書物であるパウロの書簡を読み、その後に四つの福音書を学びます。最後に、第二パウロ書簡とヨハネの黙示録に焦点を当てます。新約聖書の27の書物を分析することにより、キリスト教の教義となったその全体的な考え方を理解し、世界の主要な宗教であるキリスト教の砲弾となり、多くの人々に無私の行動を追求することで世界平和を啓発し続けていることを学生たちは得ることができるでしょう。"
  },
  {
    "cno": "PHR231",
    "term": "Autumn Term",
    "title_j": "旧約聖書の概観",
    "title_e": "Survey of the Old Testament",
    "regno": 21305,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the Old Testament/Hebrew Bible, focusing on its authorship, intended audience, creation process, and interpretations throughout history. It aims to provide a deep understanding of this complex and profound text, addressing theological terms, the contents and outlooks of relevant texts, contemporary debates, and recent developments. The course includes discussions on big ideas and helps develop intellectual and academic skills. Grading is based on class participation, a midterm exam, and a final report.",
    "summary_j": "このコースは、世界で最も有名で、最も読まれ、最も愛され、時には最も嫌われる本である「旧約聖書・ヘブライ語聖書」についてのものです。この本は誰によって書かれたのか？誰のために書かれたのか？いつどのようにこの本は創られ、完成したのか？この本は西洋文明の歴史を通じてどのように解釈されたのか？このコースは、人類の歴史上最も複雑で深遠なテキストの一つである旧約聖書に関連する幅広い問いに答えるために設計されています。"
  },
  {
    "cno": "PHR333",
    "term": "Autumn Term",
    "title_j": "旧約聖書の神学",
    "title_e": "Theology of the Old Testament",
    "regno": 21308,
    "lang": "Language of Instruction: J",
    "summary_e": "This course critically examines the major issues of Old Testament Studies, with a focus on methodology and contemporary implications. It explores the views of nature, life, and society in the Old Testament, and considers the inspiration it provides for human behavior in terms of environmental and social ethics. The course encourages students to gain their own answers through critical reading of Old Testament texts and modern thinkers. Evaluation is based on class participation (40%), a midterm exam (40%), and a final report (20%). A minimum overall grade of 60% is required to pass. Students who give presentations will receive extra credit.",
    "summary_j": "この授業では、旧約聖書の視点に焦点を当て、自然、生命、社会という観点からの問いに対してどのような影響を与えるかを考察します。学際的なアプローチを取り入れながら、古代の文書と現代の思想家のテキストを批判的に読み解き、環境倫理に関する理解を深めることを目指します。評価は授業への参加度が40%、中間試験が40%、期末レポートが20%で、60%以上を取ることが必要です。プレゼンテーションをする学生には、追加のクレジットが与えられます。"
  },
  {
    "cno": "POL215",
    "term": "Autumn Term",
    "title_j": "政治理論",
    "title_e": "Political Theory",
    "regno": 21323,
    "lang": "Language of Instruction: J",
    "summary_e": "Summary (English): This course focuses on theorizing contemporary politics, democracy, the state, civil society, and identity. It emphasizes theories of political institutions, ideologies, and types of behaviors. The learning goals include exploring theories of justice and egalitarianism, as well as incorporating both normative and empirical studies. The course consists of lectures, group presentations, and discussions.",
    "summary_j": "Summary (Japanese): この授業では、現代の政治、民主主義、国家、市民社会、アイデンティティなどについての理論的考察が行われます。特に政治制度、イデオロギー、行動のタイプに焦点が当てられます。学修目標として、正義と平等主義の理論に注目し、規範的な理論だけでなく実証的な研究も取り上げられます。講義とグループプレゼンテーションによるディスカッションが行われます。"
  },
  {
    "cno": "POL234",
    "term": "Autumn Term",
    "title_j": "日本の政治",
    "title_e": "Japanese Politics",
    "regno": 21324,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to explore various aspects of the Japanese state and society, including politics, history, sociology, economics, and culture. It examines Japan's unique post-war political system, which saw one party in power for over fifty years, along with its development as a democracy and economic powerhouse. The course delves into the puzzles, successes, and failures of postwar Japan, analyzes the main political actors and their motivations, and explores the state-society relationship. It also examines Japan's domestic and foreign policies, its changing international role, and the challenges it faces. By studying core theoretical concepts and methodologies, students will gain a deeper understanding of the Japanese and other political systems.\n\n【Japanese Summary】",
    "summary_j": "このコースは、政治、歴史、社会学、経済、文化など、日本の国家と社会のさまざまな側面を探求することを目的としています。戦後の日本の政治体制や民主主義としての進化、経済大国としての成長など、日本の特異な要素を詳細に分析します。コースでは、戦後日本の謎や成功、失敗について検討し、主要な政治家やその動機を分析し、国家と社会の関係にも焦点を当てます。さらに、日本の国内外の政策、変化する国際的な役割、および直面する課題にも取り組みます。学生は、中心となる理論的な概念や方法論を学ぶことで、日本および他の政治体制についてより深い理解を得ることができます。"
  },
  {
    "cno": "SOC102",
    "term": "Autumn Term",
    "title_j": "社会学原論",
    "title_e": "Principles of Sociology",
    "regno": 21337,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is an introduction to sociological principles and concepts, focusing on social action, roles, groups, institutions, and systems. The topics covered include socialization, culture, race and ethnicity, sex and gender, marriage and family, religion, deviance, inequality, and globalization. The course aims to develop a sociological perspective, critical thinking skills, and an understanding of the world and social structures. Daily attendance is important for success.",
    "summary_j": "この科目は、社会的な行動、役割、グループ、制度、システムに特に注意を払って、社会学的な原理と概念を紹介する入門コースです。社会化、文化、人種と民族、性とジェンダー、結婚と家族、宗教、逸脱、不平等、グローバリゼーションなどのさまざまな分析対象が含まれます。この科目では、社会学的な視点、批判的思考能力、世界と社会構造の理解を深めることを目指しています。日常の出席は成功のために重要です。"
  },
  {
    "cno": "ECO381",
    "term": "Autumn Term",
    "title_j": "経済学特別講義 I",
    "title_e": "Advanced Studies in Economics I",
    "regno": 21348,
    "lang": "Language of Instruction: E",
    "summary_e": "English Summary: This course is a research methods course in Economics that focuses on teaching students the process of economic research and research writing. It is recommended for students planning to write a senior or MA thesis in Economics. Throughout the course, students will learn the fundamentals of economic research and apply those tools to create their own research proposal. The course concludes with the presentation of the research proposal in written, visual, and oral form. The course aims to develop students' academic foundation, ability to learn and communicate in English, critical thinking skills, ability to apply knowledge in real-world situations, and ability to express ideas through data and graphs.",
    "summary_j": "Japanese Summary: この経済学の研究手法のコースは、学生に経済研究のプロセスとジャンルに特化した経済研究の文章の作成を教えるものである。経済学専攻のシニア論文や修士論文を書く予定の学生には特にお勧めである。学生は経済研究の基礎を学び、それらのツールを使用して独自の研究提案を作成する。コースの最後には、研究提案を書面、視覚的および口頭形式で発表する。このコースは、学生の学問的な基盤、英語での学習とコミュニケーション能力、批判的思考力、現実の問題の解決能力、データとグラフを用いたアイデアの表現能力を開発することを目指している。"
  },
  {
    "cno": "SOC208",
    "term": "Autumn Term",
    "title_j": "食と農の社会学",
    "title_e": "Sociology of Agriculture and Food",
    "regno": 21353,
    "lang": "Language of Instruction: J",
    "summary_e": "The purpose of this course is to analyze various social phenomena surrounding food and agriculture. It explores macro aspects such as food issues and food safety systems, as well as micro aspects such as politics between social groups related to agriculture and food. The language of instruction varies depending on the year.",
    "summary_j": "この科目は、食と農業を中心にするさまざまな社会的現象を分析することを目的としています。食と農業に関連する法律や規制などのマクロな社会構造だけでなく、社会運動が食のシステムに与える影響などのミクロな側面も探究します。教育言語は年によって異なる。"
  },
  {
    "cno": "QEED529",
    "term": "Autumn Term",
    "title_j": "国際バカロレア教育における指導・学習・評価：MYPとDP",
    "title_e": "Teaching, Learning and Assessment in the IB Programmes: MYP and DP",
    "regno": 22107,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is focused on teaching, learning, and assessment in IB education, specifically the MYP and DP programs. The course aims to deepen understanding of IB learning theories, develop instructional strategies and assessment tasks, and promote lifelong learning and leadership in IB education. The course covers topics such as assessment, rubrics, moderation, accountability, and meaningful assessment activities. Attendance is required, with a minimum of 80% attendance, and active participation and feedback are expected. Summative assessment tasks include making an assessment task and rubric, a mock class project and term paper, and reflecting on class and demonstrating educational leadership.",
    "summary_j": "このコースは、IB教育（特にMYPとDPプログラム）における教え方、学び方、評価に焦点を当てています。IBの学習理論の理解を深め、MYPとDPでの教示戦略と評価課題の開発を行い、IB教育の中での生涯学習と教育リーダーになるためのスキルを身に付けることを目指しています。コースでは、評価、評価基準、モデレーション、評価の責任感、意味のある評価活動などのトピックを取り上げます。出席は必須であり、最低80％の出席率が求められ、積極的な参加とフィードバックが期待されます。サマティブ評価課題には、評価課題と評価基準の作成、モッククラスのプロジェクトや学期論文、授業の反省と教育リーダーシップの発揮などが含まれます。"
  },
  {
    "cno": "QEPS515",
    "term": "Autumn Term",
    "title_j": "平和心理学特論",
    "title_e": "Peace Psychology",
    "regno": 22109,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on the interactions between human beings and their physical and social environments, with a particular emphasis on the relationship between environmental contexts and issues of peace, security, and conviviality. The course explores topics such as group dynamics, prejudice, discrimination, conflict, psychological and physiological impacts of conflict and violence, strategies for avoiding or managing conflict, and methods for educating for a more peaceful world. Weekly readings will be assigned and students will be evaluated based on active participation, a class presentation on a research topic of their choice, and a final report.",
    "summary_j": "この科目は、人間と物理的・社会的環境の相互作用に焦点を当て、平和、安全、共生という基本的問題と環境との関わりについて学ぶ。集団力学、偏見、差別、紛争、平和の心理学的影響、紛争の回避と対応戦略、より平和な世界を目指した教育方法などについても考える。授業は、平和心理学の基本概要から始まり、週ごとに読書課題が出される。最終的な成績評価は、積極的な参加度、研究トピックについてのクラス発表、そして最終レポートによって行われる。"
  },
  {
    "cno": "QPFD433",
    "term": "Autumn Term",
    "title_j": "研究デザインと方法論",
    "title_e": "Research Design and Methodology",
    "regno": 22207,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is designed to teach students majoring in politics and international studies about research design and how to conduct research. It covers topics such as designing a research project, causal inferences, case selection, and writing a research proposal. Additionally, various methodologies for academic research will be introduced, including comparative methods, quantitative studies, case methods, field research, critical perspective, normative approach, and legal analysis. The course is open to graduate and senior students, and aims to provide them with the skills and knowledge needed to successfully complete a master thesis or academic paper.",
    "summary_j": "このコースは、政治・国際研究専攻の学生に対して、研究デザインとは何か、どのように研究を進めるかを教えることを目的としています。研究プロジェクトのデザイン方法、因果関係、ケースの選定、研究プロポーザルの書き方などのトピックをカバーしています。さらに、比較法、計量研究、ケースメソッド、フィールド調査、クリティカルな視点、規範的アプローチ、法的分析など、アカデミックな研究におけるさまざまな方法論を紹介します。このコースは、大学院生や卒業生を対象としており、彼らが修士論文や学術論文を成功裏に完成させるために必要なスキルと知識を提供することを目指しています。"
  },
  {
    "cno": "QPPE604",
    "term": "Autumn Term",
    "title_j": "国際開発政策",
    "title_e": "International Development Policy",
    "regno": 22221,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on the theoretical analysis of economic and social development planning and policies in developing countries. It aims to explore specific policy issues related to various development fields. The topics covered include development measurement, poverty, commodity export policy, industrialization strategy, financial crisis, governance, agriculture economics, education, migration, and Japanese ODA. The course is primarily designed for JDS fellows and students interested in economic development. The learning goal is to acquire knowledge of international development policy issues. The course consists of lectures and a student presentation on a development-related topic.",
    "summary_j": "このコースは、開発途上国における経済と社会の発展計画と政策の理論的分析を扱っており、選択された開発分野に関連する具体的な政策課題を探求することを目的としています。対象テーマには、開発の測定、貧困問題、商品輸出政策、工業化戦略、金融危機、ガバナンス、農業経済学、教育、移民、日本のODAなどが含まれます。このコースは、主にJDSフェローズや経済開発に興味を持つ学生を対象としています。学びの目標は、国際的な開発政策課題の知識を習得することです。コースは、講義と最終週の学生の開発に関連するトピックに関するプレゼンテーションで構成されています。成績評価は、論文とプレゼンテーションがそれぞれ50％ずつ評価されます。"
  },
  {
    "cno": "ELA042",
    "term": "Winter Term",
    "title_j": "リベラルアーツ英語プログラム(Stream 4)：アカデミック・スキル",
    "title_e": "English for Liberal Arts Program(Stream 4): Academic Skills",
    "regno": 30106,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is designed to support the core Academic Reading and Writing and Reading and Content Analysis courses in the Liberal Arts English Program (Stream 4). It aims to further develop students' language abilities by providing practical training opportunities. Through the use of appropriate materials, students can gain confidence in their individual academic abilities, such as study skills, research, presentation, and communicative skills. The course is taught over three terms and must be taken in sequence.",
    "summary_j": "この科目は、リベラルアーツ英語プログラムの中核となる「読解と論文作成」と「精読と英文構成法」とのコースをサポートするために設計されています。実践的な訓練の場を提供することで、学生の語学力を向上させることを目指しています。適切な教材を使用して、学生は学習方法、リサーチ、プレゼンテーション、コミュニケーションスキルなど、個々の学術的な能力に自信を持つことができます。この科目は3学期にわたって教授され、順序通りに履修する必要があります。"
  },
  {
    "cno": "JLP081",
    "term": "Winter Term",
    "title_j": "日本語特別教育 1",
    "title_e": "Special Japanese 1",
    "regno": 30211,
    "lang": "Language of Instruction: J",
    "summary_e": "The Special Japanese Program is designed for students who will learn Japanese as their mother tongue, first language, or heritage language. Through this course, students will be able to develop basic skills in vocabulary building, reading comprehension, writing passages, and oral expression that are necessary for university study. The course consists of five class hours per week and requires completion of the prerequisite course \"INTRODUCTION TO JAPANESE FOR FIRST/HERITAGE LANGUAGE SPEAKERS\" or an equivalent level.",
    "summary_j": "日本語特別教育プログラムは、母語／第１言語／継承語として日本語を学ぶ学生のためのプログラムです。このコースでは、大学生として必要な基礎的な日本語の語彙力、読解力、文章作成力、口頭表現力を身につけることができます。週に5時限の授業があり、前提条件として「第一言語／継承語話者のための日本語入門」または同等のレベルのコースを既修している必要があります。"
  },
  {
    "cno": "GEH051",
    "term": "Winter Term",
    "title_j": "Ｈ２：行動の科学・人間性の科学（Ａ）",
    "title_e": "H2: Behavioral Sciences and Humanistic Sciences (A)",
    "regno": 30307,
    "lang": "Language of Instruction: J",
    "summary_e": "This course focuses on gaining a deeper understanding of the meaning of human behavior and social life through the lens of modern behavioral and humanistic sciences. It explores various topics such as perception, motivation, and stress that influence human behavior. The course aims to facilitate critical thinking about the complex issue of human nature, rather than solely acquiring knowledge. The instructors will present lectures based on their respective areas of expertise.",
    "summary_j": "このコースでは、現代の行動科学と人間性科学の視点を通じて、人間の行動と社会生活の意味を深く理解することを重点的に取り組みます。知覚、動機づけ、ストレスなど、人間の行動に影響を与える様々なトピックについて探求します。この授業では、単に知識を習得するのではなく、人間性という複雑な問題について批判的思考を促進することを目的としています。講師はそれぞれの専門分野に基づいて講義を行います。"
  },
  {
    "cno": "GES009",
    "term": "Winter Term",
    "title_j": "Ｓ１：国際関係ディベート",
    "title_e": "S1: Debates in International Relations",
    "regno": 30310,
    "lang": "Language of Instruction: J",
    "summary_e": "This course aims to teach students the main theories of international relations and develop their critical thinking skills through policy debate on the current topics of Japan's international relations. Students will learn to use these theories to effectively argue and present evidence in debates conducted in Japanese. The course also emphasizes understanding the benefits and limitations of achieving deliberative democracy in a cooperative learning environment.",
    "summary_j": "この授業では、国際関係学の主要な理論を学び、それを基に現在の日本の国際関係に関する論争を通じて批判的思考力を養うことが目標です。学生はディベートを通じて自分たちのコミュニケーションと説得力のある能力を伸ばし、国際交渉や政策対話において必要な論理的思考力と批判的思考力を発展させます。また、協調学習環境における審議型民主主義の達成に向けた利点と限界を理解することも求められます。"
  },
  {
    "cno": "GES012",
    "term": "Winter Term",
    "title_j": "Ｓ１：政治学（Ｂ）",
    "title_e": "S1: Political Science (B)",
    "regno": 30311,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to deepen understanding of fundamental political concepts and examine the complexity and importance of politics in reality. It addresses the global nature of life and the impact of world politics on our daily lives. The course explores the historical background to better understand the present and potentially shape the future. Students will read Sidney W. Mintz's \"Sweetness and Power\" to explore how something as seemingly innocuous as sugar has brought people together and transformed their relationships in unexpected ways. The course also aims to develop students' critical analysis skills in relation to world politics.",
    "summary_j": "この授業は、政治学の基本的な概念を理解し、現実の政治の複雑さと重要性について考察することを目的としています。生活はグローバルです。世界の政治が私たちの日常生活にどれだけ影響を与えるかを理解するために、過去を研究します。また、過去の知識が今日と明日をより良く理解するために役立つことを願っています。この授業では、Sidney W. Mintzの『Sweetness and Power』を読み、人々を異なる大陸で結びつけ、予期せぬ方法で彼らの地位と関係を変えた、甘さの力について学びます。また、学生が世界政治を批判的に分析する能力を養うことを目指します。"
  },
  {
    "cno": "GES030",
    "term": "Winter Term",
    "title_j": "Ｓ１：企業の社会的責任",
    "title_e": "S1: Corporate Social Responsibility",
    "regno": 30316,
    "lang": "Language of Instruction: J",
    "summary_e": "This course focuses on understanding the role and functions of corporations in society and how they address various issues such as the environment, labor rights, and corporate governance. Through lectures and discussions, students will gain knowledge and perspectives on corporate social responsibility from a global citizen's viewpoint. The course aims to develop critical thinking skills and encourage students to consider their own role as stakeholders in companies.",
    "summary_j": "このコースでは、企業の社会的責任を地球市民の視点から理解し、企業が環境、労働権、コーポレートガバナンスなどのさまざまな問題に取り組む方法について学びます。講義やディスカッションを通じて、学生は企業の社会的責任についての知識や視点を得ることができます。このコースでは、批判的思考力を養い、学生が企業のステークホルダーとしての役割を考えることを促します。"
  },
  {
    "cno": "GES039",
    "term": "Winter Term",
    "title_j": "Ｓ２：統計情報リテラシー",
    "title_e": "S2: Statistical Information Literacy",
    "regno": 30318,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to teach the basic skills of data analysis for studying the social sciences. It covers lectures on statistics, sampling methods, and data processing methods. The course also incorporates the use of computers for practical understanding of data processing and statistical analysis. The main goal is for students to learn how to produce and analyze statistical information accurately, and develop a healthy skepticism towards the statistical information they encounter in their daily lives. The course includes topics such as probability theory, connecting probability theory to data, hypothesis testing, linear regression, and time-series data analysis. The grading policy includes a mid-term test, participation, and an end of term data analysis project.",
    "summary_j": "このコースでは、社会科学を学ぶためのデータ分析の基本的なスキルを学びます。統計学、サンプリング方法、データ処理方法についての講義が行われます。また、コンピュータを使用してデータ処理と統計分析の実践的な理解を深めることも含まれています。このコースの主な目標は、正確な統計情報の生成と分析を学び、日常生活で遭遇する統計情報に対して健全な懐疑的な態度を養うことです。コースでは確率論、データとの関連付け、仮説検定、線形回帰、時系列データの分析などのトピックが含まれています。成績評価基準には、中間試験、参加度、学期末のデータ分析プロジェクトが含まれています。"
  },
  {
    "cno": "GES052",
    "term": "Winter Term",
    "title_j": "Ｓ２：文化翻訳の世界",
    "title_e": "S2: The World of Cultural Translation",
    "regno": 30320,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the concept of cultural translation through the medium of film. It examines the cultural translation of famous stories in different times and cultural settings, focusing on the shifts in narrative, images, dialogue, and translation that highlight different ideas. The course aims to answer questions about why some stories travel internationally while others do not and the challenges that arise in translating culturally specific texts for new audiences. Through case studies, students will learn about the impact of cultural contexts and formal demands on the translation of film elements. The course also aims to cultivate critical thinking and communication skills, as well as an awareness of cultural forms, contexts, and agents involved in cultural translation processes.",
    "summary_j": "この講座では、映画を通じて文化翻訳の概念について取り上げます。異なる時代や文化の中で有名な物語がどのように文化翻訳され、ナラティブやイメージ、対話、翻訳のシフトが異なるアイデアを浮かび上がらせるのかを調べます。この講座では、なぜ一部の物語が国際的に広まるのか、文化的に特異なテキストを新しい観客に翻訳する際に生じる問題についての質問に答えることを目指しています。事例研究を通じて、学生は文化的な文脈や形式的な要件が映画の要素の翻訳に与える影響について学びます。また、この講座では批判的思考やコミュニケーション能力の育成だけでなく、文化翻訳プロセスに関与する文化的な形式、文脈、エージェントに対する認識も養われます。"
  },
  {
    "cno": "GES057",
    "term": "Winter Term",
    "title_j": "Ｓ２：グローバル・社会変革のための教育プロジェクト",
    "title_e": "S2: Education Projects for Global and Social Change",
    "regno": 30322,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to help students think about their role as global citizens in shaping global society through education. They will learn about examples of education projects from a variety of organizations and work in groups to plan and implement their own projects that address social or global problems.",
    "summary_j": "このコースでは、教育を通じてグローバル社会の形成において地球市民としての現在と将来の役割について考えることが求められます。UNICEF、JICA、地元のNGOなどの機関で学外セミナーも行われ、他の教育プロジェクトの事例について学ぶ機会を提供します。学生はグループでグローバルまたは社会的な変革をもたらすために教育プロジェクトを計画し、実施します。"
  },
  {
    "cno": "HPE006",
    "term": "Winter Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 30406,
    "lang": "",
    "summary_e": "This course involves experiencing team sports activities, such as various team sports, to understand oneself and others and improve communication skills. The course focuses on developing skills related to teamwork, leadership, followership, inclusiveness, self-identity, goal setting, and verbal and non-verbal communication that can be applied in daily life. It is a compulsory graduation course.",
    "summary_j": "この授業は、チームスポーツを活動を通じて自己と他者を理解し、コミュニケーション能力を向上させることを目的としています。授業では、ティームワーク、リーダーシップ、フォロアーシップ、インクルーシブ、自己認識、目標設定、言語と非言語のコミュニケーションなど、日常生活で応用できる基礎能力の習得に重点を置いています。この授業は卒業必修科目です。"
  },
  {
    "cno": "HPE006",
    "term": "Winter Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 30407,
    "lang": "",
    "summary_e": "This course aims to develop communication skills and understanding of oneself and others through experiencing various team sports. Students will participate in three different team sports to enhance their verbal and non-verbal communication, physical competence, and self-identity. This course is required for graduation from ICU.",
    "summary_j": "このコースでは、自己と他者をより理解し、コミュニケーション能力を向上させるために、3つのチームスポーツを体験します。クラスでは、数種のチームスポーツを通じて、日常生活に応用できる言語コミュニケーション、身体能力、自己アイデンティティを発展させることができます。ICUの卒業には必須の科目です。"
  },
  {
    "cno": "HPE006",
    "term": "Winter Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 30408,
    "lang": "",
    "summary_e": "This course aims to develop communication skills and understanding of oneself and others through team sports. Students will have the opportunity to experience various team sports, such as ultimate frisbee, softball, volleyball, and sitting volleyball, and learn about verbal and non-verbal communication, teamwork, leadership, followership, self-identity, and goal setting. The course is compulsory and conducted as a regular face-to-face class. The grading policy includes attendance, self-reflection, class participation, and instructor and self-assessed competencies.",
    "summary_j": "この授業は、チームスポーツを通じてコミュニケーション能力や自己・他者理解を発展させることを目指しています。学生はアルティメット、ソフトボール、バレーボール、シッティングバレーなどの様々なチームスポーツを体験し、言語や非言語のコミュニケーション、チームワーク、リーダーシップ、フォロアーシップ、自己認識、目標設定について学びます。この授業は卒業必修科目であり、通常の対面授業として行われます。評価基準は出席、自己反省、クラス参加度、教員と自己評価された能力によって行われます。"
  },
  {
    "cno": "HPE006",
    "term": "Winter Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 30410,
    "lang": "",
    "summary_e": "English: This course aims to enhance communication skills and develop leadership skills through experiencing team sports with the purpose of understanding oneself and others. In the class, students will participate in various sports to develop verbal and non-verbal communication skills, physical competence, and self-identity that can be applied in daily life. This course is a compulsory course for graduation from ICU.",
    "summary_j": "Japanese: 自己・他者を理解することを目的としたチームスポーツ体験を通じて、コミュニケーション能力やリーダーシップ力を向上させることを目指す。授業では、数種のスポーツを通して、日常生活に応用できるような言語や非言語のコミュニケーション能力、身体の能力、自己のアイデンティティを発展させます。この科目はICU卒業のための必修科目です。"
  },
  {
    "cno": "HPE006",
    "term": "Winter Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 30411,
    "lang": "",
    "summary_e": "English Summary: This course aims to enhance understanding of oneself and others and develop communication skills through team sports. Students will experience various team sports and learn about teamwork, leadership and followership, self-identity, inclusion, goal setting, and verbal and non-verbal communication. The course focuses on acquiring basic skills that can be applied in daily life. Attendance is required and the course is a compulsory graduation requirement.",
    "summary_j": "Japanese Summary: このコースでは、チームスポーツを通じて、自己と他者を理解し、コミュニケーション能力を発展させることを目指しています。学生は複数のチームスポーツを体験し、チームワーク、リーダーシップ＆フォロワーシップ、自己認識、インクルージョン、目標設定、言語および非言語コミュニケーションなどの理解を深め、日常生活に応用可能な基本的なスキルの習得の機会があります。これは卒業必修科目です。"
  },
  {
    "cno": "HPE006",
    "term": "Winter Term",
    "title_j": "PE　エクササイズⅡ",
    "title_e": "Physical Education Exercise II",
    "regno": 30471,
    "lang": "",
    "summary_e": "This course focuses on developing communication skills and understanding oneself and others through participation in team sports. Students will experience various team sports and improve their verbal and non-verbal communication, physical competence, and self-identity. The course is a compulsory requirement for graduation from ICU and will not have exams. Grading will be based on self-reflection, class participation, and instructor and self-assessed competencies.",
    "summary_j": "この授業では、チームスポーツに参加することを通じて、コミュニケーション能力の向上と自己・他者の理解を深めることを目指しています。生徒たちはさまざまなチームスポーツを体験し、言語的および非言語的なコミュニケーション能力、身体的な能力、自己認識を向上させます。この授業はICUの卒業要件であり、試験はありません。評価は自己反省、クラス参加度、教員および自己評価された能力に基づいて行われます。"
  },
  {
    "cno": "WFR203",
    "term": "Winter Term",
    "title_j": "上級フランス語Ⅲ",
    "title_e": "Advanced French III",
    "regno": 30508,
    "lang": "Language of Instruction: O",
    "summary_e": "This advanced level course aims to improve French-language skills and expand cultural knowledge of the French-speaking world. It focuses on business French, reading skills, French movies, and understanding French society. The learning goals include acquiring B1 level listening, speaking, and reading skills, as well as developing a deeper understanding of French society and the skills needed to pass the B1 level of the DELF exam. The course is divided into three mini-courses and taught by different instructors. Attendance and participation, as well as a final evaluation, determine the course grade.",
    "summary_j": "この上級フランス語コースは、フランス語の言語能力向上とフランス語圏の文化知識の拡充を目指します。具体的には、ビジネス・フランス語、講読、フランス映画、フランス社会について学ぶことを重点的に取り組んでいます。学修目標は、B1レベルの聴解、口頭表現、読解能力の習得、フランス社会についての深い理解、DELF B1レベルの試験に合格するためのスキルの開発です。コースは3つのミニコースに分かれており、異なる教員が担当します。出席と参加度、最終評価が成績評価の基準となります。"
  },
  {
    "cno": "WKR203",
    "term": "Winter Term",
    "title_j": "上級韓国語 III",
    "title_e": "Advanced Korean III",
    "regno": 30514,
    "lang": "Language of Instruction: O",
    "summary_e": "This course is designed to improve reading and expressive skills by reading and discussing written documents in Korean. The course requires the completion of Advanced Korean II or an equivalent level. The goal is to enhance intercultural competence in the Korean language and culture, focusing on communication with Korean people. The class will cover speaking, listening, reading, and writing skills, as well as introduce aspects of Korean culture throughout the semester.",
    "summary_j": "このコースは、韓国語の文書を読み、それについて話し合うことによって、読解力と表現力を向上させるためのものです。上級韓国語IIまたは同等のレベルの修了が必要です。このコースの目標は、韓国語や韓国文化に関する異文化コミュニケーション能力を向上させることであり、韓国人との意思疎通を円滑に行うためのものです。授業では、話す、聞く、読む、書くのスキルを習得するだけでなく、韓国文化の要素も紹介されます。"
  },
  {
    "cno": "TCP101",
    "term": "Winter Term",
    "title_j": "英語コミュニケーション",
    "title_e": "English Communication",
    "regno": 30606,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to improve the English proficiency skills of students in the English Teacher Certification Program. The goal is for students to reach the C1 level of proficiency according to the CEFR, as well as develop the ability to teach in English, adjust their language to students, provide understandable input, and facilitate interaction in the classroom. The course is offered in both the Autumn and Winter terms, with the Autumn class suitable for high-intermediate level students (B2) and the Winter class for advanced level students (C1). Regular attendance, active participation, and timely completion of assignments are expected from students.",
    "summary_j": "このコースは、英語教員認定プログラムの学生に必要な英語運用能力を開発するために設計されています。具体的には、CEFRに基づくC1レベルの英語運用能力を目指すことを目的としています。また、教えるための英語の運用能力を向上させ、生徒に適切な言語インプットを提供し、柔軟に言語を使ってクラス内のインタラクションを促進する能力も開発します。このコースでは、英語を高いレベルで使用できる学生向けの秋学期クラスと、英語の高度なレベルで習熟している学生向けの冬学期クラスが提供されています。学生は出席をすること、定期的に参加すること、課題を提出することが期待されています。"
  },
  {
    "cno": "BIO101",
    "term": "Winter Term",
    "title_j": "基礎生物学",
    "title_e": "Foundation of Biology",
    "regno": 31135,
    "lang": "Language of Instruction: J",
    "summary_e": "This team-taught course introduces basic concepts in microbiology, plant biology, and animal biology. There is a strong emphasis on textbook reading and assignment work, and it is assumed that students have preliminary knowledge equivalent to high school biology. The class will be conducted in a face-to-face mode, and announcements, assignment submissions, and discussions will take place on Moodle. The course covers topics such as plant molecular genetics, plant physiology and molecular biology, diversity and taxonomy of invertebrates, diversity and taxonomy of vertebrates, cell biology, biochemistry, and other topics by guest speakers. Students need to choose two out of five contents to write reports on, and at least one report must be written in English.",
    "summary_j": "このチーム授業では、微生物学、植物学、動物学の基本概念が導入される。教科書の読み物や課題の重要性が強調され、生物学の高校レベルの予備知識が前提とされる。授業形式は対面で行われ、ZoomのミーティングID、課題提出、ディスカッションは全てMoodleで行われる。授業内容には植物の遺伝学、植物の形態と機能、無脊椎動物の多様性と分類学、脊椎動物の多様性と進化の歴史、細胞生物学、生化学などが含まれる。ゲストスピーカーによる他のトピックもある。"
  },
  {
    "cno": "BIO222",
    "term": "Winter Term",
    "title_j": "動物発生生物学概論",
    "title_e": "Basic Concepts in Animal Developmental Biology",
    "regno": 31138,
    "lang": "Language of Instruction: J",
    "summary_e": "This class focuses on the basic principles of developmental biology and animal biology, with an emphasis on the molecular level. Students will learn about the processes of growth, differentiation, and morphogenesis in animals, as well as the genetic basis of development. The class covers various topics such as fertilization, early development of amphibian and Drosophila embryos, organogenesis, and reaction-diffusion systems. Students are expected to understand the technical terms in developmental biology and learn how to understand macroscopic biological phenomena at the cellular and molecular levels. The grading policy includes exams, homework, online quizzes, and class participation.",
    "summary_j": "この授業は、発生生物学と動物学の基本原理に焦点を当て、分子レベルでの理解を重視しています。学生は動物の成長、分化、形態形成の過程や発生の遺伝的な基礎について学びます。授業では受精、アフリカツメガエルとショウジョウバエの胚の初期発生、器官発生、反応拡散系など、さまざまなトピックをカバーします。学生は発生生物学の専門用語を正確に理解し、細胞と分子レベルでのマクロな生物現象の理解方法を学ぶことが期待されています。成績評価基準には試験、宿題、オンラインクイズ、授業参加が含まれています。"
  },
  {
    "cno": "BUS102",
    "term": "Winter Term",
    "title_j": "経営学序説",
    "title_e": "Introduction to Business Administration",
    "regno": 31145,
    "lang": "Language of Instruction: E",
    "summary_e": "This course introduces the basic concepts of business administration and management. It focuses on the management required to operate business enterprises and other organizations. Various sub-fields of business administration are covered to provide a comprehensive understanding of management. By the end of the course, students will be able to explore concepts and principles of managing business organizations, understand external and internal analysis methods in strategic management, and analyze the external and internal business environment of organizations.",
    "summary_j": "このコースでは、経営学とビジネス管理の基本的な考え方が学びます。ビジネス企業は生産の主体であり、社会における価値と富の主要な創造者と見なされます。このコースの焦点は、まずそのようなビジネス企業や他の組織を運営するために必要な経営にあります。その後、経営学のいくつかのサブフィールド（企業、組織、企業戦略、イノベーション、中小企業、国際ビジネスなど）を見て、経営の全体像を把握します。"
  },
  {
    "cno": "CHM101",
    "term": "Winter Term",
    "title_j": "化学概論",
    "title_e": "Concepts in Chemistry",
    "regno": 31152,
    "lang": "Language of Instruction: J",
    "summary_e": "This course covers the fundamental principles and knowledge of chemistry as a foundation of the natural sciences. Topics include electrons in atoms, periodic table and atomic properties, chemical bonding, acids and bases, among others. It emphasizes the importance of developing scientific literacy in understanding substances from a chemical point of view, not only for chemistry majors but for all students.",
    "summary_j": "この科目では、化学の基本原理と知識を学び、自然科学の基礎となる。具体的には、原子構造や周期表、化学結合、酸と塩基などについて学ぶ。化学専修生だけでなく、すべての学生が化学的な視点から物質を理解するための科学的なリテラシーを開発することが重要だとしている。"
  },
  {
    "cno": "DPS103",
    "term": "Winter Term",
    "title_j": "ジェンダーと開発",
    "title_e": "Gender and Development",
    "regno": 31159,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on gender and development within the field of development studies, exploring how gender relations affect and create development issues. The course aims to understand the theory and history of gender and development, develop skills in data collection and research methods, and analyze case studies of multilateral and bilateral development assistance. The course also explores feminist theories on development, gender mainstreaming, and the impact of gender on poverty and development indicators. The language of instruction is English, and assessment is based on class attendance, discussions and data analysis, presentations, and essays.",
    "summary_j": "Japanese Summary / 日本語の要約:\n「ジェンダーと開発」の関連性や影響、開発政策やプロジェクトへの影響を探求する本コース。ジェンダーと開発の理論や歴史を理解し、データ収集や研究方法、批判的な分析フレームワークを学び、多国間援助や二国間援助の事例について検討・議論することが目的。ジェンダーと開発の視点から開発課題、開発理論、開発プロジェクトを考察するコースです。"
  },
  {
    "cno": "EDU215",
    "term": "Winter Term",
    "title_j": "比較教育と国際教育の基礎",
    "title_e": "Fundamentals of Comparative and International Education",
    "regno": 31177,
    "lang": "Language of Instruction: E",
    "summary_e": "This course offers an introductory overview of education policies and practices in multiple countries. It covers topics such as education goals, policy and administration, achievement data, quality and access, teacher training, history education, media literacy education, peace education, and refugee/immigrants' education. By comparing education systems across different countries, students will gain an understanding of how education policies work and be able to propose improvements.",
    "summary_j": "このコースは、複数の国における教育政策と実践についての導入的な概要を提供します。教育目標、政策・行政・財政、成果データ、品質とアクセス、教師のトレーニング、歴史教育、メディアリテラシー教育、平和教育、難民・移民の教育など、様々なトピックが取り上げられます。異なる国々の教育制度を比較することで、学生は教育政策の仕組みを理解し、改善案を提案することができるようになります。"
  },
  {
    "cno": "ENV203",
    "term": "Winter Term",
    "title_j": "環境教育学",
    "title_e": "Environmental Education",
    "regno": 31187,
    "lang": "Language of Instruction: J",
    "summary_e": "This course explores the development and concept of environmental education (EE) and education for sustainable development (ESD), while reflecting on our world today. Students will work in groups to plan and implement their own EE/ESD projects, aiming to see EE as a transformative process for individuals and society through their experiences. The course also aims for students to deepen their understanding of the basic concepts and learning goals of EE and ESD, as well as develop their own views on sustainable development and the meanings of \"environment\" and \"education\" in EE. The course will be conducted online/mixed mode using Zoom as the main communication tool.",
    "summary_j": "このコースでは、環境教育（EE）および持続可能な開発のための教育（ESD）の発展と概念について学び、私たちが生きる世界について考えながら、環境と教育の意味について考察します。学生はグループで自分たちのEE/ESDプロジェクトを計画および実施し、EEを経験を通じて人々と社会の変容のための革新的なプロセスの一環として考えることを目指します。また、このコースでは、EEおよびESDの基本的な概念や学修目標に関する理解を深め、自分なりの持続可能な開発の意味や環境教育の「環境」と「教育」の意味についても考えることが期待されます。授業はオンライン/ミックスモードで行われ、Moodleが主なコミュニケーションツールとして使用されます。"
  },
  {
    "cno": "HST222",
    "term": "Winter Term",
    "title_j": "日本対外交流史",
    "title_e": "History of Japan in Asia",
    "regno": 31192,
    "lang": "Language of Instruction: E",
    "summary_e": "This course provides a historical overview of Japanese cultural relations with a focus on three periods: the Chinese-Japanese relations during the Nara-Heian periods, the encounter with Europe during the Christian Century, and Westernization during and after the Meiji era. The course will examine the development of diplomacy and trade in East Asia, including the impact of China's sea-closing policy, Japanese diplomatic missions to China, and the collapse of the tribute system. It will also explore relations with Europe in the 16th century, the role of port cities in Japan, and trade with Europeans and Chinese. The course aims to equip students with a deep understanding of Japan's pre-modern foreign relations and their significance in the context of modern developments in diplomacy and foreign relations.",
    "summary_j": "このコースでは、日本と中国、韓国、およびヨーロッパの間の国際関係を15世紀から17世紀まで概説する。まず、東アジアでの外交と貿易の発達を見ていき、中国の「海閉政策」、日本の中国への外交使節と貿易使節の活動、朝貢制度の崩壊に焦点を当てる。次に、16世紀のヨーロッパとの関係を調査し、江戸時代の新たな外交関係の特徴、平戸と長崎の港湾都市の発展と役割、ヨーロッパ人と中国人との貿易についても概説する。"
  },
  {
    "cno": "IRL236",
    "term": "Winter Term",
    "title_j": "朝鮮半島の政治と国際関係",
    "title_e": "Politics and International Relations in Korea",
    "regno": 31204,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on the politics and international relations of Korea, with an emphasis on understanding the domestic politics, national division, and international relations that shape the country. Students will learn about major developments in Korean history and discuss contemporary political issues. The goal is to equip students with the knowledge and tools to analyze politics and international relations in Korea and assess their future.",
    "summary_j": "このコースは韓国の政治と国際関係に焦点を当てており、国内政治、国家分割、国際関係の相互作用を理解することを目的としています。学生は韓国の歴史の重要な出来事を学び、現代の政治的課題について議論する機会も与えられます。このコースの目標は、学生が韓国の政治と国際関係を分析し、その将来を評価するための知識とツールを身につけることです。"
  },
  {
    "cno": "LED275",
    "term": "Winter Term",
    "title_j": "国語科教育法 II",
    "title_e": "Teaching Methods in Japanese (Kokugo-Ka) II",
    "regno": 31222,
    "lang": "Language of Instruction: J",
    "summary_e": "English summary: This course is part of the required courses for obtaining a teaching certification in Japanese (kokugo) for junior high school and senior high school. It specifically focuses on the methods and issues of teaching Japanese in high schools. Topics covered include the history of teaching Kokugo, national guidelines, course design, material development, teaching practicum, and textbook analysis.",
    "summary_j": "Japanese summary: このコースは、中学校と高等学校の国語教育の教員免許状取得に必要なコースの一つです。特に、高校での国語教育についての方法と問題を紹介します。歴史、学習指導要領、授業計画、教材開発、模擬授業、教材分析など、さまざまな内容が含まれます。"
  },
  {
    "cno": "LED318",
    "term": "Winter Term",
    "title_j": "教材・カリキュラム開発",
    "title_e": "Materials and Curriculum Development",
    "regno": 31223,
    "lang": "Language of Instruction: J",
    "summary_e": "This course aims to develop the ability to construct a curriculum and develop syllabi and teaching materials to achieve individual language learning goals. It covers the theory of curriculum design, considering various elements of educational settings such as target learners, time, and personnel. Through this course, students will acquire the necessary skills and abilities to implement, adjust, and improve a curriculum by planning it based on their understanding of the social context surrounding Japanese language learners.\n\n",
    "summary_j": "この科目は、言語プログラムにおけるカリキュラムデザインのアプローチの歴史をレビューし、必要に基づいた学習中心のアプローチを重視します。また、言語と言語学習の視点を考慮し、教材の分析と評価能力、教材設計プロセスの理解を開発します。ニーズ分析の実施、内容の計画立案、方法論の選択、教材の開発、カリキュラムの評価などを含むプロジェクトを通じて実践的な経験を積みます。"
  },
  {
    "cno": "LED357",
    "term": "Winter Term",
    "title_j": "外国語としての日本語教授法II",
    "title_e": "The Teaching of Japanese as a Foreign Language II",
    "regno": 31228,
    "lang": "Language of Instruction: J",
    "summary_e": "This course focuses on the aims and methods of teaching Japanese as a foreign language, with a specific emphasis on observation, simulation, and practice in the ICU Japanese Language Programs. It is designed for students who are preparing to teach Japanese as a foreign language. The course covers various topics including course design, material development, teaching practicum, textbook analyses, class observation, and tutorials. Through this course, students will be able to apply their knowledge to practice and improve their teaching skills. The grading policy includes attendance, lesson plans, teaching practicum, reports, class observation, tutorials, and a final exam.",
    "summary_j": "この授業では、外国語としての日本語教授の目的と方法に焦点を当て、ICUにおける日本語教育プログラムの見学、模擬実習を通じて実践の力を高めることを目指しています。外国語としての日本語を教えようとしている学生を対象にしており、教案作成、教材開発、模擬授業、教科書分析、授業見学、チュートリアルなど、さまざまなトピックをカバーしています。この授業を通じて、学生は知識を実践に応用し、教授技術を向上させることができます。成績評価基準には出席率、レッスンプラン、模擬授業、レポート、授業見学、チュートリアル、最終試験が含まれています。"
  },
  {
    "cno": "LED359",
    "term": "Winter Term",
    "title_j": "言語教育のための日本語文法 II",
    "title_e": "Topics in Japanese Grammar for Language Education II",
    "regno": 31229,
    "lang": "Language of Instruction: J",
    "summary_e": "English Summary: This course focuses on studying the Japanese grammar relevant to language teaching. It is aimed at Japanese language learners, those studying Japanese grammar, and those aspiring to become Japanese language teachers. The course involves activities that aim to uncover the grammatical rules of Japanese that individual speakers may not be aware of. It includes problem-solving exercises and examines grammar topics that were not covered in Japanese Grammar I. As long as students have a proficiency level of J7 or higher, even if they are not native Japanese speakers, they can participate in this course.",
    "summary_j": "Japanese Summary: このコースは、日本語の文法に関連するトピックに焦点を当て、それらを学びます。日本語学習者や日本語教師を対象にしており、日本語の文法規則を掘り起こすための作業を行います。授業では多くの問題解きが行われ、日本語文法 I では扱われなかった文法事項について考察します。J7以上の日本語力がある人はこの授業に参加できます。"
  },
  {
    "cno": "LAW101",
    "term": "Winter Term",
    "title_j": "国際法概論",
    "title_e": "Introduction to International Law",
    "regno": 31230,
    "lang": "Language of Instruction: J",
    "summary_e": "English Summary: This course is a foundation course for law majors and is a prerequisite for various international law courses. The course aims to introduce students to the basics of international law and focuses on three main parts: Essence, Issues, and Humanity. The Essence section covers the history and major principles of international law, while the Issues section explores contemporary topics such as security and human rights. The Humanity section looks at the lives and activities of individuals in relation to international law. The course is taught in Japanese with English being used as a complementary language.",
    "summary_j": "Japanese Summary: この講義は法学メジャーの基礎科目であり、国際法の数々の科目の前提条件となります。この講義の目的は、国際法の基礎を学生に紹介することであり、エッセンス、イシュー、人間の3つのパートに焦点を当てています。エッセンス部門では、国際法の歴史と主要な原則について学びます。イシュー部分では、安全保障や人権などの現代の問題を取り上げます。人間の部分では、国際法と関連する個人の生活と活動に焦点を当てています。講義は日本語で行われ、英語は補完的な言語として使用されます。"
  },
  {
    "cno": "LNG218",
    "term": "Winter Term",
    "title_j": "社会言語学",
    "title_e": "Sociolinguistics",
    "regno": 31242,
    "lang": "Language of Instruction: E",
    "summary_e": "This course explores the social function of language from a micro-linguistics perspective. It re-examines concepts such as language, society, speech community, and code, analyzing the linguistic choices speakers make to express their identity in a social context. The course aims to deepen understanding of the relationship between language and society, develop the ability to explain concepts in one's own words, and internalize the learned materials to apply them in real-life situations. The topics covered include linguistics, sociolinguistics, languages and dialects, solidarity, and gender. The course grading policy consists of assignments, exams, papers/presentations, and participation. It is encouraged to discuss homework assignments with classmates, but each student is responsible for writing their own report and giving credits to external sources.",
    "summary_j": "このクラスでは、言語の社会的構造と関連して言語を分析します。私たちは日常会話で中国の人々が中国語を話す、または「私たち」が日本人が日本語を話すと言うことがありますが、このクラスでは言語、社会、話し言葉のコミュニティ、コードなどの概念を再評価し、話し手が社会の文脈で自分のアイデンティティを表現するために行う言語の選択を分析します。"
  },
  {
    "cno": "LIT107",
    "term": "Winter Term",
    "title_j": "英文学史 II",
    "title_e": "History of English Literature II",
    "regno": 31245,
    "lang": "Language of Instruction: J",
    "summary_e": "This is a historical survey of English literature from the beginnings (Beowulf) to the present day. The main objective of this course is to learn about major authors in English literature and their works from the Romantic period to the present day. English literature during this period reflects many changes in British society. For example, through these works, we can learn how various ideas and ideologies were created and competed for hegemony. Furthermore, English literature is not limited to the British Isles; it is a global phenomenon in a sense. It helps us understand how the world became globalized and diversified while experiencing violence, wars, and conflicts. In this course, we will situate the works in these changes and try to understand English literature in its multiple contexts.",
    "summary_j": "これは、英文学の始まり（ベオウルフ）から現在までの歴史的な調査です。このコースの主な目的は、ロマン派時代から現代までの英文学の主要な作家とその作品について学ぶことです。この時期の英文学は、イギリス社会の様々な変化を反映しています。例えば、それらの作品を通して様々な思想やイデオロギーが生まれ、覇権を争ったことを学ぶことができます。また、英文学はイギリス諸島に限定されないグローバルな現象であり、暴力や戦争、紛争を経験しながら世界がどのようにグローバル化し多様化していったかを理解するのに役立ちます。このコースでは、変化の中で作品を位置づけ、英文学を複数の文脈で理解することを目指します。"
  },
  {
    "cno": "MCC105",
    "term": "Winter Term",
    "title_j": "ヒューマン・コミュニケーション原論",
    "title_e": "Theories of Human Communication",
    "regno": 31267,
    "lang": "Language of Instruction: J",
    "summary_e": "English Summary: This course explores various concepts and theories of communication studies and how they relate to our everyday lives. It focuses on analyzing concrete and specific communicative phenomena from a relational perspective. The course also covers topics such as language, space and time, culture, education, labor, media, and globalization. Attendance is emphasized, and class activities and exams are all part of the grading criteria.",
    "summary_j": "Japanese Summary: この授業では、コミュニケーション学のさまざまな概念や理論、そしてそれらが私たちの日常生活とどのような関係にあるのかを探究します。特に、他の人との関係性の観点から具体的なコミュニケーション現象を分析することに焦点を当てています。言語、時空間、文化、教育、労働、メディア、グローバル化などのトピックも取り上げられます。出席が重視され、クラスの活動や試験は成績評価の基準となります。"
  },
  {
    "cno": "MCC237",
    "term": "Winter Term",
    "title_j": "メディア翻訳",
    "title_e": "Media Translation",
    "regno": 31273,
    "lang": "Language of Instruction: E",
    "summary_e": "Summary (English): This course focuses on the role of media and technology in shaping culture and the various translation practices associated with different media cultures. It explores connections between media theory and translation theory and practice, as well as topics such as film translation, subtitles and dubbing, and translation in graphic narratives. The course aims to increase understanding of theories of media translation, engage in comparative analysis of cultural productions, and provide opportunities for translation practice.",
    "summary_j": "要約（日本語）：このコースでは、メディアとテクノロジーが文化形成に果たす役割と、異なるメディア文化に関連付けられるさまざまな翻訳プラクティスに焦点を当てています。メディア理論と翻訳理論や実践の関連性、映画翻訳、字幕と吹き替え、グラフィックナラティブ（マンガ、コミックス）の翻訳などのトピックにも触れます。このコースでは、メディア翻訳の理論を理解し、文化制作物の比較分析を行い、翻訳の実践の機会を提供することを目指しています。"
  },
  {
    "cno": "MCC254",
    "term": "Winter Term",
    "title_j": "ドキュメンタリー・フィルム制作",
    "title_e": "Documentary Film Making",
    "regno": 31277,
    "lang": "Language of Instruction: J",
    "summary_e": "Summary in English: In this course, students will take on the roles of producer, scriptwriter, director, and/or cameraman to create a documentary film. The aim of this class is for students to develop the skills to critically examine the world around them, express their feelings and opinions through film, and find ways to communicate with the audience. The course will focus on the theme of \"city/place\" and explore how documentary films can capture the history, culture, and memory of a place. Students will work in groups to produce their own documentary films and engage in discussions and screenings of their work. Attendance, participation, and the completion of various assignments will contribute to the grading for this course.",
    "summary_j": "Summary in Japanese: このコースでは、学生はプロデューサー、脚本家、監督、カメラマンなどの役割を果たしながら、ドキュメンタリー映画を制作する必要があります。学生は、ドキュメンタリー映画の制作を通じて、(1)周りの世界を批評的に観察するための基本的なスキルを開発し、(2)映画を通じて自分の気持ちや意見を表現し、(3)観客とのコミュニケーションの方法を見つけることを期待されています。"
  },
  {
    "cno": "MUS205",
    "term": "Winter Term",
    "title_j": "作曲研究",
    "title_e": "Studies in Musical Composition",
    "regno": 31285,
    "lang": "Language of Instruction: J",
    "summary_e": "This course is divided into two parts. The first part focuses on analyzing compositional methods and musical languages of historical masterpieces. The second part is dedicated to practical training in harmony and counterpoint. By the end of the course, students are expected to compose a musical piece in any style using any compositional technique. Prior completion of the Basic Study of Music II or equivalent knowledge and skills is required.",
    "summary_j": "このコースは２部分に分かれています。第1部では、歴史的な優れた作品の作曲法と音楽的言語について分析することを重視しています。第2部は和声と対位法の実習に注力しています。コース終了時には、履修者は任意の様式や技法を使って自由な作曲をすることを促されます。基礎音楽理論IIの履修が必要です。"
  },
  {
    "cno": "MUS209",
    "term": "Winter Term",
    "title_j": "音楽マネージメント概論",
    "title_e": "Introduction to Music Management",
    "regno": 31286,
    "lang": "Language of Instruction: J",
    "summary_e": "This course explores the meaning, role, and concept of music management in society through real cases from Japan and overseas, and discussions about future practical guidelines. It also examines how arts and culture are produced within social structures and powers, and analyzes the social roles of music and arts today. Topics covered in the course include the influence of social modernization on arts and culture, popular music and cultural industries since the 20th century, creative industries in post-Fordism, music and art management in the 20th century, and counterculture and subculture. By the end of the course, students are expected to contextualize their own ideas about the relationship between music/arts and social structures/powers, communicate their thoughts through discussions and presentations, and develop perspectives in understanding the relationship between music/arts and society in everyday life.",
    "summary_j": "このコースでは、日本や海外の実際の事例を通じて、音楽マネージメントの社会的な意味、役割、理念について学び、将来の実践的なガイドラインについて議論します。また、芸術や文化が社会構造や権力の中でどのように生産されているか、そして現代の音楽やアートの社会的な役割を分析する機会も提供されます。このコースでは、アートや文化の近代化以来の社会的な影響、20世紀以降のポピュラー音楽や文化業界、ポストフォーディズムのクリエイティブ産業、20世紀以降の音楽やアートのマネージメント、カウンターカルチャーやサブカルチャーなどのトピックが含まれます。また、音楽やアートの管理が直面する可能性や課題、音楽やアートと社会の関わりについての洞察を広げる機会も提供されます。"
  },
  {
    "cno": "PHR108",
    "term": "Winter Term",
    "title_j": "旧約聖書学概論",
    "title_e": "Introduction to the Old Testatment",
    "regno": 31290,
    "lang": "Language of Instruction: J",
    "summary_e": "This course provides an introductory study of the literary and socio-historical elements and major ideas of the Old Testament. It aims to help students understand the worldview, essential thought, and daily life of the ancient Israelites, as well as reflect on the messages of the Old Testament for modern society. The course covers various topics, including creation stories, flood narratives, codes of law, theological concepts, piety in the Psalms, love, and the influence of the Old Testament on philosophy and ethics. Students will be evaluated based on class participation, a midterm exam, and a final report.",
    "summary_j": "このコースは、旧約聖書の文学的構成および思想内容を初心者向けに学ぶためのクラスです。学生は旧約聖書の世界観や思想、古代イスラエル人の日常生活に関する知識を深めると共に、旧約聖書が現代社会に与えるメッセージについて考察します。創造物語、洪水物語、法典、神学的概念、詩編の敬虔性、愛、そして旧約聖書が哲学や倫理に与えた影響など、さまざまなテーマをカバーします。学生の評価は授業参加度、中間試験、期末レポートで行われます。"
  },
  {
    "cno": "PHR385",
    "term": "Winter Term",
    "title_j": "組織神学研究",
    "title_e": "Seminar in Systematic Theology",
    "regno": 31299,
    "lang": "Language of Instruction: E",
    "summary_e": "This advanced course examines the Christian claim that Jesus’ crucifixion brings salvation and the diverse interpretations of this claim within Christian theology. The course explores various understandings of the nature of sin, the relationship between Christ’s life, death, resurrection, and ascension, the role of the Holy Spirit, the divinity and humanity of Jesus, and the Trinity. The course also considers feminist theologians' critiques of interpretations of Christ’s crucifixion. Investigating Christian understandings of Christ’s crucifixion serves as a focal point for studying Christian systematic theology as a whole. The learning goals include analyzing diverse Christian understandings, exploring the relationship between Christ’s crucifixion and other theological topics, and understanding the field of systematic theology in relation to other areas of study. The grading policy includes attendance, participation, responses to reading questions, and a research paper.",
    "summary_j": "この高度なコースでは、キリスト教の主張であるイエスの磔刑が救いをもたらすという点について調査します。この主張はキリスト教信仰において中心的なものですが、何世紀にもわたって驚くほど多様な方法で理解されてきました。磔刑のさまざまな解釈は、しばしば罪の本質やキリストの生涯、死、復活、昇天の関係、キリストの救いの働きと聖霊の働きの関係、イエスが神であり人であるということの意味、そして三位一体の神の本質という他の重要な神学的トピックの異なる理解を明らかにします。さらに、フェミニスト神学者などは、イエスの磔刑のいくつかの解釈に対する重要な批判を提供してきました。イエスの磔刑のキリスト教の理解を調査することは、キリスト教の体系的神学全体を航海するための焦点を提供します。"
  },
  {
    "cno": "POL213",
    "term": "Winter Term",
    "title_j": "西欧政治思想史 III",
    "title_e": "History of Western Political Thought III",
    "regno": 31309,
    "lang": "Language of Instruction: J",
    "summary_e": "This course focuses on late modern political philosophers such as Marx, Weber, and Arendt, and aims to familiarize students with classical texts of political thought from the mid-19th century to the early 20th century. The course covers important topics such as liberty, socialism, gender, value relativism, and modernity. The learning goals include deepening understanding of classical texts, enhancing reading skills, reflecting on political issues through critical reading of classical texts, and improving academic skills through presentations and discussions. The course is taught in Japanese, and the grading policy includes active participation, mid-term test, and final test.",
    "summary_j": "このコースでは、マルクス、ウェーバー、アーレントなど後期近代の政治思想家を取り上げ、19世紀半ばから20世紀初頭の古典的な政治思想のテキストに焦点を当て、自由、社会主義、ジェンダー、価値相対主義、現代性などの重要なトピックについて学習することを目指しています。学修目標は、古典的なテキストの理解を深めること、読解力を向上させること、古典的なテキストを批判的に読み解きながら政治的問題について考えること、発表やディスカッションを通じて学問的なスキルを向上させることです。"
  },
  {
    "cno": "PSY365",
    "term": "Winter Term",
    "title_j": "社会心理学研究",
    "title_e": "Studies in Social Psychology",
    "regno": 31319,
    "lang": "Language of Instruction: E",
    "summary_e": "This advanced course in social psychology aims to select important themes in the field and critically examine research conceptualization, design, and methodology through reading articles and engaging in discussions. The course has three specific goals: deepening understanding of various social-psychological issues, critically reading important articles, and improving awareness and mastery of social-psychological issues and research methods. The learning goals include cultivating awareness of important social psychological problems and obtaining a deeper understanding of research methodology. The course covers topics such as prosociality, persuasion, conformity, stereotypes and prejudice, political psychology, and love. The grading policy includes interactive assignments, active participation, presentations, and a final report.",
    "summary_j": "この社会心理学の上級コースでは、重要なテーマを選択し、記事の読解や議論を通じて、研究概念、設計、方法論を批判的に検討することを目指しています。コースには、社会心理学のさまざまな問題の理解を深める、重要な論文を批判的に読む、社会心理学の問題意識と研究方法の認識と習得を向上させるという3つの具体的な目標があります。学習目標には、重要な社会心理学的問題の認識を養い、研究方法論の深化を含んでいます。コースでは、互恵行動、説得、従順、ステレオタイプと偏見、政治心理学、愛などのテーマが取り上げられます。評価方法には、インタラクティブな課題、積極的な参加、プレゼンテーション、最終レポートが含まれています。"
  },
  {
    "cno": "PPL203",
    "term": "Winter Term",
    "title_j": "比較政治制度論",
    "title_e": "Comparative Political Institutions",
    "regno": 31321,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on analyzing the policy processes of planning, decision, implementation, and evaluation in relation to political actors and institutions. Students will gain an understanding of the current situation and also explore future institutional design and the changing relationships between actors. The course covers a wide range of topics including political institutions, presidential systems, parliamentary systems, electoral rules, and authoritarian institutions. Theoretical concepts will be emphasized, but real-world examples from countries like Japan, Indonesia, and Cambodia will also be used to illustrate how these concepts apply in practice. The course aims to compare political institutions in democratic and non-democratic countries, categorize and analyze political institutions in developing countries, and assess the degree of democracy and non-democracy.",
    "summary_j": "この講座では、政治制度について学ぶ機会を提供します。様々な政治制度に関するトピックを幅広く取り上げます。例えば、大統領制と議院内閣制、選挙制度、様々な独裁政権などについて学びます。選挙制度は、政党の数に影響を与え、選挙結果にどのような影響を与えるのでしょうか。独裁政権の政治制度はどのように異なるのでしょうか。講義では理論と概念が重視されますが、日本、インドネシア、カンボジアなどのアジアの国々の事例を用いて、これらの概念と理論が実際の現実にどのように応用されるかを示します。講義では開発途上国と先進国の両方の例が提供されますが、この講座の主な焦点は開発途上国の政治制度について学ぶことです。また、ほとんどの週に講義が行われます。概念をより深く理解するために、時折DVDが使用されることがあります。成績評価はクラスプレゼンテーションが20％、2つの短いエッセイが40％、DVDの反応論文が20％、参加度（オンラインのコメントシート）が20％で評価されます。"
  },
  {
    "cno": "PPL208",
    "term": "Winter Term",
    "title_j": "マスメディアと公共政策",
    "title_e": "Mass Media and Public Policy",
    "regno": 31323,
    "lang": "Language of Instruction: J",
    "summary_e": "This course will analyze the relationship between government policies and mass media reports, focusing on constitutional reform, security issues, and nuclear energy policy. The role of mass media in shaping public opinion during the process of public policy making will be explored. Students will learn how to use tools such as media reporting and commentaries to obtain fair views of policy discussions. The course also aims to develop students' intellectual skills to construct logical opinions, present them in public, and engage in constructive debates.",
    "summary_j": "このコースでは、政府の政策とマスメディアの報道の関係に焦点を当て、憲法改革、安全保障問題、原子力政策などを題材に、公共政策形成のプロセスにおける公共意見の形成において、マスメディアが果たす役割を分析します。学生は、マスメディアの報道やコメントなどのツールを使用して、公共政策の討論に対する公正な視点を得る方法を学びます。"
  },
  {
    "cno": "SOC309",
    "term": "Winter Term",
    "title_j": "科学技術社会学",
    "title_e": "Sociology of Science and Technology",
    "regno": 31334,
    "lang": "Language of Instruction: J",
    "summary_e": "This course provides an overview of the sociology of science and technology, exploring the social and ethical implications of scientific and technological innovations. It examines different social factors that limit or promote advances in science and technology. The course aims to understand the role of science and technology in society by delving into social controversies related to science and technology. It introduces concepts such as scientific uncertainties, public understanding of science, citizen participation, and precautionary principles. The course encourages critical thinking and the ability to read academic papers.",
    "summary_j": "本コースは、科学技術社会学の概要を提供し、科学技術のイノベーションの社会的および倫理的な影響を探求します。科学技術の発展を制約するあるいは推進するさまざまな社会的要因についても調べます。本コースでは、遺伝子組み換え作物や二重利用技術、災害管理など、科学技術に関連する社会的な論争に深く入り込み、科学技術が社会で果たす役割を理解することを目指します。本コースでは、科学的な不確実性、科学の公共理解、市民参加、予防原則などの概念を紹介します。また、批判的思考や学術論文の読解能力を養うことを重視しています。"
  },
  {
    "cno": "POL102",
    "term": "Winter Term",
    "title_j": "国際政治学",
    "title_e": "International Politics",
    "regno": 31340,
    "lang": "Language of Instruction: E",
    "summary_e": "This course introduces the field and methodology of comparative politics. It uses comparative methods to study political systems and institutions, political development, electoral systems and party systems, public opinion, civic participation, and social movements in democratic and authoritarian political systems. The course aims to provide students with a basic theoretical background in the main explanatory theories of International Relations, as well as an introduction to constitutive theories and their application to empirical case studies and global issues. The course takes an interactive approach, where students are encouraged to ask and answer questions on selected topics. Students will be graded based on a mid-term test, a short essay on a final discussion topic, and their participation in class discussions.",
    "summary_j": "このコースは、学生中心のアプローチで国際政治の導入を目指しています。従来の国際関係の基礎コースとは異なり、使用されるテキストは学生の質問を中心に構成されています。このクラスで1つの質問が提出され、指導者がテキストに寄稿するよう招待される結果となりました。そのため、学生は選択されたトピックに関する質問をすることを奨励され、回答することが求められます。授業は、国際関係の主要な理論を紹介することから始まり、学生に批判的な視点を紹介します。すべての理論は実証的な事例研究を参考に説明されます。クラスディスカッションは週に1回行われます。期中試験は理論の理解を試すために設計され、その後、学生は一連のグローバルな問題について意見を述べることができます。目標は、現代の事例研究と理論的なアイデアと概念を組み合わせることによって、理論と実践を統合することです。"
  },
  {
    "cno": "QEED526",
    "term": "Winter Term",
    "title_j": "IB教育哲学演習：MYP",
    "title_e": "Seminar in Philosophy of IB Education: MYP",
    "regno": 32104,
    "lang": "Language of Instruction: E",
    "summary_e": "In this course, students will learn about the educational theories that support IB education and how they are applied to the MYP curriculum. Students will also develop a unit planner in their chosen area of study. The learning goals of this course include identifying and evaluating teaching and learning theories, applying these theories to the MYP curriculum, and developing skills to become lifelong learners and pedagogical leaders in the field of IB education.",
    "summary_j": "このコースでは、IB教育を支える教育理論を特定し、MYPカリキュラムにどのように適用されるかを学びます。学生は自分の選択した分野でユニット計画を作成します。学修目標は、IB教育を支える教育理論を特定し、評価し、MYPカリキュラムに適用する能力を開発することです。また、IB教育の背景を持つ終身学習者および教育リーダーになるためのスキルを開発することも目指します。"
  },
  {
    "cno": "QEED527",
    "term": "Winter Term",
    "title_j": "IB教育哲学演習：DP",
    "title_e": "Seminar in Philosophy of IB Education: DP",
    "regno": 32105,
    "lang": "Language of Instruction: E",
    "summary_e": "This course focuses on the educational theory that supports IB education and how it is applied to the DP curriculum. Students will deepen their understanding of the DP curriculum framework, examine teaching and learning theories in their chosen subject, and develop skills to become lifelong learners and pedagogical leaders in the field of IB education. The course includes topics such as understanding the subject guides, designing a course syllabus, exploring TOK link, and reflecting on pedagogical leadership. Attendance is required, and students are expected to actively participate in discussions and provide feedback on their peers' work. Assessment tasks include course planning, mock class projects, term papers, and reflection exercises.\n\n[Japanese Summary]",
    "summary_j": "このコースは、IB教育を支える教育理論を学び、DPカリキュラムにどのように応用されるかに焦点を当てています。学生はDPカリキュラムの枠組みについて理解を深め、選択した科目での教育理論を調査し、IB教育のフィールドで終身学習者および教育リーダーとなるためのスキルを開発します。このコースでは、科目ガイドの理解、科目のシラバスの設計、TOKリンクの探索、教育リーダーシップの反省などのトピックが含まれています。出席が必要であり、学生は積極的にディスカッションに参加し、他の学生の作業に有意義なフィードバックを提供することが期待されています。評価課題には、コースの計画、モックの授業プロジェクト、レポート、反省の演習などがあります。"
  },
  {
    "cno": "QPPI523",
    "term": "Winter Term",
    "title_j": "国連と持続可能な開発",
    "title_e": "The United Nations and Sustainable Development",
    "regno": 32207,
    "lang": "Language of Instruction: E",
    "summary_e": "English Summary: This course focuses on policy issues related to the Sustainable Development Goals (SDGs) and the role of the UN in promoting and monitoring their implementation. It specifically addresses SDG-1 on Poverty Eradication and the challenges faced by vulnerable countries. The course aims to provide students with the necessary knowledge and pragmatic skills for their future careers in international public service.",
    "summary_j": "Japanese Summary: このコースでは、SDGsの実施を推進しモニタリングする国連システムの役割や政策課題について学びます。特にSDG-1の貧困撲滅を中心とした経済・社会・環境の持続可能な開発分野や最貧国や小島嶼国の課題に焦点を当てます。将来のキャリアに役立つ知識と実践的な能力を身につけることが目標です。"
  },
  {
    "cno": "QPPI526",
    "term": "Winter Term",
    "title_j": "人道アクションと自然災害　II",
    "title_e": "Humanitarian Action and Natural Disasters II",
    "regno": 32209,
    "lang": "Language of Instruction: E",
    "summary_e": "This course aims to deepen students' understanding of Japan's Disaster Risk Reduction (DRR) policies and their implementation through a field trip to the Tohoku area, which was devastated by the Great East Japan Earthquake and tsunami in 2011. The trip includes visits to affected sites and discussions with representatives from local authorities, community organizations, and individuals involved in reconstruction and rehabilitation activities. The learning goals include learning from the experiences of the 2011 disaster, understanding the relevance of the Sendai Framework on DRR, and analyzing rehabilitation efforts and challenges.",
    "summary_j": "このコースは、学生が日本の災害リスク軽減政策とその実施についての理解を深めることを目的としています。2011年の東日本大震災と津波によって壊滅的な被害を受けた東北地方へのフィールドトリップを通じて、被災地を訪れ、地方自治体、コミュニティ団体、復興活動に関与する個人との対話を行います。学修目標には、2011年の災害の経験から学ぶこと、仙台フレームワークの災害リスク軽減への関連性を理解すること、復興活動の努力と課題を分析することが含まれています。"
  },
  {
    "cno": "QPSC504",
    "term": "Winter Term",
    "title_j": "社会文化分析特講 I",
    "title_e": "Social and Cultural Analysis Special Course I",
    "regno": 32212,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is an advanced course for studying society and culture. Various theoretical approaches have been applied to analyze contemporary food and agriculture issues. In this lecture, students will deepen their understanding of the current state of phenomena and processes concerning food and agriculture while surveying theoretical approaches for global events and languages and identities at an individual scale. Ultimately, students develop the ability to select theoretical approaches to cautiously and critically discuss social and cultural phenomena which students are interested in.",
    "summary_j": "このコースは、社会と文化を学ぶための高度なコースです。さまざまな理論的アプローチが、現代の食品と農業の問題を分析するために適用されてきました。この講義では、学生は食品と農業に関する現象やプロセスの現在の状態を理解を深めると同時に、グローバルな出来事や個人の尺度での言語やアイデンティティに対する理論的アプローチを調査します。最終的に、学生は自分が興味を持つ社会文化現象を慎重に批判的に議論するための理論的アプローチを選択する能力を開発します。"
  },
  {
    "cno": "QNMS502",
    "term": "Winter Term",
    "title_j": "量子情報科学",
    "title_e": "Quantum Information Science",
    "regno": 32406,
    "lang": "Language of Instruction: J",
    "summary_e": "In this course, students will learn the basics of quantum information science. The invention of lasers, semiconductor devices, and MRI is considered to be a major product of \"Quantum Revolution I.\" Today, many scientists are witnessing the rapid progress of quantum technology and predicting the arrival of a new future led by Quantum Revolution II. In this second quantum revolution, quantum technologies such as quantum computing, quantum simulation, quantum communication, quantum sensing/measurement, etc. that greatly exceed the limits of the classical counterpart will emerge, and it is expected that they will be available to many people. In this course, the progress of these technologies, which have many physical and informational elements, and the basics of quantum information processing are discussed. While the class may not cover the entire field of quantum information science, it aims to provide a foundation for further learning and research by comprehensively studying the basics of classical information and the role of quantum information circuits.",
    "summary_j": "このコースでは、量子情報科学の基礎を学びます。レーザー、半導体デバイス、MRIの発明は、「量子革命I」が生んだ大きな産物と考えられています。今日、多くの科学者が量子技術の急速な進歩に注目しており、量子革命IIが導く新しい未来の到来を予測しています。この2番目の量子革命では、量子コンピューティング、量子シミュレーション、量子通信、量子センシング/計測など、古典の限界を大きく凌駕した量子テクノロジーが登場し、多くの人に利用可能なテクノロジーになると予想されています。物理的かつ情報の要素を多分に兼ね備えたこれらの技術の進歩、また量子情報処理の基礎などを本コースではカバーします。この授業では、もちろん量子情報を網羅するというゴールには到底たどり着かない。しかし、これら量子情報処理関連の文献を少しずつでも読めるような古典情報の基礎、量子情報回路の役割などを包括的に学習していくことで、漠然としていた量子情報分野への興味を実際の学びや研究につなげる足がかりを作っていく。"
  },
  {
    "cno": "QADT601",
    "term": "Winter Term",
    "title_j": "研究者のための技法 I - アカデミック・プレゼンテーション",
    "title_e": "Techniques for Researchers I - Academic Presentations",
    "regno": 32502,
    "lang": "Language of Instruction: E",
    "summary_e": "This course is for doctoral students and requires them to attend or give presentations at conferences, symposia, seminars, or forums related to their research theme. They must then write a report on each event and submit them to their advisor. The goal of the course is for students to gain specialized knowledge and learn practical methods of presentation by attending these events.",
    "summary_j": "この科目は博士課程の学生を対象としており、自身の研究テーマに関連した学会、シンポジウム、セミナー、研究会等に参加または研究発表し、各イベントについてのレポートを作成しアドバイザーに提出することが求められます。この科目の目標は、学生がこれらのイベントに参加することで専門知識を獲得し、プレゼンテーションの実践的な方法を学ぶことです。"
  }
]